
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Попытка
		ЗаполнитьВозможныеВидыОповещений();
	Исключение
		// обработка исключения не требуется
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗаполнитьВозможныеВидыОповещений()
	
	МодульОбработчиков = ОбщегоНазначенияКлиент.ОбщийМодуль("ОповещениеПользователейБТСКлиент");
	Обработчики = МодульОбработчиков.ОбработчикиОповещений();
	
	Для Каждого ДанныеВидаОповещения Из Обработчики Цикл
		Элементы.ВидОповещения.СписокВыбора.Добавить(ДанныеВидаОповещения.Ключ);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти