
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьСтатусИзбранногоИнструмента(Инструмент) Экспорт
	
	Запись = РегистрыСведений.биг_ИзбранныеИнструменты.СоздатьМенеджерЗаписи();
	Запись.Пользователь = ПараметрыСеанса.АвторизованныйПользователь;
	Запись.Инструмент	= Инструмент;
	Запись.Прочитать();
	
	Если ЗначениеЗаполнено(Запись.Избранное) Тогда
		СтатусИзбранного = Запись.Избранное;
	Иначе
		СтатусИзбранного = Ложь;
	КонецЕсли;
	
	Возврат СтатусИзбранного;
		
КонецФункции

Функция ПолучитьИзбранныеИнструменты(Биржа, ТипИнструментов) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	биг_ИзбранныеИнструменты.Инструмент КАК Инструмент,
	|	биг_ИзбранныеИнструменты.РазмерПлеча КАК РазмерПлеча
	|ИЗ
	|	РегистрСведений.биг_ИзбранныеИнструменты КАК биг_ИзбранныеИнструменты
	|ГДЕ
	|	биг_ИзбранныеИнструменты.Пользователь = &Пользователь
	|	И биг_ИзбранныеИнструменты.Избранное
	|	И биг_ИзбранныеИнструменты.Инструмент.Владелец = &Владелец
	|	И биг_ИзбранныеИнструменты.Инструмент.instType = &ТипИнструментов"; 
	
	Запрос.УстановитьПараметр("Пользователь", 		ПараметрыСеанса.АвторизованныйПользователь);
	Запрос.УстановитьПараметр("Владелец", 			Биржа);
	Запрос.УстановитьПараметр("ТипИнструментов", 	ТипИнструментов);
	
	ТаблицаИнструментов = Запрос.Выполнить().Выгрузить();
	
	КоллекцияДляКлиента = ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаИнструментов);	
	Возврат КоллекцияДляКлиента;
		
КонецФункции

Процедура УдалитьИзбранныйИнструмент(Инструмент, Плечо) Экспорт
	
	УстановитьСтатусИзбранного(Инструмент, Плечо, Ложь);
	
КонецПроцедуры                                

Процедура ДобавитьИзбранныйИнструмент(Инструмент, Плечо) Экспорт
	
	УстановитьСтатусИзбранного(Инструмент, Плечо, Истина);
	
КонецПроцедуры                                

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьСтатусИзбранного(Инструмент, Плечо, Значение)
	
	Набор = РегистрыСведений.биг_ИзбранныеИнструменты.СоздатьНаборЗаписей();
	Набор.Отбор.Пользователь.Установить(ПараметрыСеанса.АвторизованныйПользователь);
	Набор.Отбор.Инструмент.Установить(Инструмент);
	Набор.Прочитать();
	
	Если Набор.Количество() = 1 Тогда
		Запись = Набор[0];
	ИначеЕсли Набор.Количество() = 0 Тогда
		Запись = Набор.Добавить();
	Иначе
		ВызватьИсключение("Получено больше одной записи. Ошибочная ситуация");
	КонецЕсли;                                                             
	
	Запись.Пользователь = ПараметрыСеанса.АвторизованныйПользователь;
	Запись.Инструмент	= Инструмент;
	Запись.Плечо		= Плечо;
	Запись.Избранное	= Значение;	
	
	Набор.Записать(Истина);
	
КонецПроцедуры	

#КонецОбласти

#КонецЕсли
