
#Область ПрограммныйИнтерфейс

// Функция для поиска паттернов разворота в зависимости от предыдущего тренда
Функция ПоискПаттерновРазворота(ТаблицаСвечей, Тренд) Экспорт
	
	Если ТаблицаСвечей.Количество() < 3 Тогда
		Сообщить("Входящая таблица содержит менее 3-х свечей, анализ не возможен");
		Возврат Неопределено;	
	КонецЕсли;
	
	// Создаем массив для хранения найденных паттернов
	НайденныеПаттерны = Новый Массив;
	
	// Проходим по всем свечам, начиная с третьей (индекс 2)
	Для Индекс = 2 По ТаблицаСвечей.Количество() - 1 Цикл
		// Получаем данные текущей и предыдущих свечей
		ТекущаяСвеча = ТаблицаСвечей[Индекс];
		ПредыдущаяСвеча = ТаблицаСвечей[Индекс - 1];
		ПредыдущаяСвечаДва = ТаблицаСвечей[Индекс - 2];
		
		// Группа паттернов для разворота к восходящему тренду
		Если Тренд = ПредопределенноеЗначение("Перечисление.биг_ВидыТрендов.Нисходящий") ИЛИ Тренд = ПредопределенноеЗначение("Перечисление.биг_ВидыТрендов.Флэт") Тогда
			
			Если ЯвляетсяМолотом(ТекущаяСвеча) Тогда
				НайденныеПаттерны.Добавить("Молот на индексе " + Индекс);
			КонецЕсли;
			
			Если ЯвляетсяБычьимПоглощением(ТекущаяСвеча, ПредыдущаяСвеча) Тогда
				НайденныеПаттерны.Добавить("Бычье поглощение на индексе " + Индекс);
			КонецЕсли;
			
			Если ЯвляетсяУтреннейЗвездой(ТекущаяСвеча, ПредыдущаяСвеча, ПредыдущаяСвечаДва) Тогда
				НайденныеПаттерны.Добавить("Утренняя звезда на индексе " + Индекс);
			КонецЕсли;
			
			Если ЯвляетсяЗвездойДоджи(ТекущаяСвеча) Тогда
				НайденныеПаттерны.Добавить("Звезда доджи на индексе " + Индекс);
			КонецЕсли;
			
		КонецЕсли;
		
		// Группа паттернов для разворота к нисходящему тренду
		Если Тренд = ПредопределенноеЗначение("Перечисление.биг_ВидыТрендов.Восходящий") ИЛИ Тренд = ПредопределенноеЗначение("Перечисление.биг_ВидыТрендов.Флэт") Тогда
			
			Если ЯвляетсяМедвежьимПоглощением(ТекущаяСвеча, ПредыдущаяСвеча) Тогда
				НайденныеПаттерны.Добавить("Медвежье поглощение на индексе " + Индекс);
			КонецЕсли;
			
			Если ЯвляетсяВечернейЗвездой(ТекущаяСвеча, ПредыдущаяСвеча, ПредыдущаяСвечаДва) Тогда
				НайденныеПаттерны.Добавить("Вечерняя звезда на индексе " + Индекс);
			КонецЕсли;
			
			Если ЯвляетсяПеревернутымМолотом(ТекущаяСвеча) Тогда
				НайденныеПаттерны.Добавить("Перевернутый молот на индексе " + Индекс);
			КонецЕсли;
			
			Если ЯвляетсяЗвездойДоджи(ТекущаяСвеча) Тогда
				НайденныеПаттерны.Добавить("Звезда доджи на индексе " + Индекс);
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	// Возвращаем найденные паттерны
	Возврат НайденныеПаттерны;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция для проверки паттерна "Молот"
Функция ЯвляетсяМолотом(Свеча) Экспорт
	
	// Вычисляем размеры тела и теней
	ТелоСвечи 	= биг_Алг.Модуль(Свеча.ЦенаЗакрытия - Свеча.ЦенаОткрытия);
	НижняяТень 	= Мин(Свеча.ЦенаОткрытия, Свеча.ЦенаЗакрытия) - Свеча.ЦенаМинимум;
	ВерхняяТень = Свеча.ЦенаМаксимум - Макс(Свеча.ЦенаОткрытия, Свеча.ЦенаЗакрытия);
	
	// Условия молота
	Если НижняяТень > 2 / 3 * (Свеча.ЦенаМаксимум - Свеча.ЦенаМинимум) И
		ТелоСвечи < 1 / 3 * (Свеча.ЦенаМаксимум - Свеча.ЦенаМинимум) И
		ВерхняяТень < 1 / 3 * (Свеча.ЦенаМаксимум - Свеча.ЦенаМинимум) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// Функция для проверки паттерна "Бычье поглощение"
Функция ЯвляетсяБычьимПоглощением(ТекущаяСвеча, ПредыдущаяСвеча) Экспорт
	
	// Условия бычьего поглощения
	Если ПредыдущаяСвеча.ЦенаЗакрытия < ПредыдущаяСвеча.ЦенаОткрытия И
		ТекущаяСвеча.ЦенаЗакрытия > ТекущаяСвеча.ЦенаОткрытия И
		ТекущаяСвеча.ЦенаЗакрытия > ПредыдущаяСвеча.ЦенаОткрытия И
		ТекущаяСвеча.ЦенаОткрытия < ПредыдущаяСвеча.ЦенаЗакрытия Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// Функция для проверки паттерна "Утренняя звезда"
Функция ЯвляетсяУтреннейЗвездой(ТекущаяСвеча, ПредыдущаяСвеча, ПредыдущаяСвечаДва) Экспорт
	
	// Условия утренней звезды
	Если ПредыдущаяСвечаДва.ЦенаЗакрытия < ПредыдущаяСвечаДва.ЦенаОткрытия И
		биг_Алг.Модуль(ПредыдущаяСвеча.ЦенаЗакрытия - ПредыдущаяСвеча.ЦенаОткрытия) < 0.1 * (ПредыдущаяСвеча.ЦенаМаксимум - ПредыдущаяСвеча.ЦенаМинимум) И
		ТекущаяСвеча.ЦенаЗакрытия > ТекущаяСвеча.ЦенаОткрытия И
		ТекущаяСвеча.ЦенаЗакрытие > (ПредыдущаяСвечаДва.ЦенаОткрытия + ПредыдущаяСвечаДва.ЦенаЗакрытия) / 2 Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// Функция для проверки паттерна "Звезда доджи"
Функция ЯвляетсяЗвездойДоджи(Свеча) Экспорт
	
	// Вычисляем размеры тела и теней
	ТелоСвечи = биг_Алг.Модуль(Свеча.ЦенаЗакрытия - Свеча.ЦенаОткрытия);
	НижняяТень = Мин(Свеча.ЦенаОткрытия, Свеча.ЦенаЗакрытия) - Свеча.ЦенаМинимум;
	ВерхняяТень = Свеча.ЦенаМаксимум - Макс(Свеча.ЦенаОткрытия, Свеча.ЦенаЗакрытия);
	
	// Условия звезды доджи
	Если ТелоСвечи < 0.1 * (Свеча.ЦенаМаксимум - Свеча.ЦенаМинимум) И
		НижняяТень > 2 * ТелоСвечи И
		ВерхняяТень > 2 * ТелоСвечи Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// Функция для проверки паттерна "Медвежье поглощение"
Функция ЯвляетсяМедвежьимПоглощением(ТекущаяСвеча, ПредыдущаяСвеча) Экспорт
	
	// Условия медвежьего поглощения
	Если ПредыдущаяСвеча.ЦенаЗакрытия > ПредыдущаяСвеча.ЦенаОткрытия И
		ТекущаяСвеча.ЦенаЗакрытия < ТекущаяСвеча.ЦенаОткрытия И
		ТекущаяСвеча.ЦенаЗакрытия < ПредыдущаяСвеча.ЦенаОткрытия И
		ТекущаяСвеча.ЦенаОткрытия > ПредыдущаяСвеча.ЦенаЗакрытия Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// Функция для проверки паттерна "Вечерняя звезда"
Функция ЯвляетсяВечернейЗвездой(ТекущаяСвеча, ПредыдущаяСвеча, ПредыдущаяСвечаДва) Экспорт
	
	// Условия вечерней звезды
	Если ПредыдущаяСвечаДва.ЦенаЗакрытия > ПредыдущаяСвечаДва.ЦенаОткрытия И
		биг_Алг.Модуль(ПредыдущаяСвеча.ЦенаЗакрытия - ПредыдущаяСвеча.ЦенаОткрытия) < 0.1 * (ПредыдущаяСвеча.ЦенаМаксимум - ПредыдущаяСвеча.ЦенаМинимум) И
		ТекущаяСвеча.ЦенаЗакрытия < ТекущаяСвеча.ЦенаОткрытия И
		ТекущаяСвеча.ЦенаЗакрытие < (ПредыдущаяСвечаДва.ЦенаОткрытия + ПредыдущаяСвечаДва.ЦенаЗакрытия) / 2 Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// Функция для проверки паттерна "Перевернутый молот"
Функция ЯвляетсяПеревернутымМолотом(Свеча) Экспорт
	
	// Вычисляем размеры тела и теней
	ТелоСвечи 	= биг_Алг.Модуль(Свеча.ЦенаЗакрытия - Свеча.ЦенаОткрытия);
	НижняяТень 	= Мин(Свеча.ЦенаОткрытия, Свеча.ЦенаЗакрытия) - Свеча.ЦенаМинимум;
	ВерхняяТень = Свеча.ЦенаМаксимум - Макс(Свеча.ЦенаОткрытия, Свеча.ЦенаЗакрытия);
	
	// Условия перевернутого молота
	Если ВерхняяТень > 2 / 3 * (Свеча.ЦенаМаксимум - Свеча.ЦенаМинимум) И
		ТелоСвечи < 1 / 3 * (Свеча.ЦенаМаксимум - Свеча.ЦенаМинимум) И
		НижняяТень < 1 / 3 * (Свеча.ЦенаМаксимум - Свеча.ЦенаМинимум) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти



