
#Область ТиповыеОбработчики

Процедура ПередПодключением(Клиент) Экспорт 
	//Параметры = ПараметрыКлиента(Клиент); 
	//биг_ВебСокет_ВызовСервера.ЗаписатьВЛог("ПередПодключением",Клиент.Ключ,Параметры);	
КонецПроцедуры

Процедура ПриОткрытииСоединения(Соединение) Экспорт
	//Параметры = ПараметрыСоединения(Соединение);
	//биг_ВебСокет_ВызовСервера.ЗаписатьВЛог("ПриОткрытииСоединения",Соединение.Ключ,Параметры);
КонецПроцедуры

Процедура ПриПолученииСообщения(Соединение, Сообщение) Экспорт 
	Параметры = ПараметрыСоединения(Соединение); 
	Параметры.Вставить("Сообщение",Сообщение);
	
	Если Сообщение <> "pong" Тогда
		биг_ВебСокет_ВызовСервера.ЗаписатьВЛог("ПриПолученииСообщения",Соединение.Ключ,Параметры);	
	КонецЕсли;	
	
	биг_ОКХ_ВебСокет_ВызовСервера.ПриПолученииСообщения(Соединение, Сообщение);	
КонецПроцедуры

Процедура ПриОшибке(Соединение, КодОшибки, Описание) Экспорт  
	Параметры = ПараметрыСоединения(Соединение); 
	Параметры.Вставить("Код",КодОшибки);
	Параметры.Вставить("Описание",Описание);
	биг_ВебСокет_ВызовСервера.ЗаписатьВЛог("ПриОшибке",Соединение.Ключ,Параметры);
КонецПроцедуры    

Процедура ПриЗакрытииСоединения(Соединение, КодЗакрытия) Экспорт 	
	Параметры = ПараметрыСоединения(Соединение); 
	Параметры.Вставить("Код",КодЗакрытия);
	биг_ВебСокет_ВызовСервера.ЗаписатьВЛог("ПриЗакрытииСоединения",Соединение.Ключ,Параметры);
КонецПроцедуры

#КонецОбласти //ТиповыеОбработчики


#Область МаппингПараметров

Функция ПолучитьУРЛпоНазваниюКаналаПодписки(КаналПодписки, Демо) Экспорт
	
	СоответствиеАдресов = АдресаИДоступныеКаналыПодписки(Демо);
	Адрес = СоответствиеАдресов.Получить(КаналПодписки);
	Возврат Адрес;
			
КонецФункции

Функция АдресаИДоступныеКаналыПодписки(Демо)
	
	Соотв = Новый Соответствие;
    
    // URL для публичных каналов (всегда рабочий)
    URLПубличный = "wss://ws.okx.com:8443/ws/v5/public";
    // URL для приватных каналов (зависит от Demo)
    URLПриватный = ?(Демо, "wss://wspap.okx.com:8443/ws/v5/private", "wss://ws.okx.com:8443/ws/v5/private");
    
    // Публичные каналы
    Соотв.Вставить("instruments", URLПубличный);
    Соотв.Вставить("open-interest", URLПубличный);
    Соотв.Вставить("funding-rate", URLПубличный);
    Соотв.Вставить("price-limit", URLПубличный);
    Соотв.Вставить("opt-summary", URLПубличный);
    Соотв.Вставить("estimated-price", URLПубличный);
    Соотв.Вставить("mark-price", URLПубличный);
    Соотв.Вставить("index-tickers", URLПубличный);
    
    // Публичные каналы свечей mark-price
    Соотв.Вставить("mark-price-candle3M", URLПубличный);
    Соотв.Вставить("mark-price-candle1M", URLПубличный);
    Соотв.Вставить("mark-price-candle1W", URLПубличный);
    Соотв.Вставить("mark-price-candle1D", URLПубличный);
    Соотв.Вставить("mark-price-candle2D", URLПубличный);
    Соотв.Вставить("mark-price-candle3D", URLПубличный);
    Соотв.Вставить("mark-price-candle5D", URLПубличный);
    Соотв.Вставить("mark-price-candle12H", URLПубличный);
    Соотв.Вставить("mark-price-candle6H", URLПубличный);
    Соотв.Вставить("mark-price-candle4H", URLПубличный);
    Соотв.Вставить("mark-price-candle2H", URLПубличный);
    Соотв.Вставить("mark-price-candle1H", URLПубличный);
    Соотв.Вставить("mark-price-candle30m", URLПубличный);
    Соотв.Вставить("mark-price-candle15m", URLПубличный);
    Соотв.Вставить("mark-price-candle5m", URLПубличный);
    Соотв.Вставить("mark-price-candle3m", URLПубличный);
    Соотв.Вставить("mark-price-candle1m", URLПубличный);
    Соотв.Вставить("mark-price-candle1Yutc", URLПубличный);
    Соотв.Вставить("mark-price-candle3Mutc", URLПубличный);
    Соотв.Вставить("mark-price-candle1Mutc", URLПубличный);
    Соотв.Вставить("mark-price-candle1Wutc", URLПубличный);
    Соотв.Вставить("mark-price-candle1Dutc", URLПубличный);
    Соотв.Вставить("mark-price-candle2Dutc", URLПубличный);
    Соотв.Вставить("mark-price-candle3Dutc", URLПубличный);
    Соотв.Вставить("mark-price-candle5Dutc", URLПубличный);
    Соотв.Вставить("mark-price-candle12Hutc", URLПубличный);
    Соотв.Вставить("mark-price-candle6Hutc", URLПубличный);
    
    // Публичные каналы свечей index
    Соотв.Вставить("index-candle3M", URLПубличный);
    Соотв.Вставить("index-candle1M", URLПубличный);
    Соотв.Вставить("index-candle1W", URLПубличный);
    Соотв.Вставить("index-candle1D", URLПубличный);
    Соотв.Вставить("index-candle2D", URLПубличный);
    Соотв.Вставить("index-candle3D", URLПубличный);
    Соотв.Вставить("index-candle5D", URLПубличный);
    Соотв.Вставить("index-candle12H", URLПубличный);
    Соотв.Вставить("index-candle6H", URLПубличный);
    Соотв.Вставить("index-candle4H", URLПубличный);
    Соотв.Вставить("index-candle2H", URLПубличный);
    Соотв.Вставить("index-candle1H", URLПубличный);
    Соотв.Вставить("index-candle30m", URLПубличный);
    Соотв.Вставить("index-candle15m", URLПубличный);
    Соотв.Вставить("index-candle5m", URLПубличный);
    Соотв.Вставить("index-candle3m", URLПубличный);
    Соотв.Вставить("index-candle1m", URLПубличный);
    Соотв.Вставить("index-candle3Mutc", URLПубличный);
    Соотв.Вставить("index-candle1Mutc", URLПубличный);
    Соотв.Вставить("index-candle1Wutc", URLПубличный);
    Соотв.Вставить("index-candle1Dutc", URLПубличный);
    Соотв.Вставить("index-candle2Dutc", URLПубличный);
    Соотв.Вставить("index-candle3Dutc", URLПубличный);
    Соотв.Вставить("index-candle5Dutc", URLПубличный);
    Соотв.Вставить("index-candle12Hutc", URLПубличный);
    Соотв.Вставить("index-candle6Hutc", URLПубличный);
    
    // Другие публичные каналы
    Соотв.Вставить("liquidation-orders", URLПубличный);
    Соотв.Вставить("adl-warning", URLПубличный);
    Соотв.Вставить("economic-calendar", URLПубличный);
    
    // Приватные каналы	
	Соотв.Вставить("orders", URLПриватный);
	Соотв.Вставить("fills", URLПриватный);
	Соотв.Вставить("account", URLПриватный);
    Соотв.Вставить("positions", URLПриватный);
    Соотв.Вставить("balance_and_position", URLПриватный);
    Соотв.Вставить("liquidation-warning", URLПриватный);
    Соотв.Вставить("account-greeks", URLПриватный);
    
    Возврат Соотв;
		
КонецФункции


Функция Мап_МаркетЦены(СтруктураОбщегоФормата) Экспорт

	Структура 		= СП_Подписка_МаркетЦены();
	Структура.op 	= XMLСтрока(СтруктураОбщегоФормата.Операция);
	Структура.args	= СП_Аргументы_МаркетПрайс(СтруктураОбщегоФормата.Аргументы);
	
	Возврат Структура;
	
КонецФункции

Функция Мап_ИзмененияОрдеров(СтруктураОбщегоФормата) Экспорт

	Структура 		= СП_Подписка_ИзмененияОрдеров();
	Структура.op 	= XMLСтрока(СтруктураОбщегоФормата.Операция);
	Структура.args	= СП_Аргументы_ИзмененияОрдеров(СтруктураОбщегоФормата.Аргументы);
	
	Возврат Структура;
	
КонецФункции

#КонецОбласти //МаппингПараметров


#Область ОписаниеПараметров

Функция СП_Логин() Экспорт
	
	Структура = Новый Структура();
	Структура.Вставить("op", "login");
	
	Аргументы = Новый Структура(); 
	Аргументы.Вставить("apiKey", "");
	Аргументы.Вставить("passphrase", "");
	Аргументы.Вставить("timestamp", "");
	Аргументы.Вставить("sign", "");
	Массив = Новый Массив;
	Массив.Добавить(Аргументы);
	
	Структура.Вставить("args", Массив);
	
	Возврат Структура;
	
КонецФункции

Функция СП_Подписка_МаркетЦены()
	
	Структура = Новый Структура();
	Структура.Вставить("id", 			""); // Unique identifier of the message. Provided by client.
	Структура.Вставить("op", 			""); // Operation
	Структура.Вставить("args", 			""); // List of subscribed channels
	
	Возврат Структура;
	
КонецФункции

Функция СП_Аргументы_МаркетПрайс(МассивАргументов)
	
	Массив = Новый Массив();
	
	Для каждого Элемент Из МассивАргументов Цикл
		Структура = Новый Структура();
		ДобавитьКанал(Структура, "mark-price");
		ДобавитьИнструментИД(Структура, Элемент.ИнструментИД);
		
		Массив.Добавить(Структура);
	КонецЦикла;
	
	Возврат Массив;
	
КонецФункции

Функция СП_Подписка_ИзмененияОрдеров() Экспорт
	
	Структура = Новый Структура();
	Структура.Вставить("id", 			""); // Unique identifier of the message. Provided by client.
	Структура.Вставить("op", 			""); // Operation
	Структура.Вставить("args", 			""); // List of subscribed channels
	
	Возврат Структура;
	
КонецФункции

Функция СП_Аргументы_ИзмененияОрдеров(МассивАргументов) Экспорт
	
	Массив = Новый Массив();
	
	Для каждого Элемент Из МассивАргументов Цикл
		Структура = Новый Структура();
		ДобавитьКанал(Структура, "orders");
		ДобавитьИнструментИД(Структура, 		Элемент.ИнструментИД);
		ДобавитьИнструментТип(Структура, 		Элемент.ИнструментТип);
		ДобавитьИнструментСемейство(Структура, 	Элемент.ИнструментСемейство);
		
		Массив.Добавить(Структура);
	КонецЦикла;
	
	Возврат Массив;
	
КонецФункции

Функция СП_Подписка_БалансыИПозиции() Экспорт

	Параметры = Новый Структура();
	Параметры.Вставить("op", "subscribe");
	
	МассивАргументов = Новый Массив;
	Аргумент = Новый Структура("channel", "balance_and_position");
	МассивАргументов.Добавить(Аргумент);
	
	Параметры.Вставить("args", МассивАргументов);
	
	Возврат Параметры;	
КонецФункции

Функция СП_Подписка_Позиции() Экспорт

	Параметры = Новый Структура();
	Параметры.Вставить("op", 	"subscribe");
	Параметры.Вставить("args", 	"");
	
	Возврат Параметры;	
КонецФункции

Функция СП_Подписка_Позиции_Аргумент() Экспорт
	
	Структура = Новый Структура();
	Структура.Вставить("channel", "positions");
	Структура.Вставить("instType", "");
	
	Возврат Структура;
	
КонецФункции


Процедура ДобавитьКанал(Структура, ИмяКанала)	
	Структура.Вставить("channel", ИмяКанала); // Channel name		
КонецПроцедуры

Процедура ДобавитьИнструментИД(Структура, ИнструментИД)	
	Структура.Вставить("instId", ИнструментИД); // Instrument ID filter		
КонецПроцедуры

Процедура ДобавитьИнструментТип(Структура, ИнструментТип)	
	Структура.Вставить("instType", ИнструментТип); // Instrument ID filter		
КонецПроцедуры

Процедура ДобавитьИнструментСемейство(Структура, ИнструментСемейство)	
	Структура.Вставить("instFamily", ИнструментСемейство); // Instrument ID filter		
КонецПроцедуры

#КонецОбласти //ОписаниеПараметров

#Область СборПараметров

Функция ПараметрыКлиента(Клиент)
	
	СтруктураКлиент = Новый Структура;
	СтруктураКлиент.Вставить("URLСервера", Клиент.URLСервера);
	СтруктураКлиент.Вставить("ИмяПользователяИнформационнойБазы", Клиент.ИмяПользователяИнформационнойБазы);
	СтруктураКлиент.Вставить("Заголовки", Клиент.ПараметрыСоединения.Заголовки);
	СтруктураКлиент.Вставить("МетаданныеИмя", Клиент.Метаданные.Имя);
	//СтруктураКлиент.Вставить("МетаданныеЗаголовки", Клиент.Метаданные.Заголовки);
	СтруктураКлиент.Вставить("МетаданныеURLСервера", Клиент.Метаданные.URLСервера);
	КлиентJSON = биг_ВебСокет_КлиентСервер.ЗаписатьДанныеВJSON(,СтруктураКлиент).Результат;
	
	Параметры = Новый Структура;
	Параметры.Вставить("Клиент",КлиентJSON);
	
	Возврат Параметры;
КонецФункции

Функция ПараметрыСоединения(Соединение) Экспорт
	
	СтруктураСоединение = Новый Структура;
	СтруктураСоединение.Вставить("URLСервера", Соединение.URLСервера);
	СтруктураСоединение.Вставить("ИмяПользователяИнформационнойБазы", Соединение.ИмяПользователяИнформационнойБазы);  
	СтруктураСоединение.Вставить("Модуль", Соединение.Обработчики.Модуль); 
	СтруктураСоединение.Вставить("ОбработчикЗакрытияСоединения", Соединение.Обработчики.ОбработчикЗакрытияСоединения); 
	СтруктураСоединение.Вставить("ОбработчикОткрытияСоединения", Соединение.Обработчики.ОбработчикОткрытияСоединения); 
	СтруктураСоединение.Вставить("ОбработчикОшибки", Соединение.Обработчики.ОбработчикОшибки); 
	СтруктураСоединение.Вставить("ОбработчикПолученияСообщения", Соединение.Обработчики.ОбработчикПолученияСообщения); 
	СтруктураСоединение.Вставить("Заголовки", Соединение.Параметры.Заголовки);

	СоединениеJSON = биг_ВебСокет_КлиентСервер.ЗаписатьДанныеВJSON(,СтруктураСоединение).Результат;
	
	Параметры = Новый Структура;
	Параметры.Вставить("Соединение",СоединениеJSON);
	Возврат Параметры;
КонецФункции

#КонецОбласти
	


