 


#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область ОбработчикиПроведения

Процедура ОтразитьДвиженияВОчередьОпераций(Отказ, РежимПроведения)
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.биг_ОперацииПортфеля");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("Портфель", 	Портфель);
	ЭлементБлокировки.УстановитьЗначение("Сделка", 		Сделка);
	ЭлементБлокировки.УстановитьЗначение("Операция", 	Ссылка);
	Блокировка.Заблокировать(); 
		
	ОчередьОпераций = РегистрыСведений.биг_ОперацииПортфеля.СоздатьНаборЗаписей();
	ОчередьОпераций.Отбор.Портфель.Установить(Портфель);
	ОчередьОпераций.Отбор.Сделка.Установить(Сделка);
	ОчередьОпераций.Отбор.Операция.Установить(Ссылка);
	ОчередьОпераций.Прочитать();
	
	// ставим в очередь только если нет записей
	Если ОчередьОпераций.Количество() = 0 Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	биг_УчастникиПортфелейСрезПоследних.Аккаунт КАК Аккаунт
		|ИЗ
		|	РегистрСведений.биг_УчастникиПортфелей.СрезПоследних(
		|			&ДатаДокумента,
		|			Портфель = &Портфель
		|				И Участник = ИСТИНА) КАК биг_УчастникиПортфелейСрезПоследних";
		
		Запрос.УстановитьПараметр("Портфель", 		Портфель);
		Запрос.УстановитьПараметр("ДатаДокумента", 	Дата);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			
			НС = ОчередьОпераций.Добавить();
			НС.Портфель = Портфель;
			НС.Сделка	= Сделка;
			НС.Операция	= Ссылка;
			НС.Аккаунт	= Выборка.Аккаунт;
			НС.Статус	= Перечисления.big_СтатусыТорговыхОбъектов.Новый;		
		КонецЦикла;
		
		ОчередьОпераций.Записать(Истина);
	КонецЕсли;		
	
КонецПроцедуры

Процедура ОчиститьЗаписиОперацийПортфеля(Отказ)
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.биг_ОперацииПортфеля");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("Портфель", 	Портфель);
	ЭлементБлокировки.УстановитьЗначение("Сделка", 		Сделка);
	ЭлементБлокировки.УстановитьЗначение("Операция", 	Ссылка);
	Блокировка.Заблокировать(); 
	
	ОчередьОпераций = РегистрыСведений.биг_ОперацииПортфеля.СоздатьНаборЗаписей();
	ОчередьОпераций.Отбор.Портфель.Установить(Портфель);
	ОчередьОпераций.Отбор.Сделка.Установить(Сделка);
	ОчередьОпераций.Отбор.Операция.Установить(Ссылка);
	ОчередьОпераций.Прочитать();
	ОчередьОпераций.Очистить();
	ОчередьОпераций.Записать(Истина);
	         	
КонецПроцедуры

Процедура ПровестиАлгоОрдера(Отказ)
	
	Для каждого Строка Из СтопТейк Цикл
		Если ЗначениеЗаполнено(Строка.ТейкСтоп) Тогда
			АлгоОбъект = Строка.ТейкСтоп.ПолучитьОбъект();
			АлгоОбъект.ДополнительныеСвойства.Вставить("ПодчиненныйОрдер", Истина);
			АлгоОбъект.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;			
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		РаспроведениеРазрешено = ПроверитьСтатусыПоАккаунтам();
		Если НЕ РаспроведениеРазрешено Тогда
			Отказ = Истина;
		Иначе
			ОчиститьЗаписиОперацийПортфеля(Отказ);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ОтразитьДвиженияВОчередьОпераций(Отказ, РежимПроведения);
	ПровестиАлгоОрдера(Отказ);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПроверитьСтатусыПоАккаунтам()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	биг_ОперацииПортфеля.Портфель КАК Портфель,
	|	биг_ОперацииПортфеля.Сделка КАК Сделка,
	|	биг_ОперацииПортфеля.Операция КАК Операция,
	|	биг_ОперацииПортфеля.Аккаунт КАК Аккаунт,
	|	биг_ОперацииПортфеля.ИнтеграционныйДокумент КАК ИнтеграционныйДокумент
	|ИЗ
	|	РегистрСведений.биг_ОперацииПортфеля КАК биг_ОперацииПортфеля
	|ГДЕ
	|	биг_ОперацииПортфеля.ИнтеграционныйДокумент <> НЕОПРЕДЕЛЕНО
	|	И биг_ОперацииПортфеля.Портфель = &Портфель
	|	И биг_ОперацииПортфеля.Сделка = &Сделка
	|	И биг_ОперацииПортфеля.Операция = &Операция";
	
	Запрос.УстановитьПараметр("Портфель", 	Портфель);
	Запрос.УстановитьПараметр("Сделка", 	Сделка);
	Запрос.УстановитьПараметр("Операция", 	Ссылка);
		
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		РаспроведениеРазрешено = Истина;
	Иначе
		РаспроведениеРазрешено = Ложь;       
		Сообщить("По документу " + Ссылка + " сформированы интеграционные документы. Отмена проведения не возможна");
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Сообщить("Интеграционный документ: " + Выборка.Аккаунт);
		КонецЦикла;
	КонецЕсли;
	
	Возврат РаспроведениеРазрешено;
КонецФункции

#КонецОбласти












