#Область ПрограммныйИнтерфейс

// Процедура оповещает о завершении обмена между основной и автономной конфигурациями.
//
Процедура ОповеститьОЗавершении() Экспорт
	
	НовыхЗаписей = _ДемоОбменМобильныйКлиентАвтономныйВызовСервера.ПринятоОтправленоНовыхЗаписей();
	Если НовыхЗаписей.Принято <> 0 ИЛИ НовыхЗаписей.Отправлено <> 0 Тогда
		ОбновитьИнтерфейс();
		ТекстОповещения = НСтр("ru = 'Принято объектов: %1 Отправлено объектов: %2'");
		ПоказатьОповещениеПользователя(НСтр("ru = 'Выполнена синхронизация'"), , 
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОповещения, НовыхЗаписей.Принято, НовыхЗаписей.Отправлено));
	КонецЕсли

КонецПроцедуры

// Функция возвращает идентификатор фонового задания.
//
// Возвращаемое значение:
//  Строка - идентификатор фонового задания
Функция ИдентификаторФоновогоЗадания() Экспорт

	Возврат ПараметрыПриложения.Получить("ИдентификаторФоновогоЗадания");
	
КонецФункции

#КонецОбласти