
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
    Настройки 			= КомпоновщикНастроек.ПолучитьНастройки();
	КомпоновщикМакета 	= Новый КомпоновщикМакетаКомпоновкиДанных;
    МакетКомпоновки 	= КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	
	// установка общей "группы" для всех кусков макета, что бы не разъезжалась ширина
	УстановитьОбщуюГруппуИШиринуКолонок(МакетКомпоновки);
	
	// костыль для параметра Стейблы
	//МассивСтейблов = биг_ОбщегоНазначенияКлиентСервер.ПолучитьМассивЗначенийПоИмени("Стейблкоин");
	//СписокСтейблов = Новый СписокЗначений;
	//Для каждого Монета Из МассивСтейблов Цикл
	//	СписокСтейблов.Добавить(Монета);	
	//КонецЦикла;
	//Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("МассивСтейблов", СписокСтейблов);
	//ПользовательскийПараметр 			= КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ПараметрСтейблы.ИдентификаторПользовательскойНастройки);
	//ПользовательскийПараметр.Значение 	= ПараметрСтейблы.Значение;	
	//ПользовательскийПараметр.Использование = Истина;
	
	// сформируем наборы данных
	ОтборПортфель 		= Настройки.ПараметрыДанных.Элементы.Найти("Портфель");
	ОтборАккаунт		= Настройки.ПараметрыДанных.Элементы.Найти("Аккаунт");
	ПериодОтчета		= Настройки.ПараметрыДанных.Элементы.Найти("ПериодОтчета");
	ДатаНачала			= ПериодОтчета.Значение.ДатаНачала;
	ДатаОкончания		= ПериодОтчета.Значение.ДатаОкончания;
		
	ЗаПериодУправления 	= СформироватьТаблицуОбщегоРезультата(ОтборПортфель, ОтборАккаунт, ДатаОкончания);
	ЗаПериодОтчета		= СформироватьТаблицуРезультатаЗаПериод(ОтборПортфель, ОтборАккаунт, ДатаНачала, ДатаОкончания);
	ВнешниеНаборы		= Новый Структура("ЗаПериодУправления, ЗаПериодОтчета", ЗаПериодУправления, ЗаПериодОтчета); 
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборы, ДанныеРасшифровки);
    ПроцессорВывода 	= Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
    ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
    ПроцессорВывода.Вывести(ПроцессорКомпоновки);

	// шаблон вывод изображений для группировки монет 
	// https://infostart.ru/1c/articles/1125765/
	ВывестиИзображенияТикеровМонет(ДокументРезультат);
	
	ПереместитьДиаграммуВЦелевуюОбласть(ДокументРезультат);
		
КонецПроцедуры  

Процедура УстановитьОбщуюГруппуИШиринуКолонок(МакетКомпоновки)

	Для ИИ=0 По МакетКомпоновки.Макеты.Количество()-1 Цикл
		ТекМакет1 = МакетКомпоновки.Макеты[ИИ];
		
		Если ТипЗнч(ТекМакет1.Макет) = Тип("МакетОбластиКомпоновкиДанных") Тогда
			Для УУ=0 По ТекМакет1.Макет.Количество()-1 Цикл
				ТекМакет2 = ТекМакет1.Макет[УУ];
				ТекМакет2.ИдентификаторТаблицы = "";
				
				// установка фикс. ширины для отдельных колонок (иначе плывут)
				Для ЮЮ = 0 По Мин(ТекМакет2.Ячейки.Количество()-1, 3) Цикл
					ТекМакет2.ИдентификаторТаблицы = "";
					ТекМакет2.Ячейки[ЮЮ].Оформление.УстановитьЗначениеПараметра("МинимальнаяШирина", 9);
					ТекМакет2.Ячейки[ЮЮ].Оформление.УстановитьЗначениеПараметра("МаксимальнаяШирина", 9);
				КонецЦикла;			
			КонецЦикла;			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры  

Процедура ВывестиИзображенияТикеровМонет(ДокументРезультат)

	//// Заполняем рисунки для полей, в данных расшифровки которых находятся элементы справочника 
	//// "НоменклатураПрисоединенныеФайлы"
	//КоличествоКолонокТаблицы = ДокументРезультат.ШиринаТаблицы; // Количество колонок в отчете
	//КоличествоСтрокТаблицы = ДокументРезультат.ВысотаТаблицы; 	// Количество строк в отчете
	//// Обходим все ячейки отчета
	//Для Кл = 1 По КоличествоКолонокТаблицы Цикл 		
	//	Для Ст = 1 По КоличествоСтрокТаблицы Цикл  			
	//		ТекОбласть = ДокументРезультат.Область(Ст, Кл);  
	//		// Если имеется расшифровка ячейки, то проверям наличие полей расшифровки
	//		Если ТекОбласть.Расшифровка <> Неопределено Тогда
	//			ПоляРасшифровки = ДанныеРасшифровки.Элементы[ТекОбласть.Расшифровка].ПолучитьПоля();
	//			Если ПоляРасшифровки.Количество() > 0 Тогда
	//				// Если тип значения поля расшифровки соответствует справочнику прикрепленных файлов, то
	//				// выводим связанную картинку
	//				Рисунок = ПолучитьИзображение(ПоляРасшифровки.Получить(0).Значение);
	//				Если Рисунок <> Неопределено Тогда
	//					Рис = ДокументРезультат.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка);
	//					Рис.РазмерКартинки = РазмерКартинки.Пропорционально;
	//					Рис.Картинка = Рисунок;
	//					Рис.Расположить(ТекОбласть);						
	//				КонецЕсли;
	//			КонецЕсли;
	//		КонецЕсли;  			
	//	КонецЦикла;  		
	//КонецЦикла;
	
КонецПроцедуры

Процедура ПереместитьДиаграммуВЦелевуюОбласть(ДокументРезультат)

	ОбластьЗаголовкаПервойДиаграммы = ДокументРезультат.Область("R10C7:R28C20");	
	ОбластьЗаголовкаВторойДиаграммы = ДокументРезультат.НайтиТекст("Диаграмма",,,, Ложь, Истина);
	
	ДокументРезультат.Рисунки[0].Лево 	= ОбластьЗаголовкаПервойДиаграммы.Лево + 64;
	ДокументРезультат.Рисунки[0].Верх 	= ОбластьЗаголовкаПервойДиаграммы.Верх + 35;
	ДокументРезультат.Рисунки[0].Ширина = 298; //320;
	ДокументРезультат.Рисунки[0].Высота = 88;
	
	ОбластьЗаголовкаВторойДиаграммы.Очистить();
	
КонецПроцедуры

Функция СформироватьТаблицуОбщегоРезультата(ОтборПортфель, ОтборАккаунт, ДатаОкончания)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МИНИМУМ(биг_РезультатыУправления.Период) КАК Период,
	|	биг_РезультатыУправления.Портфель КАК Портфель,
	|	биг_РезультатыУправления.Аккаунт КАК Аккаунт,
	|	биг_РезультатыУправления.ВалютаОценкиПортфеля КАК ВалютаОценкиПортфеля
	|ПОМЕСТИТЬ ВТ_ВесьПериод_НачалоУправления
	|ИЗ
	|	РегистрСведений.биг_РезультатыУправления КАК биг_РезультатыУправления
	|ГДЕ
	|	(биг_РезультатыУправления.Портфель = &Портфель
	|			ИЛИ &БезОтбораПоПортфелю)
	|	И (биг_РезультатыУправления.Аккаунт = &Аккаунт
	|			ИЛИ &БезОтбораПоАккаунту)
	|
	|СГРУППИРОВАТЬ ПО
	|	биг_РезультатыУправления.Портфель,
	|	биг_РезультатыУправления.Аккаунт,
	|	биг_РезультатыУправления.ВалютаОценкиПортфеля
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	биг_РезультатыУправления.Портфель КАК Портфель,
	|	биг_РезультатыУправления.Аккаунт КАК Аккаунт,
	|	биг_РезультатыУправления.ВалютаОценкиПортфеля КАК ВалютаОценкиПортфеля,
	|	СУММА(биг_РезультатыУправления.Сумма) КАК Сумма,
	|	ВЫБОР
	|		КОГДА биг_РезультатыУправления.Монета В (&МассивСтейблов)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоСтейбл,
	|	биг_РезультатыУправления.Период КАК Период
	|ПОМЕСТИТЬ ВТ_ГруппаНачало
	|ИЗ
	|	ВТ_ВесьПериод_НачалоУправления КАК ВТ_ВесьПериод_НачалоУправления
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.биг_РезультатыУправления КАК биг_РезультатыУправления
	|		ПО (биг_РезультатыУправления.Портфель = биг_РезультатыУправления.Портфель)
	|			И (биг_РезультатыУправления.Аккаунт = биг_РезультатыУправления.Аккаунт)
	|			И (биг_РезультатыУправления.Период = ВТ_ВесьПериод_НачалоУправления.Период)
	|ГДЕ
	|	(биг_РезультатыУправления.Портфель = &Портфель
	|			ИЛИ &БезОтбораПоПортфелю)
	|	И (биг_РезультатыУправления.Аккаунт = &Аккаунт
	|			ИЛИ &БезОтбораПоАккаунту)
	|
	|СГРУППИРОВАТЬ ПО
	|	биг_РезультатыУправления.Портфель,
	|	биг_РезультатыУправления.Аккаунт,
	|	ВЫБОР
	|		КОГДА биг_РезультатыУправления.Монета В (&МассивСтейблов)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	биг_РезультатыУправления.ВалютаОценкиПортфеля,
	|	биг_РезультатыУправления.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	биг_РезультатыУправленияСрезПоследних.Портфель КАК Портфель,
	|	биг_РезультатыУправленияСрезПоследних.Аккаунт КАК Аккаунт,
	|	СУММА(биг_РезультатыУправленияСрезПоследних.Сумма) КАК Сумма,
	|	биг_РезультатыУправленияСрезПоследних.ВалютаОценкиПортфеля КАК ВалютаОценкиПортфеля,
	|	МАКСИМУМ(биг_РезультатыУправленияСрезПоследних.Период) КАК Период
	|ПОМЕСТИТЬ ВТ_ГруппаЗавершение
	|ИЗ
	|	РегистрСведений.биг_РезультатыУправления.СрезПоследних(
	|			&КонецВчерашнегоДня,
	|			(Портфель = &Портфель
	|				ИЛИ &БезОтбораПоПортфелю)
	|				И (Аккаунт = &Аккаунт
	|					ИЛИ &БезОтбораПоАккаунту)) КАК биг_РезультатыУправленияСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	биг_РезультатыУправленияСрезПоследних.Портфель,
	|	биг_РезультатыУправленияСрезПоследних.Аккаунт,
	|	биг_РезультатыУправленияСрезПоследних.ВалютаОценкиПортфеля
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	биг_СебестоимостьАктивовОстатки.Аккаунт КАК Аккаунт,
	|	биг_СебестоимостьАктивовОстатки.Монета КАК Монета,
	|	биг_СебестоимостьАктивовОстатки.Портфель КАК Портфель,
	|	биг_СебестоимостьАктивовОстатки.Партия КАК Партия,
	|	биг_СебестоимостьАктивовОстатки.КоличествоОстаток КАК ПокупкаКоличество,
	|	биг_СебестоимостьАктивовОстатки.СуммаОстаток КАК ПокупкаСумма,
	|	биг_СебестоимостьАктивовОстатки.СуммаОстаток / биг_СебестоимостьАктивовОстатки.КоличествоОстаток КАК ПокупкаЦена,
	|	биг_СебестоимостьАктивовОстатки.КоличествоОстаток * биг_РезультатыУправленияСрезПоследних.Цена КАК ТекСумма,
	|	биг_РезультатыУправленияСрезПоследних.Цена КАК ТекЦена,
	|	биг_СебестоимостьАктивовОстатки.КоличествоОстаток * биг_РезультатыУправленияСрезПоследних.Цена - биг_СебестоимостьАктивовОстатки.СуммаОстаток КАК PnL,
	|	ЕСТЬNULL((биг_СебестоимостьАктивовОстатки.КоличествоОстаток * биг_РезультатыУправленияСрезПоследних.Цена - биг_СебестоимостьАктивовОстатки.СуммаОстаток) / биг_СебестоимостьАктивовОстатки.СуммаОстаток * 100, 0) КАК PnLRate
	|ПОМЕСТИТЬ ВТ_Вложено
	|ИЗ
	|	РегистрНакопления.биг_СебестоимостьАктивов.Остатки(
	|			&КонецВчерашнегоДня,
	|			(Аккаунт = &Аккаунт
	|				ИЛИ &Аккаунт = ЗНАЧЕНИЕ(Справочник.big_MarketAccounts.ПустаяСсылка))
	|				И (Портфель = &Портфель
	|					ИЛИ &Портфель = ЗНАЧЕНИЕ(Справочник.биг_Портфели.ПустаяСсылка))) КАК биг_СебестоимостьАктивовОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.биг_РезультатыУправления.СрезПоследних КАК биг_РезультатыУправленияСрезПоследних
	|		ПО биг_СебестоимостьАктивовОстатки.Аккаунт = биг_РезультатыУправленияСрезПоследних.Аккаунт
	|			И биг_СебестоимостьАктивовОстатки.Монета = биг_РезультатыУправленияСрезПоследних.Монета
	|			И биг_СебестоимостьАктивовОстатки.Портфель = биг_РезультатыУправленияСрезПоследних.Портфель
	|ГДЕ
	|	биг_СебестоимостьАктивовОстатки.КоличествоОстаток > 0
	|	И биг_СебестоимостьАктивовОстатки.СуммаОстаток > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Вложено.Аккаунт КАК Аккаунт,
	|	ВТ_Вложено.Портфель КАК Портфель,
	|	СУММА(ВТ_Вложено.ПокупкаСумма) КАК ПокупкаСумма,
	|	СУММА(ВТ_Вложено.ТекСумма) КАК ТекСумма,
	|	СУММА(ВТ_Вложено.PnL) КАК upl
	|ПОМЕСТИТЬ ВТ_ВложеноИтог_УПЛ
	|ИЗ
	|	ВТ_Вложено КАК ВТ_Вложено
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Вложено.Аккаунт,
	|	ВТ_Вложено.Портфель
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	биг_УчастникиПортфелейСрезПоследних.Аккаунт,
	|	биг_УчастникиПортфелейСрезПоследних.Портфель,
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.isoUpl)
	|ИЗ
	|	РегистрСведений.биг_УчастникиПортфелей.СрезПоследних(
	|			&КонецВчерашнегоДня,
	|			(Портфель = &Портфель
	|				ИЛИ &БезОтбораПоПортфелю)
	|				И (Аккаунт = &Аккаунт
	|					ИЛИ &БезОтбораПоАккаунту)) КАК биг_УчастникиПортфелейСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.биг_ОКХ_БаллансАккаунтовДетали.СрезПоследних(&КонецВчерашнегоДня, ) КАК биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних
	|		ПО биг_УчастникиПортфелейСрезПоследних.Аккаунт = биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.Account
	|ГДЕ
	|	биг_УчастникиПортфелейСрезПоследних.Участник
	|
	|СГРУППИРОВАТЬ ПО
	|	биг_УчастникиПортфелейСрезПоследних.Аккаунт,
	|	биг_УчастникиПортфелейСрезПоследних.Портфель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВложеноИтог_УПЛ.Аккаунт КАК Аккаунт,
	|	ВТ_ВложеноИтог_УПЛ.Портфель КАК Портфель,
	|	СУММА(ВТ_ВложеноИтог_УПЛ.ПокупкаСумма) КАК ПокупкаСумма,
	|	СУММА(ВТ_ВложеноИтог_УПЛ.ТекСумма) КАК ТекСумма,
	|	СУММА(ВТ_ВложеноИтог_УПЛ.upl) КАК upl,
	|	СУММА(ВТ_ВложеноИтог_УПЛ.upl) / СУММА(ВТ_ВложеноИтог_УПЛ.ПокупкаСумма) * 100 КАК uplRate
	|ПОМЕСТИТЬ ВТ_ВложеноИтог_УплГруппа
	|ИЗ
	|	ВТ_ВложеноИтог_УПЛ КАК ВТ_ВложеноИтог_УПЛ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ВложеноИтог_УПЛ.Аккаунт,
	|	ВТ_ВложеноИтог_УПЛ.Портфель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	биг_ПрибылиИУбыткиОбороты.Портфель КАК Портфель,
	|	биг_ПрибылиИУбыткиОбороты.Аккаунт КАК Аккаунт,
	|	биг_ПрибылиИУбыткиОбороты.Валюта КАК Монета,
	|	биг_ПрибылиИУбыткиОбороты.Регистратор.instId КАК Инструмент,
	|	ВЫБОР
	|		КОГДА биг_ПрибылиИУбыткиОбороты.Регистратор.instType = ЗНАЧЕНИЕ(Перечисление.big_OKX_InstrumentType.SPOT)
	|			ТОГДА биг_ПрибылиИУбыткиОбороты.Регистратор.side
	|		ИНАЧЕ биг_ПрибылиИУбыткиОбороты.Регистратор.posSide
	|	КОНЕЦ КАК ВидОперации,
	|	биг_ПрибылиИУбыткиОбороты.ПрибыльОборот + биг_ПрибылиИУбыткиОбороты.УбытокОборот КАК Операция_PnL,
	|	ЕСТЬNULL(биг_ПрибылиИУбыткиОбороты.Регистратор.pnlRatio * 100, 0) КАК Операция_PnLRate,
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(биг_ПрибылиИУбыткиОбороты.Регистратор КАК Документ.big_Order_OKX)) = ЗНАЧЕНИЕ(Документ.big_Order_OKX.ПустаяСсылка)
	|			ТОГДА ""Позиция ID: "" + (ВЫРАЗИТЬ(биг_ПрибылиИУбыткиОбороты.Регистратор.posId КАК СТРОКА(100)))
	|		ИНАЧЕ ""Ордер ID: "" + (ВЫРАЗИТЬ(биг_ПрибылиИУбыткиОбороты.Регистратор.ordId КАК СТРОКА(100)))
	|	КОНЕЦ КАК Операци
	|ПОМЕСТИТЬ ВТ_Результаты
	|ИЗ
	|	РегистрНакопления.биг_ПрибылиИУбытки.Обороты(
	|			,
	|			&КонецВчерашнегоДня,
	|			Регистратор,
	|			(Аккаунт = &Аккаунт
	|				ИЛИ &Аккаунт = ЗНАЧЕНИЕ(Справочник.big_MarketAccounts.ПустаяСсылка))
	|				И (Портфель = &Портфель
	|					ИЛИ &Портфель = ЗНАЧЕНИЕ(Справочник.биг_Портфели.ПустаяСсылка))) КАК биг_ПрибылиИУбыткиОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Результаты.Портфель КАК Портфель,
	|	ВТ_Результаты.Аккаунт КАК Аккаунт,
	|	СУММА(ВТ_Результаты.Операция_PnL) КАК Операция_PnL
	|ПОМЕСТИТЬ ВТ_РезультатыИтог
	|ИЗ
	|	ВТ_Результаты КАК ВТ_Результаты
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Результаты.Портфель,
	|	ВТ_Результаты.Аккаунт
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ГруппаНачало.Портфель КАК Портфель,
	|	ВТ_ГруппаНачало.Аккаунт КАК Аккаунт,
	|	ВТ_ГруппаНачало.ВалютаОценкиПортфеля КАК ВалютаОценкиПортфеля,
	|	ВТ_ГруппаНачало.Период КАК ВесьП_НачПериод,
	|	ВТ_ГруппаЗавершение.Период КАК ВесьП_КонПериод,
	|	ЕСТЬNULL(ВТ_ГруппаНачало.Сумма, 0) КАК ВесьП_Нач_Сумма,
	|	ВТ_РезультатыИтог.Операция_PnL КАК ВесьП_Total_PnL,
	|	ВТ_РезультатыИтог.Операция_PnL / ЕСТЬNULL(ВТ_ГруппаНачало.Сумма, 0) * 100 КАК ВесьП_Total_PnLRate,
	|	ВТ_ВложеноИтог_УплГруппа.ПокупкаСумма КАК ВесьП_ВложеноСумма,
	|	ВТ_ВложеноИтог_УплГруппа.upl КАК ВесьП_Total_UPL,
	|	ВТ_ВложеноИтог_УплГруппа.uplRate КАК ВесьП_Total_uplRate,
	|	ЕСТЬNULL(ВТ_ГруппаЗавершение.Сумма, 0) КАК ВесьП_Кон_Сумма
	|ИЗ
	|	ВТ_ГруппаНачало КАК ВТ_ГруппаНачало
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ГруппаЗавершение КАК ВТ_ГруппаЗавершение
	|		ПО ВТ_ГруппаНачало.Портфель = ВТ_ГруппаЗавершение.Портфель
	|			И ВТ_ГруппаНачало.Аккаунт = ВТ_ГруппаЗавершение.Аккаунт
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВложеноИтог_УплГруппа КАК ВТ_ВложеноИтог_УплГруппа
	|		ПО ВТ_ГруппаНачало.Портфель = ВТ_ВложеноИтог_УплГруппа.Портфель
	|			И ВТ_ГруппаНачало.Аккаунт = ВТ_ВложеноИтог_УплГруппа.Аккаунт
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РезультатыИтог КАК ВТ_РезультатыИтог
	|		ПО ВТ_ГруппаНачало.Портфель = ВТ_РезультатыИтог.Портфель
	|			И ВТ_ГруппаНачало.Аккаунт = ВТ_РезультатыИтог.Аккаунт";
	
	Запрос.УстановитьПараметр("Портфель", 				ОтборПортфель.Значение);
	Запрос.УстановитьПараметр("Аккаунт", 				ОтборАккаунт.Значение);
	Запрос.УстановитьПараметр("БезОтбораПоПортфелю", 	НЕ ОтборПортфель.Использование);
	Запрос.УстановитьПараметр("БезОтбораПоАккаунту", 	НЕ ОтборАккаунт.Использование);
	Запрос.УстановитьПараметр("МассивСтейблов", 		биг_ОбщегоНазначенияКлиентСервер.ПолучитьМассивЗначенийПоИмени("Стейблкоин"));
	Запрос.УстановитьПараметр("КонецВчерашнегоДня",		Макс(НачалоДня(ТекущаяДатаСеанса()) - 1, ДатаОкончания));
	
	Таблица = Запрос.Выполнить().Выгрузить();
	
	Возврат Таблица;
		
КонецФункции

Функция СформироватьТаблицуРезультатаЗаПериод(ОтборПортфель, ОтборАккаунт, ДатаНачала, ДатаОкончания)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МИНИМУМ(биг_РезультатыУправления.Период) КАК Период,
	|	биг_РезультатыУправления.Портфель КАК Портфель,
	|	биг_РезультатыУправления.Аккаунт КАК Аккаунт,
	|	биг_РезультатыУправления.ВалютаОценкиПортфеля КАК ВалютаОценкиПортфеля
	|ПОМЕСТИТЬ ВТ_ВесьПериод_НачалоУправления
	|ИЗ
	|	РегистрСведений.биг_РезультатыУправления КАК биг_РезультатыУправления
	|ГДЕ
	|	(биг_РезультатыУправления.Портфель = &Портфель
	|			ИЛИ &БезОтбораПоПортфелю)
	|	И (биг_РезультатыУправления.Аккаунт = &Аккаунт
	|			ИЛИ &БезОтбораПоАккаунту)
	|
	|СГРУППИРОВАТЬ ПО
	|	биг_РезультатыУправления.Портфель,
	|	биг_РезультатыУправления.Аккаунт,
	|	биг_РезультатыУправления.ВалютаОценкиПортфеля
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	биг_РезультатыУправления.Портфель КАК Портфель,
	|	биг_РезультатыУправления.Аккаунт КАК Аккаунт,
	|	биг_РезультатыУправления.ВалютаОценкиПортфеля КАК ВалютаОценкиПортфеля,
	|	СУММА(биг_РезультатыУправления.Сумма) КАК Сумма,
	|	ВЫБОР
	|		КОГДА биг_РезультатыУправления.Монета В (&МассивСтейблов)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоСтейбл,
	|	биг_РезультатыУправления.Период КАК Период
	|ПОМЕСТИТЬ ВТ_ГруппаНачало
	|ИЗ
	|	ВТ_ВесьПериод_НачалоУправления КАК ВТ_ВесьПериод_НачалоУправления
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.биг_РезультатыУправления КАК биг_РезультатыУправления
	|		ПО (биг_РезультатыУправления.Портфель = биг_РезультатыУправления.Портфель)
	|			И (биг_РезультатыУправления.Аккаунт = биг_РезультатыУправления.Аккаунт)
	|			И (биг_РезультатыУправления.Период = ВТ_ВесьПериод_НачалоУправления.Период)
	|ГДЕ
	|	(биг_РезультатыУправления.Портфель = &Портфель
	|			ИЛИ &БезОтбораПоПортфелю)
	|	И (биг_РезультатыУправления.Аккаунт = &Аккаунт
	|			ИЛИ &БезОтбораПоАккаунту)
	|
	|СГРУППИРОВАТЬ ПО
	|	биг_РезультатыУправления.Портфель,
	|	биг_РезультатыУправления.Аккаунт,
	|	ВЫБОР
	|		КОГДА биг_РезультатыУправления.Монета В (&МассивСтейблов)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	биг_РезультатыУправления.ВалютаОценкиПортфеля,
	|	биг_РезультатыУправления.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	биг_РезультатыУправленияСрезПоследних.Портфель КАК Портфель,
	|	биг_РезультатыУправленияСрезПоследних.Аккаунт КАК Аккаунт,
	|	биг_РезультатыУправленияСрезПоследних.ВалютаОценкиПортфеля КАК ВалютаОценкиПортфеля,
	|	СУММА(биг_РезультатыУправленияСрезПоследних.Сумма) КАК Сумма,
	|	биг_РезультатыУправленияСрезПоследних.Период КАК Период
	|ПОМЕСТИТЬ ВТ_ГруппаНачалоСрезПоследних
	|ИЗ
	|	РегистрСведений.биг_РезультатыУправления.СрезПоследних(
	|			&ДатаНачала,
	|			(Аккаунт = &Аккаунт
	|				ИЛИ &Аккаунт = ЗНАЧЕНИЕ(Справочник.big_MarketAccounts.ПустаяСсылка))
	|				И (Портфель = &Портфель
	|					ИЛИ &Портфель = ЗНАЧЕНИЕ(Справочник.биг_Портфели.ПустаяСсылка))) КАК биг_РезультатыУправленияСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	биг_РезультатыУправленияСрезПоследних.Портфель,
	|	биг_РезультатыУправленияСрезПоследних.Аккаунт,
	|	биг_РезультатыУправленияСрезПоследних.ВалютаОценкиПортфеля,
	|	биг_РезультатыУправленияСрезПоследних.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ГруппаНачало.Период КАК Период
	|ПОМЕСТИТЬ ВТ_ДатыНачала
	|ИЗ
	|	ВТ_ГруппаНачало КАК ВТ_ГруппаНачало
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ГруппаНачалоСрезПоследних.Период
	|ИЗ
	|	ВТ_ГруппаНачалоСрезПоследних КАК ВТ_ГруппаНачалоСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВТ_ДатыНачала.Период) КАК Период
	|ПОМЕСТИТЬ ВТ_МаксДатаНачала
	|ИЗ
	|	ВТ_ДатыНачала КАК ВТ_ДатыНачала
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ГруппаНачало.Портфель КАК Портфель,
	|	ВТ_ГруппаНачало.Аккаунт КАК Аккаунт,
	|	ВТ_ГруппаНачало.ВалютаОценкиПортфеля КАК ВалютаОценкиПортфеля,
	|	ВТ_ГруппаНачало.Сумма КАК Сумма,
	|	ВТ_ГруппаНачало.ЭтоСтейбл КАК ЭтоСтейбл,
	|	ВТ_ГруппаНачало.Период КАК Период
	|ПОМЕСТИТЬ ВТ_ИтоговоеНачало
	|ИЗ
	|	ВТ_МаксДатаНачала КАК ВТ_МаксДатаНачала
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ГруппаНачало КАК ВТ_ГруппаНачало
	|		ПО (ВТ_ГруппаНачало.Период = ВТ_МаксДатаНачала.Период)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВТ_ГруппаНачалоСрезПоследних.Портфель,
	|	ВТ_ГруппаНачалоСрезПоследних.Аккаунт,
	|	ВТ_ГруппаНачалоСрезПоследних.ВалютаОценкиПортфеля,
	|	ВТ_ГруппаНачалоСрезПоследних.Сумма,
	|	NULL,
	|	ВТ_ГруппаНачалоСрезПоследних.Период
	|ИЗ
	|	ВТ_МаксДатаНачала КАК ВТ_МаксДатаНачала
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ГруппаНачалоСрезПоследних КАК ВТ_ГруппаНачалоСрезПоследних
	|		ПО (ВТ_ГруппаНачалоСрезПоследних.Период = ВТ_МаксДатаНачала.Период)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	биг_РезультатыУправленияСрезПоследних.Портфель КАК Портфель,
	|	биг_РезультатыУправленияСрезПоследних.Аккаунт КАК Аккаунт,
	|	СУММА(биг_РезультатыУправленияСрезПоследних.Сумма) КАК Сумма,
	|	биг_РезультатыУправленияСрезПоследних.ВалютаОценкиПортфеля КАК ВалютаОценкиПортфеля,
	|	МАКСИМУМ(биг_РезультатыУправленияСрезПоследних.Период) КАК Период
	|ПОМЕСТИТЬ ВТ_ГруппаЗавершение
	|ИЗ
	|	РегистрСведений.биг_РезультатыУправления.СрезПоследних(
	|			&ДатаОкончания,
	|			(Портфель = &Портфель
	|				ИЛИ &БезОтбораПоПортфелю)
	|				И (Аккаунт = &Аккаунт
	|					ИЛИ &БезОтбораПоАккаунту)) КАК биг_РезультатыУправленияСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	биг_РезультатыУправленияСрезПоследних.Портфель,
	|	биг_РезультатыУправленияСрезПоследних.Аккаунт,
	|	биг_РезультатыУправленияСрезПоследних.ВалютаОценкиПортфеля
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	биг_СебестоимостьАктивовОстатки.Аккаунт КАК Аккаунт,
	|	биг_СебестоимостьАктивовОстатки.Монета КАК Монета,
	|	биг_СебестоимостьАктивовОстатки.Портфель КАК Портфель,
	|	биг_СебестоимостьАктивовОстатки.Партия КАК Партия,
	|	биг_СебестоимостьАктивовОстатки.КоличествоОстаток КАК ПокупкаКоличество,
	|	биг_СебестоимостьАктивовОстатки.СуммаОстаток КАК ПокупкаСумма,
	|	биг_СебестоимостьАктивовОстатки.СуммаОстаток / биг_СебестоимостьАктивовОстатки.КоличествоОстаток КАК ПокупкаЦена,
	|	биг_СебестоимостьАктивовОстатки.КоличествоОстаток * биг_РезультатыУправленияСрезПоследних.Цена КАК ТекСумма,
	|	биг_РезультатыУправленияСрезПоследних.Цена КАК ТекЦена,
	|	биг_СебестоимостьАктивовОстатки.КоличествоОстаток * биг_РезультатыУправленияСрезПоследних.Цена - биг_СебестоимостьАктивовОстатки.СуммаОстаток КАК PnL,
	|	ЕСТЬNULL((биг_СебестоимостьАктивовОстатки.КоличествоОстаток * биг_РезультатыУправленияСрезПоследних.Цена - биг_СебестоимостьАктивовОстатки.СуммаОстаток) / биг_СебестоимостьАктивовОстатки.СуммаОстаток * 100, 0) КАК PnLRate
	|ПОМЕСТИТЬ ВТ_Вложено
	|ИЗ
	|	РегистрНакопления.биг_СебестоимостьАктивов.Остатки(
	|			&ДатаОкончания,
	|			(Аккаунт = &Аккаунт
	|				ИЛИ &Аккаунт = ЗНАЧЕНИЕ(Справочник.big_MarketAccounts.ПустаяСсылка))
	|				И (Портфель = &Портфель
	|					ИЛИ &Портфель = ЗНАЧЕНИЕ(Справочник.биг_Портфели.ПустаяСсылка))) КАК биг_СебестоимостьАктивовОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.биг_РезультатыУправления.СрезПоследних(
	|				&ДатаОкончания,
	|				(Портфель = &Портфель
	|					ИЛИ &БезОтбораПоПортфелю)
	|					И (Аккаунт = &Аккаунт
	|						ИЛИ &БезОтбораПоАккаунту)) КАК биг_РезультатыУправленияСрезПоследних
	|		ПО биг_СебестоимостьАктивовОстатки.Аккаунт = биг_РезультатыУправленияСрезПоследних.Аккаунт
	|			И биг_СебестоимостьАктивовОстатки.Монета = биг_РезультатыУправленияСрезПоследних.Монета
	|			И биг_СебестоимостьАктивовОстатки.Портфель = биг_РезультатыУправленияСрезПоследних.Портфель
	|ГДЕ
	|	биг_СебестоимостьАктивовОстатки.КоличествоОстаток > 0
	|	И биг_СебестоимостьАктивовОстатки.СуммаОстаток > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Вложено.Аккаунт КАК Аккаунт,
	|	ВТ_Вложено.Портфель КАК Портфель,
	|	СУММА(ВТ_Вложено.ПокупкаСумма) КАК ПокупкаСумма,
	|	СУММА(ВТ_Вложено.ТекСумма) КАК ТекСумма,
	|	СУММА(ВТ_Вложено.PnL) КАК upl
	|ПОМЕСТИТЬ ВТ_ВложеноИтог_УПЛ
	|ИЗ
	|	ВТ_Вложено КАК ВТ_Вложено
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Вложено.Аккаунт,
	|	ВТ_Вложено.Портфель
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	биг_УчастникиПортфелейСрезПоследних.Аккаунт,
	|	биг_УчастникиПортфелейСрезПоследних.Портфель,
	|	СУММА(0),
	|	СУММА(0),
	|	СУММА(биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.isoUpl)
	|ИЗ
	|	РегистрСведений.биг_УчастникиПортфелей.СрезПоследних(
	|			&ДатаОкончания,
	|			(Портфель = &Портфель
	|				ИЛИ &БезОтбораПоПортфелю)
	|				И (Аккаунт = &Аккаунт
	|					ИЛИ &БезОтбораПоАккаунту)) КАК биг_УчастникиПортфелейСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.биг_ОКХ_БаллансАккаунтовДетали.СрезПоследних(&ДатаОкончания, ) КАК биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних
	|		ПО биг_УчастникиПортфелейСрезПоследних.Аккаунт = биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.Account
	|ГДЕ
	|	биг_УчастникиПортфелейСрезПоследних.Участник
	|
	|СГРУППИРОВАТЬ ПО
	|	биг_УчастникиПортфелейСрезПоследних.Аккаунт,
	|	биг_УчастникиПортфелейСрезПоследних.Портфель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВложеноИтог_УПЛ.Аккаунт КАК Аккаунт,
	|	ВТ_ВложеноИтог_УПЛ.Портфель КАК Портфель,
	|	СУММА(ВТ_ВложеноИтог_УПЛ.ПокупкаСумма) КАК ПокупкаСумма,
	|	СУММА(ВТ_ВложеноИтог_УПЛ.ТекСумма) КАК ТекСумма,
	|	СУММА(ВТ_ВложеноИтог_УПЛ.upl) КАК upl,
	|	СУММА(ВТ_ВложеноИтог_УПЛ.upl) / СУММА(ВТ_ВложеноИтог_УПЛ.ПокупкаСумма) * 100 КАК uplRate
	|ПОМЕСТИТЬ ВТ_ВложеноИтог_УплГруппа
	|ИЗ
	|	ВТ_ВложеноИтог_УПЛ КАК ВТ_ВложеноИтог_УПЛ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ВложеноИтог_УПЛ.Аккаунт,
	|	ВТ_ВложеноИтог_УПЛ.Портфель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	биг_ПрибылиИУбыткиОбороты.Портфель КАК Портфель,
	|	биг_ПрибылиИУбыткиОбороты.Аккаунт КАК Аккаунт,
	|	биг_ПрибылиИУбыткиОбороты.Валюта КАК Монета,
	|	биг_ПрибылиИУбыткиОбороты.Регистратор.instId КАК Инструмент,
	|	ВЫБОР
	|		КОГДА биг_ПрибылиИУбыткиОбороты.Регистратор.instType = ЗНАЧЕНИЕ(Перечисление.big_OKX_InstrumentType.SPOT)
	|			ТОГДА биг_ПрибылиИУбыткиОбороты.Регистратор.side
	|		ИНАЧЕ биг_ПрибылиИУбыткиОбороты.Регистратор.posSide
	|	КОНЕЦ КАК ВидОперации,
	|	биг_ПрибылиИУбыткиОбороты.ПрибыльОборот + биг_ПрибылиИУбыткиОбороты.УбытокОборот КАК Операция_PnL,
	|	ЕСТЬNULL(биг_ПрибылиИУбыткиОбороты.Регистратор.pnlRatio * 100, 0) КАК Операция_PnLRate,
	|	ВЫБОР
	|		КОГДА (ВЫРАЗИТЬ(биг_ПрибылиИУбыткиОбороты.Регистратор КАК Документ.big_Order_OKX)) = ЗНАЧЕНИЕ(Документ.big_Order_OKX.ПустаяСсылка)
	|			ТОГДА ""Позиция ID: "" + (ВЫРАЗИТЬ(биг_ПрибылиИУбыткиОбороты.Регистратор.posId КАК СТРОКА(100)))
	|		ИНАЧЕ ""Ордер ID: "" + (ВЫРАЗИТЬ(биг_ПрибылиИУбыткиОбороты.Регистратор.ordId КАК СТРОКА(100)))
	|	КОНЕЦ КАК Операци
	|ПОМЕСТИТЬ ВТ_Результаты
	|ИЗ
	|	РегистрНакопления.биг_ПрибылиИУбытки.Обороты(
	|			&ДатаНачала,
	|			&ДатаОкончания,
	|			Регистратор,
	|			(Аккаунт = &Аккаунт
	|				ИЛИ &Аккаунт = ЗНАЧЕНИЕ(Справочник.big_MarketAccounts.ПустаяСсылка))
	|				И (Портфель = &Портфель
	|					ИЛИ &Портфель = ЗНАЧЕНИЕ(Справочник.биг_Портфели.ПустаяСсылка))) КАК биг_ПрибылиИУбыткиОбороты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Результаты.Портфель КАК Портфель,
	|	ВТ_Результаты.Аккаунт КАК Аккаунт,
	|	СУММА(ВТ_Результаты.Операция_PnL) КАК Операция_PnL
	|ПОМЕСТИТЬ ВТ_РезультатыИтог
	|ИЗ
	|	ВТ_Результаты КАК ВТ_Результаты
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Результаты.Портфель,
	|	ВТ_Результаты.Аккаунт
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ИтоговоеНачало.Портфель КАК Портфель,
	|	ВТ_ИтоговоеНачало.Аккаунт КАК Аккаунт,
	|	ВТ_ИтоговоеНачало.ВалютаОценкиПортфеля КАК ВалютаОценкиПортфеля,
	|	ВТ_ИтоговоеНачало.Период КАК Отч_НачПериод,
	|	ВТ_ГруппаЗавершение.Период КАК Отч_КонПериод,
	|	ЕСТЬNULL(ВТ_ИтоговоеНачало.Сумма, 0) КАК Отч_Нач_Сумма,
	|	ВТ_РезультатыИтог.Операция_PnL КАК Отч_Total_PnL,
	|	ВТ_РезультатыИтог.Операция_PnL / ЕСТЬNULL(ВТ_ИтоговоеНачало.Сумма, 0) * 100 КАК Отч_Total_PnLRate,
	|	ВТ_ВложеноИтог_УплГруппа.ПокупкаСумма КАК Отч_ВложеноСумма,
	|	ВТ_ВложеноИтог_УплГруппа.upl КАК Отч_Total_UPL,
	|	ВТ_ВложеноИтог_УплГруппа.uplRate КАК Отч_Total_uplRate,
	|	ЕСТЬNULL(ВТ_ГруппаЗавершение.Сумма, 0) КАК Отч_Кон_Сумма
	|ИЗ
	|	ВТ_ИтоговоеНачало КАК ВТ_ИтоговоеНачало
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ГруппаЗавершение КАК ВТ_ГруппаЗавершение
	|		ПО ВТ_ИтоговоеНачало.Портфель = ВТ_ГруппаЗавершение.Портфель
	|			И ВТ_ИтоговоеНачало.Аккаунт = ВТ_ГруппаЗавершение.Аккаунт
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ВложеноИтог_УплГруппа КАК ВТ_ВложеноИтог_УплГруппа
	|		ПО ВТ_ИтоговоеНачало.Портфель = ВТ_ВложеноИтог_УплГруппа.Портфель
	|			И ВТ_ИтоговоеНачало.Аккаунт = ВТ_ВложеноИтог_УплГруппа.Аккаунт
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РезультатыИтог КАК ВТ_РезультатыИтог
	|		ПО ВТ_ИтоговоеНачало.Портфель = ВТ_РезультатыИтог.Портфель
	|			И ВТ_ИтоговоеНачало.Аккаунт = ВТ_РезультатыИтог.Аккаунт";
	
	Запрос.УстановитьПараметр("ДатаНачала", 			ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", 			ДатаОкончания);
	Запрос.УстановитьПараметр("Портфель", 				ОтборПортфель.Значение);
	Запрос.УстановитьПараметр("Аккаунт", 				ОтборАккаунт.Значение);
	Запрос.УстановитьПараметр("БезОтбораПоПортфелю", 	НЕ ОтборПортфель.Использование);
	Запрос.УстановитьПараметр("БезОтбораПоАккаунту", 	НЕ ОтборАккаунт.Использование);
	Запрос.УстановитьПараметр("МассивСтейблов", 		биг_ОбщегоНазначенияКлиентСервер.ПолучитьМассивЗначенийПоИмени("Стейблкоин"));
	
	Таблица = Запрос.Выполнить().Выгрузить();

	//Если Таблица.Количество() > 0 Тогда
	//	
	//	// подход сильно так себе, но по другому чето быстро не получилось
	//	ТабРезультат = Таблица.Скопировать();
	//	ТабРезультат.Очистить();
	//	
	//	ТабПортфель		= Таблица.Скопировать();
	//	ТабПортфель.Свернуть("Портфель");
	//	МассивПортфель 	= ТабПортфель.ВыгрузитьКолонку("Портфель");
	//	
	//	ТабАккаунт		= Таблица.Скопировать();
	//	ТабАккаунт.Свернуть("Аккаунт");
	//	МассивАккаунтов	= ТабАккаунт.ВыгрузитьКолонку("Аккаунт");
	//	
	//	ТабВалютаОценки	= Таблица.Скопировать();
	//	ТабВалютаОценки.Свернуть("ВалютаОценкиПортфеля");
	//	МассивВалют		= ТабВалютаОценки.ВыгрузитьКолонку("ВалютаОценкиПортфеля");
	//	
	//	Для каждого Портфель Из МассивПортфель Цикл
	//		
	//		Для каждого Аккаунт Из МассивАккаунтов Цикл
	//			
	//			Для каждого ВалютаОценки Из МассивВалют Цикл
	//				
	//				Поиск = Новый Структура("Портфель, Аккаунт, ВалютаОценкиПортфеля", Портфель, Аккаунт, ВалютаОценки);
	//				Строки = Таблица.НайтиСтроки(Поиск);
	//				
	//				Если Строки.Количество() > 0 Тогда
	//					
	//					НС = ТабРезультат.Добавить();
	//					НС.Портфель 			= Портфель;
	//					НС.Аккаунт 				= Аккаунт;
	//					НС.ВалютаОценкиПортфеля	= ВалютаОценки;
	//					
	//					БалансСтейблов 	= 0;
	//					БалансМонет		= 0;
	//					Для каждого Строка Из Строки Цикл
	//						
	//						// заполним "значения по умолчанию"
	//						НС.Отч_НачПериод	= Дата(1,1,1);
	//						НС.Отч_КонПериод	= Дата(1,1,1); 
	//						НС.Отч_Нач_Сумма	= 0;
	//						НС.Отч_Кон_Сумма	= 0;
	//						
	//						НС.Отч_НачПериод	= Макс(НС.Отч_НачПериод, Строка.Отч_НачПериод);
	//						НС.Отч_КонПериод	= Макс(НС.Отч_КонПериод, Строка.Отч_КонПериод);
	//						
	//						НС.Отч_Нач_Сумма 	= НС.Отч_Нач_Сумма + Строка.Отч_Нач_Сумма;
	//						НС.Отч_Кон_Сумма	= НС.Отч_Кон_Сумма + Строка.Отч_Кон_Сумма;
	//						
	//						Если Строка.ЭтоСтейбл Тогда
	//							БалансСтейблов 	= БалансСтейблов + Строка.Отч_Кон_Сумма;
	//						Иначе
	//							БалансМонет		= БалансМонет + Строка.Отч_Кон_Сумма;	
	//						КонецЕсли;
	//					КонецЦикла;
	//					
	//					НС.Отч_Total_PnL 		= БалансСтейблов - НС.Отч_Нач_Сумма;
	//					НС.Отч_Total_UPL		= БалансМонет;
	//					Если НС.Отч_Нач_Сумма > 0 Тогда
	//						НС.Отч_Total_PnLRate	= НС.Отч_Total_PnL / (НС.Отч_Нач_Сумма / 100);
	//						НС.Отч_Total_UPLRate	= НС.Отч_Total_UPL / (НС.Отч_Нач_Сумма / 100);	
	//					КонецЕсли;
	//					
	//				КонецЕсли;					
	//			КонецЦикла;			
	//		КонецЦикла;			
	//	КонецЦикла;		
	//КонецЕсли;
	
	Возврат Таблица;
	
КонецФункции

