
////////////////////////////////////////////////////////////////////////////////
// биг_ГлобальныйКлиентСервер: модуль содержит глобальные клиент-серверные функции
// в основном это математические или иные простейшие методы, которые отсутствуют в платформе 1С
//  
////////////////////////////////////////////////////////////////////////////////
#Область ПрограммныйИнтерфейс

Функция Абс(Число) Экспорт
	
	Возврат ?(Число > 0, Число, -Число);
		
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция Модуль(Число) Экспорт

	Возврат Абс(Число);
	
КонецФункции
 
#КонецОбласти
