#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает значение перечисления по имени значения.
//
// Параметры:
//  ИмяЗначения	- Строка - имя значения, как оно передается через API
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.СостоянияПриложений - значение перечисления по имени.
//
Функция ЗначениеПоИмени(ИмяЗначения) Экспорт
    
    Если ИмяЗначения = "ready" Тогда
        Возврат ПредопределенноеЗначение("Перечисление.СостоянияПриложений.Готово");
    ИначеЕсли ИмяЗначения = "preparation" Тогда
        Возврат ПредопределенноеЗначение("Перечисление.СостоянияПриложений.ГотовитсяКИспользованию");
    ИначеЕсли ИмяЗначения = "used" Тогда
        Возврат ПредопределенноеЗначение("Перечисление.СостоянияПриложений.Используется");
    ИначеЕсли ИмяЗначения = "converted" Тогда
        Возврат ПредопределенноеЗначение("Перечисление.СостоянияПриложений.Конвертируется");
    ИначеЕсли ИмяЗначения = "copied" Тогда
        Возврат ПредопределенноеЗначение("Перечисление.СостоянияПриложений.Копируется");
    ИначеЕсли ИмяЗначения = "decommissioned" Тогда
        Возврат ПредопределенноеЗначение("Перечисление.СостоянияПриложений.КУдалению");
    ИначеЕсли ИмяЗначения = "new" Тогда
        Возврат ПредопределенноеЗначение("Перечисление.СостоянияПриложений.Новая");
    ИначеЕсли ИмяЗначения = "error" Тогда
        Возврат ПредопределенноеЗначение("Перечисление.СостоянияПриложений.ОшибкаПодготовки");
    ИначеЕсли ИмяЗначения = "removed" Тогда
        Возврат ПредопределенноеЗначение("Перечисление.СостоянияПриложений.Удалена");
    Иначе
        Возврат ПредопределенноеЗначение("Перечисление.СостоянияПриложений.ПустаяСсылка");
    КонецЕсли; 
    
КонецФункции

#КонецОбласти

#КонецЕсли