#Область УсловияИспользования

// Разрешается любое использование при условии сохранения содержимого области УсловияИспользования 
// Автор - https://infostart.ru/profile/211132
// Место публикации - https://infostart.ru/1c/tools/2219190 

#КонецОбласти
 
#Область ОписаниеПеременных

Перем мТекИдентификатор;
Перем мЭлементы;

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Добавление нового элемента условного оформления.
// Он является контейнером дял настроек реализующих непосредственно условное оформление
//
// Параметры:
//  
//  пПредставление - Строка - Представление элемента.
//                 По нему будет сформирован внутрений идентификатор для служебных нужд конструктора
//
// Возвращаемое значение:
//   Строка - Внутренний идентификатор добавленного элемента. Используется для поиска элемента в конструкторе
//
Функция НовыйЭлемент(пПредставление) Экспорт
	
	мТекИдентификатор = ИдентификаторПоПредставлению(пПредставление);
	ОписаниеЭлемента = ОписаниеЭлемента(мТекИдентификатор);
	ОписаниеЭлемента.Представление = пПредставление;
	
	Возврат мТекИдентификатор;
	
КонецФункции

// Добавление элемента в отбор элемента условного оформления
//
// Параметры:
//
//  пПутьКДанным  - Строка - выражение для получения значения отбора
//  пВидСравнения  - ВидСравненияКомпоновкиДанных,Строка - значение стандартного перечисления определяющее способ фильтрации по значению
//                 в строковом варианте ожидается имя значения перечисления
//                 Если не задано, то для массива будет добавлен отбор ВСписке, а для прочих Равно
//  пЗначение  - Произвольный - значение отбора
//  пГруппа  - Строка - Идентификатор группы элементов отбора
//                 Если задано, то элемент будет добавлен в указанную группу
//  пИдентификатор  - Строка - Идентификатор элемента условного оформления
//                 Если не задано, то отбор будет добавлен в последний добавленный элемент
// Возвращаемое значение:
//   Булево   - Признак успеха добавления
//
Функция ДобавитьОтбор(пПутьКДанным, пВидСравнения = Неопределено, пЗначение, пГруппа = Неопределено, пИдентификатор = Неопределено) Экспорт
	
	Результат = Истина;
	
	Идентификатор = ?(пИдентификатор = Неопределено, мТекИдентификатор, пИдентификатор);
	СпособСравнения = СпособСравнения(пВидСравнения, пЗначение);
	Если ТипЗнч(пЗначение) = Тип("Массив") Тогда
		Значение = Новый СписокЗначений;
		Значение.ЗагрузитьЗначения(пЗначение);
	Иначе
		Значение = пЗначение;
	КонецЕсли;
	
	Описание = ОписаниеЭлемента(Идентификатор);
	ЭлемОтбор = Новый Структура;
	ЭлемОтбор.Вставить("ПутьКДанным", пПутьКДанным);
	ЭлемОтбор.Вставить("ВидСравнения", СпособСравнения);
	ЭлемОтбор.Вставить("Значение", Значение);
	ЭлемОтбор.Вставить("Группа", пГруппа);
	Описание.Отбор.Элементы.Добавить(ЭлемОтбор);
	
	Возврат Результат;
	
КонецФункции

// Добавление группы в отбор элемента условного оформления
// ВАЖНО!!! Если есть вложенность групп, то добавлять их в иерархическом порядке
//
// Параметры:
//
//  пПредставление  - Строка - представление группы
//  пТип  - ТипГруппыЭлементовОтбораКомпоновкиДанных,Строка - Тип группы
//                 в строковом варианте ожидается имя значения перечисления: ГруппаИ,ГруппаИли,ГруппаНе
//  пГруппа  - Строка - Идентификатор группы элементов отбора
//                 Если задано, то группа будет добавлена в указанную группу как подгруппа
//  пИдентификатор  - Строка - Идентификатор элемента условного оформления
//                 Если не задано, то группа отбора будет добавлена в последний добавленный элемент
// Возвращаемое значение:
//   Булево   - Признак успеха добавления
//
Функция ДобавитьГруппуОтбора(пПредставление, пТип, пГруппа = Неопределено, пИдентификатор = Неопределено) Экспорт
	
	ИдентификаторУО = ?(пИдентификатор = Неопределено, мТекИдентификатор, пИдентификатор);
	ИдентификаторГруппы = ИдентификаторПоПредставлению(пПредставление);
	
	Описание = ОписаниеЭлемента(ИдентификаторУО);
	ЭлемОтбор = Новый Структура;
	ЭлемОтбор.Вставить("Идентификатор", ИдентификаторГруппы);
	ЭлемОтбор.Вставить("Представление", пПредставление);
	ЭлемОтбор.Вставить("ТипГруппы", ТипГруппыОтбора(пТип));
	ЭлемОтбор.Вставить("Группа", пГруппа);
	Описание.Отбор.Группы.Добавить(ЭлемОтбор);
	
	Возврат ИдентификаторГруппы;
	
КонецФункции

// Добавление оформления в элемент условного оформления
//
// Параметры:
//  
//  пОформление - Строка,Структура - Описание оформления
//                 Для Строки ожидается имя вида оформления (ЦветФона,Шрифт итд). В этом случае передача значения обязательна
//                 Если Передана Структура, то в ключах ожидается имя вида оформления, а в значениях собственно значение оформления
//  пЗначение - Произвольный - значение оформления. Обязательно, при передаче оформления в виде имени вида оформления
//  пИдентификатор  - Строка - Идентификатор элемента условного оформления
//                 Если не задано, то оформление будет добавлено в последний добавленный элемент
//
// Возвращаемое значение:
//   Булево   - Признак успеха добавления
//
Функция ДобавитьОформление(пОформление, пЗначение = Неопределено, пИдентификатор = Неопределено) Экспорт
	
	Результат = Истина;
	
	ТипПараметра = ТипЗнч(пОформление);
	Если ТипПараметра = Тип("Строка") Тогда
		ОформлениеЭлемента = Новый Структура;
		ОформлениеЭлемента.Вставить(пОформление, пЗначение);
	Иначе
		ОформлениеЭлемента = пОформление;
	КонецЕсли;
	
	Идентификатор = ?(пИдентификатор = Неопределено, мТекИдентификатор, пИдентификатор);
	Описание = ОписаниеЭлемента(Идентификатор);
	Для Каждого ТекЭлем Из ОформлениеЭлемента Цикл
		Описание.Оформление.Вставить(ТекЭлем.Ключ, ТекЭлем.Значение);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Явное указание оформляемых полей
// Если не указывать, то оформление применится ко всем полям
//
// Параметры:
//  
//  пПутьКДанным - Строка,Массив,СписокЗначений,Структура,Соответствие - пути к данным оформляемых полей
//                 Для коллекций типа Структура и Соответствие предполагается хранение имени реквизита в ключе
//  пИдентификатор  - Строка - Идентификатор элемента условного оформления
//                 Если не задано, то поле будет добавлено в последний добавленный элемент
//
// Возвращаемое значение:
//   Булево   - Признак успеха добавления
//
Функция УказатьОформляемыеПоля(пПутьКДанным, пИдентификатор = Неопределено) Экспорт
	
	Результат = Истина;
	
	ИзЗначения = Ложь;
	ТолькоУникальные = Истина;
	НовыеПоля = КоллекцииКлиентСервер_бук.ПреобразоватьВМассив(пПутьКДанным, ИзЗначения,,, ТолькоУникальные);
	Идентификатор = ?(пИдентификатор = Неопределено, мТекИдентификатор, пИдентификатор);
	Описание = ОписаниеЭлемента(Идентификатор);
	
	
	КоллекцииКлиентСервер_бук.ДополнитьМассив(Описание.Поля, НовыеПоля, ТолькоУникальные);
	
	Возврат Результат;
	
КонецФункции

// Формирует настройки условного оформления для дальнейшего использования
//
// Параметры:
//  нет передаваемых параметров
//
// Возвращаемое значение:
//   Структура - декларативное описание условного оформления
//
Функция СформироватьНастройки() Экспорт
	
	Результат = КоллекцииКлиентСервер_бук.Скопировать(мЭлементы); //копирует рекурсивно
	
	Возврат Результат;
	
КонецФункции

// Дополнение настроек оформления другими настройками оформления
//
// Параметры:
//  
//  пНастройкиОформления - Структура - Другие настройки оформления сформированные ранее
//
Процедура Дополнить(пНастройкиОформления) Экспорт
	
	Для Каждого ЭлемНастройка Из пНастройкиОформления Цикл
		Идентификатор = ЭлемНастройка.Ключ;
		Описание = ЭлемНастройка.Значение;
		НовыйЭлемент(Описание.Представление);
		Для Каждого ГруппаОтбора Из Описание.Отбор.Группы Цикл
			ДобавитьГруппуОтбора(ГруппаОтбора.Представление, ГруппаОтбора.ТипГруппы, ГруппаОтбора.Группа);
		КонецЦикла;
		Для Каждого ЭлемОтбора Из Описание.Отбор.Элементы Цикл
			ДобавитьОтбор(ЭлемОтбора.ПутьКДанным, ЭлемОтбора.ВидСравнения, ЭлемОтбора.Значение, ЭлемОтбора.Группа); 
		КонецЦикла; 
		ДобавитьОформление(Описание.Оформление);
		УказатьОформляемыеПоля(Описание.Поля);
	КонецЦикла;
	
КонецПроцедуры

// Применение настроек к условному оформлению
//
// Параметры:
//  
//  пУсловноеОформление - УсловноеОформлениеКомпоновкиДанных - Элемент компоновки к которому нужно применить настройки
//  пНастройкиОформления - Структура - Декларативные Настройки условного оформления
//                 Если не задано, то будут применены настройки введенные в данном экземпляре
//                 В иных случаях можно передать сформированные ранее и возможно хранимые настройки
//                 В любом случае настройки должны быть сформированы данным классом
//
Процедура Применить(пУсловноеОформление, пНастройкиОформления = Неопределено) Экспорт
	
	Если пНастройкиОформления = Неопределено Тогда
		Настройки = СформироватьНастройки();
	Иначе
		Настройки = пНастройкиОформления;
	КонецЕсли;
	
	ГруппыПоКлючамНастройки = Новый Соответствие; // ключ - ИД настройки, значение - группа УО
	Для Каждого ЭлемНастройка Из Настройки Цикл
		Настройка = ЭлемНастройка.Значение;
		
		ЭлементУО = ДобавитьЭлементУО(пУсловноеОформление, Настройка);
		ДобавитьГруппыОтбораУО(ЭлементУО, Настройка, ГруппыПоКлючамНастройки);
		ДобавитьЭлементыОтбораУО(ЭлементУО, Настройка, ГруппыПоКлючамНастройки);
		ДобавитьОформлениеУО(ЭлементУО, Настройка);
		ДобавитьПоляУО(ЭлементУО, Настройка);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

#Область ЗаполнениеУО


Функция ДобавитьЭлементУО(пУсловноеОформление, Настройка)
	
	ЭлементУО = пУсловноеОформление.Элементы.Добавить();
	ЭлементУО.Использование = Истина;
	ЭлементУО.Представление = Настройка.Представление;
	ЭлементУО.ПредставлениеПользовательскойНастройки = Настройка.Представление;
	ЭлементУО.ИдентификаторПользовательскойНастройки = Настройка.Идентификатор;
	Возврат ЭлементУО;

КонецФункции

Процедура ДобавитьГруппыОтбораУО(пЭлементУО, пНастройкаЭлемента, пГруппыПоКлючамНастройки)
	
	ТипГруппаОтбора = Тип("ГруппаЭлементовОтбораКомпоновкиДанных");
	
	Для Каждого Настройка Из пНастройкаЭлемента.Отбор.Группы Цикл
		Если ЗначениеЗаполнено(Настройка.Группа) Тогда
			КоллекцияЭлементов = пГруппыПоКлючамНастройки[Настройка.Группа].Элементы; 
		Иначе
			КоллекцияЭлементов = пЭлементУО.Отбор.Элементы;
		КонецЕсли;
		ЭлемГруппа = КоллекцияЭлементов.Добавить(ТипГруппаОтбора);
		пГруппыПоКлючамНастройки[Настройка.Идентификатор] = ЭлемГруппа;
		ЭлемГруппа.Использование = Истина;
		ЭлемГруппа.Представление = Настройка.Представление;
		ЭлемГруппа.ТипГруппы = Настройка.ТипГруппы;
		ЭлемГруппа.ПредставлениеПользовательскойНастройки = Настройка.Представление;
		ЭлемГруппа.ИдентификаторПользовательскойНастройки = Настройка.Идентификатор;
	КонецЦикла

КонецПроцедуры

Процедура ДобавитьЭлементыОтбораУО(пЭлементУО, пНастройкаЭлемента, пГруппыПоКлючамНастройки)
	
	ТипЭлементОтбора = Тип("ЭлементОтбораКомпоновкиДанных");
	
	Для Каждого Настройка Из пНастройкаЭлемента.Отбор.Элементы Цикл
		Если ЗначениеЗаполнено(Настройка.Группа) Тогда
			КоллекцияЭлементов = пГруппыПоКлючамНастройки[Настройка.Группа].Элементы; 
		Иначе
			КоллекцияЭлементов = пЭлементУО.Отбор.Элементы;
		КонецЕсли;
		ЭлемОтбор = КоллекцияЭлементов.Добавить(ТипЭлементОтбора);
		ЭлемОтбор.Использование = Истина;
		ЭлемОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Настройка.ПутьКДанным);
		ЭлемОтбор.ВидСравнения = Настройка.ВидСравнения;
		ЭлемОтбор.ПравоеЗначение = Настройка.Значение;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьОформлениеУО(пЭлементУО, Настройка)
	
	Для Каждого Оформление Из Настройка.Оформление Цикл
		ЭлемОформление = пЭлементУО.Оформление.Элементы.Найти(Оформление.Ключ);
		ЭлемОформление.Использование = Истина;
		ЭлемОформление.Значение = Оформление.Значение;
	КонецЦикла;

КонецПроцедуры

Процедура ДобавитьПоляУО(пЭлементУО, Настройка)
	
	Для Каждого ИмяПоля Из Настройка.Поля Цикл
		ЭлемПоле = пЭлементУО.Поля.Элементы.Добавить(); 
		ЭлемПоле.Использование = Истина;
		ЭлемПоле.Поле = Новый ПолеКомпоновкиДанных(ИмяПоля);
	КонецЦикла;

КонецПроцедуры

	
#КонецОбласти

Функция ОписаниеЭлемента(пИдентификатор)
	
	Перем Результат;
	
	мЭлементы.Свойство(пИдентификатор, Результат);
	Если Результат = Неопределено Тогда
		Результат = Новый Структура; 
		Результат.Вставить("Идентификатор", пИдентификатор);
		Результат.Вставить("Представление", "");
		Результат.Вставить("Оформление", Новый Структура);
		Отбор = Новый Структура;
		Отбор.Вставить("Элементы", Новый Массив);
		Отбор.Вставить("Группы", Новый Массив);
		Результат.Вставить("Отбор", Отбор);
		Результат.Вставить("Поля", Новый Массив); // Оформляемые поля
		мЭлементы.Вставить(пИдентификатор, Результат);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СпособСравнения(пВидСравнения = Неопределено, пЗначение = Неопределено)
	
	Перем Результат;
	
	Если пВидСравнения = Неопределено Тогда
		Если ТипЗнч(пЗначение) <> Тип("Массив") Тогда
			Возврат ПредопределенноеЗначение("ВидСравненияКомпоновкиДанных.Равно");
		Иначе
			Возврат ПредопределенноеЗначение("ВидСравненияКомпоновкиДанных.ВСписке");
		КонецЕсли;	
	КонецЕсли;
	
	ТипДанных = ТипЗнч(пВидСравнения);
	
	Если ТипДанных = Тип("ВидСравненияКомпоновкиДанных") Тогда
		Результат = пВидСравнения;
	ИначеЕсли ТипДанных = Тип("Строка") Тогда
		Результат = ПредопределенноеЗначение("ВидСравненияКомпоновкиДанных." + пВидСравнения);
	Иначе
		ТекстОшибки = "Конструктор условного оформления. Передан некорректный вид сравнения";
		ВызватьИсключение (ТекстОшибки, КатегорияОшибки.ОшибкаКонфигурации);
	КонецЕсли;
	                                                           
	Возврат Результат;
	
КонецФункции

Функция ТипГруппыОтбора(пТип)
	
	ТипПараметра = ТипЗнч(пТип);
	Если ТипПараметра = Тип("Строка") Тогда
		Результат = ПредопределенноеЗначение("ТипГруппыЭлементовОтбораКомпоновкиДанных." + пТип);
	ИначеЕсли ТипПараметра = Тип("ТипГруппыЭлементовОтбораКомпоновкиДанных") Тогда
		Результат = пТип;
	Иначе
		ТекстОшибки = "Конструктор условного оформления. Передан некорректный вид тип группы элементов отбора";
		ВызватьИсключение (ТекстОшибки, КатегорияОшибки.ОшибкаКонфигурации);
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Функция ЭлементыУсловногоОформления()
	
	Если мЭлементы = Неопределено Тогда
		мЭлементы = Новый Структура;
	КонецЕсли;
	
	Возврат мЭлементы;
	
КонецФункции

Функция ИдентификаторПоПредставлению(пПредставление)
	
	ДопустимыеСимволы = "абвгдеёжзийклмнопрстуфхцчшщъыьэюяАБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ" +
						 "abcdefghijklmnopqrstuvwxyzQWERTYUIOPASDFGHJKLZXCVBNM" + 
						 "0123456789_";
	
	СимволыПредставления = Новый Массив;
	
	Для Сч = 1 по СтрДлина(пПредставление) Цикл
		ТекСимвол = Сред(пПредставление, Сч, 1);
		Если СтрНайти(ДопустимыеСимволы, ТекСимвол) > 0 Тогда
			СимволыПредставления.Добавить(ТекСимвол);
		КонецЕсли;
	КонецЦикла;
	
	Результат = СтрСоединить(СимволыПредставления, "");

	Возврат Результат;
	
КонецФункции

#КонецОбласти









мЭлементы = ЭлементыУсловногоОформления();
Если Ложь Тогда мЭлементы = Новый Структура; КонецЕсли;
