
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТочкаВхода2Датой 			= биг_ОбщегоНазначенияКлиентСервер.TimestampВДату(Запись.ТочкаВхода2);
	ТочкаВхода1Датой            = биг_ОбщегоНазначенияКлиентСервер.TimestampВДату(Запись.ТочкаВхода1);
	ТочкаВыхода1Датой           = биг_ОбщегоНазначенияКлиентСервер.TimestampВДату(Запись.ТочкаВыхода1);
	ТочкаВыхода2Датой           = биг_ОбщегоНазначенияКлиентСервер.TimestampВДату(Запись.ТочкаВыхода2);
	ТочкаЗавершенияПаденияДатой = биг_ОбщегоНазначенияКлиентСервер.TimestampВДату(Запись.ТочкаЗавершенияПадения);
	ТочкаНачалаСобытияДатой     = биг_ОбщегоНазначенияКлиентСервер.TimestampВДату(Запись.ТочкаНачалаСобытия);
	ТочкаРазворотаДатой         = биг_ОбщегоНазначенияКлиентСервер.TimestampВДату(Запись.ТочкаРазворота);
	ТочкаСигналЗавершенДатой    = биг_ОбщегоНазначенияКлиентСервер.TimestampВДату(Запись.ТочкаСигналЗавершен);
	
КонецПроцедуры
