// @strict-types

#Область ПрограммныйИнтерфейс

#Область СтатистикаРасширений

// Выполняет фиксацию события работы расширения, в группе событий "Пользовательское"
// @skip-warning ПустойМетод - особенность реализации.
//
// Параметры:
//	ИдентификаторСобытия - Строка - идентификатор события полученный в личном кабинете Менеджера сервиса (длина 36).
//
// Пример:
//	БТСКлиент.ЗафиксироватьСобытиеСтатистикиРасширения("2f1df77a-9f07-11e9-9d8c-0242ac1d0004")
//
Процедура ЗафиксироватьСобытиеСтатистикиРасширения(Знач ИдентификаторСобытия) Экспорт
КонецПроцедуры

#КонецОбласти

#КонецОбласти