
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПереченьРасширений.Загрузить(ПолучитьИзВременногоХранилища(Параметры.АдресХраненияРасширений));
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПереченьРасширений

&НаКлиенте
Процедура ПереченьРасширенийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ДанныеВыбора = Элементы.ПереченьРасширений.ТекущиеДанные;
	Закрыть(ДанныеВыбора.Имя);
КонецПроцедуры

#КонецОбласти
