// @strict-types

#Область ПрограммныйИнтерфейс

// Открывает форму объекта расширения из каталога расширений
// @skip-warning ПустойМетод - особенность реализации.
// 
// Параметры:
// 	ПубличныйИдентификатор - Строка - публичный идентификатор расширения из Менеджера сервиса
// 	ОписаниеОповещения - ОписаниеОповещения - необязательный, позволяет обработать закрытие формы.
// 		Процедура, которая будет обрабатывать вызов описания оповещения, в качестве первого параметра будет получать
// 		значение типа "ПеречислениеСсылка.СостоянияРасширений", описывающее состояние расширения в момент закрытия формы
// 		(подробности см. в описании метода "ОткрытьФорму" глобального контекста).
//
Процедура ОткрытьОбъектРасширения(Знач ПубличныйИдентификатор, Знач ОписаниеОповещения = Неопределено) Экспорт
КонецПроцедуры

// Открывает каталог расширений.
// @skip-warning ПустойМетод - особенность реализации.
//
Процедура ОткрытьКаталогРасширений() Экспорт 
КонецПроцедуры

// Предложить пользователю оценить расширение. 
// Использовать можно только после успешного вызова КаталогРасширений.ИнформацияОбОценкеПользователя.
// Полученный результат необходимо проанализировать и в случае необходимости вызвать
// КаталогРасширенийКлиент.ПредложитьПользователюОценитьРасширение.
// При вызове данной процедуры пользователю будет показан вопрос с тремя 
// вариантами ответа: "Оценить", "Оценить позже", "Больше не предлагать".
// Если пользователь ранее уже выбрал ответ "Больше не предлагать", диалог вопроса не появится.
// @skip-warning ПустойМетод - особенность реализации.
// 
// Параметры:
//  ПубличныйИдентификатор - Строка - публичный идентификатор расширения из Менеджера сервиса
//  ТекстПредложения - Строка - текст предложения показываемый пользователю.
//   Если текст не задан, будет использоваться стандартный
Процедура ПредложитьПользователюОценитьРасширение(ПубличныйИдентификатор, ТекстПредложения = "") Экспорт
КонецПроцедуры

#КонецОбласти
