#Область УниверсальныеМетоды

// Унифицированный метод для подготовки параметров под вызов API CoinGecko для загрузки топа
Функция ПараметрыОперацииБиржи_ЗагрузитьТопИнструментов(ПараметрыОперации) Экспорт
	
    Возврат биг_КоинГеко_КлиентСервер.ПараметрыОперацииБиржи_ЗагрузитьТопИнструментов(ПараметрыОперации);
	
КонецФункции

// Унифицированный метод для вызова API CoinGecko и получения данных
Функция ЗагрузитьТопИнструментов(ПараметрыОперацииБиржи) Экспорт
	
    Модуль = ИнициализироватьМодуль();
    Возврат Модуль.GET_CoinsMarkets(ПараметрыОперацииБиржи);
	
КонецФункции

#КонецОбласти //УниверсальныеМетоды

#Область СлужебныеПроцедурыФункции

// Инициализация модуля API CoinGecko
Функция ИнициализироватьМодуль()  
	
    Модуль = Обработки.биг_КоинГеко_АПИ.Создать();
	Возврат Модуль;
	
КонецФункции

#КонецОбласти //СлужебныеПроцедурыФункции