
////////////////////////////////////////////////////////////////////////////////
// <Double Impact: Логика работы стратегии.>
//  
////////////////////////////////////////////////////////////////////////////////
#Область ПрограммныйИнтерфейс


#Область Управление

Процедура ИсполнениеСтратегии() Экспорт
	
	// пропустим цикл, если предыдущее задание не завершилось
	Если биг_ОбщегоНазначения.ФоновоеЗаданиеАктивно_ПоКлючу("big_ВыполнитьСтратегиюАлгоИмпакт") Тогда
		Возврат;
	КонецЕсли;	
	
	ТаймСтамп 	= биг_ОбщегоНазначенияКлиентСервер.ДатуВTimestampЧисло();
	Бектест		= Ложь;
	
	ВыборкаИнструментовСтратегии = ПолучитьВыборкуИнструментовСтратегии();	
	Пока ВыборкаИнструментовСтратегии.Следующий() Цикл
		
		ОбработатьИнструмент(ВыборкаИнструментовСтратегии, ТаймСтамп, Бектест);		
	КонецЦикла;
	
КонецПроцедуры       

Процедура ОбработатьИнструмент(ПараметрыИнструмента, ТаймСтамп, Бектест) Экспорт
	
	КлючНастроек = ПараметрыИнструмента.КлючНастроек;
	ПроверитьОперацииПоАктивнымСигналам(ТаймСтамп, Бектест, КлючНастроек, ПараметрыИнструмента.ИнструментИД, ПараметрыИнструмента.Биржа);
	
	//получить текущие активные точки и их статус	
	МассивСигналов = ПолучитьМассивАктивныхСигналов(ПараметрыИнструмента, ТаймСтамп);
	
	Если НЕ ТребуетсяОбработкаСигнала(ПараметрыИнструмента, КлючНастроек, ТаймСтамп) Тогда
		Возврат;	
	КонецЕсли;
		
	Для каждого Сигнал Из МассивСигналов Цикл
		
		Сигнал.Бектест 	= Бектест;
		ШагВыполнен		= Ложь;
		ВыполнениеСигнала(Сигнал, КлючНастроек, ТаймСтамп, ШагВыполнен);
		
		Если ШагВыполнен Тогда
			ЗафиксироватьТочкуТекущегоШага(ПараметрыИнструмента, КлючНастроек, ТаймСтамп);	
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры

Процедура ПроверитьОперацииПоАктивнымСигналам(ТаймСтамп = Неопределено, Бектест = Ложь, КлючНастройки = Неопределено, ИнструментИД, Биржа) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	биг_ДаблИмпактСигналы.Биржа КАК Биржа,
	|	биг_ДаблИмпактСигналы.ИнструментИД КАК ИнструментИД,
	|	биг_ДаблИмпактСигналы.Бар КАК Бар,
	|	биг_ДаблИмпактСигналы.ТочкаНачалаПадения КАК ТочкаНачалаПадения,
	|	биг_ДаблИмпактСигналы.КлючНастроек КАК КлючНастроек
	|ПОМЕСТИТЬ ВТ_АктивныеСигналы
	|ИЗ
	|	РегистрСведений.биг_ДаблИмпактСигналы КАК биг_ДаблИмпактСигналы
	|ГДЕ
	|	НЕ биг_ДаблИмпактСигналы.СигналЗавершен
	|	И (биг_ДаблИмпактСигналы.КлючНастроек = &КлючНастроек
	|			ИЛИ &БезФильтраПоНастройке)
	|	И биг_ДаблИмпактСигналы.ИнструментИД = &ИнструментИД
	|	И биг_ДаблИмпактСигналы.Биржа = &Биржа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	биг_ДаблИмпактОперации.Биржа КАК Биржа,
	|	биг_ДаблИмпактОперации.Аккаунт КАК Аккаунт,
	|	биг_ДаблИмпактОперации.НастройкаСтратегии КАК НастройкаСтратегии,
	|	биг_ДаблИмпактОперации.ИнструментИД КАК ИнструментИД,
	|	биг_ДаблИмпактОперации.ТочкаНачалаПадения КАК ТочкаНачалаПадения,
	|	биг_ДаблИмпактОперации.Операция КАК Операция,
	|	ВЫРАЗИТЬ(биг_ДаблИмпактОперации.Операция КАК Документ.big_AlgoOrders_OKX).slOrdPx КАК slOrdPx,
	|	ВЫРАЗИТЬ(биг_ДаблИмпактОперации.Операция КАК Документ.big_AlgoOrders_OKX).tpOrdPx КАК tpOrdPx,
	|	ВЫРАЗИТЬ(биг_ДаблИмпактОперации.Операция КАК Документ.big_AlgoOrders_OKX).state КАК state,
	|	биг_ДаблИмпактОперации.Операция.Дата КАК Дата,
	|	биг_ДаблИмпактОперации.Бар КАК Бар,
	|	биг_ДаблИмпактОперации.Операция.Событие КАК Событие,
	|	биг_ДаблИмпактОперации.Операция.slTriggerPx КАК slTriggerPx,
	|	биг_ДаблИмпактОперации.Операция.tpTriggerPx КАК tpTriggerPx,
	|	биг_ДаблИмпактОперации.Операция.sz КАК sz,
	|	ЕСТЬNULL(биг_ДаблИмпактОперации.Операция.Ордер.fillSz, 0) КАК fillSz,
	|	биг_ДаблИмпактОперации.Операция.НастройкаСтратегии КАК КлючНастроек,
	|	ВЫРАЗИТЬ(биг_ДаблИмпактОперации.Операция КАК Документ.big_AlgoOrders_OKX).algoId КАК algoId,
	|	биг_ДаблИмпактОперации.Операция.side КАК side,
	|	биг_ДаблИмпактОперации.Операция.posSide КАК posSide
	|ИЗ
	|	ВТ_АктивныеСигналы КАК ВТ_АктивныеСигналы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.биг_ДаблИмпактОперации КАК биг_ДаблИмпактОперации
	|		ПО ВТ_АктивныеСигналы.Биржа = биг_ДаблИмпактОперации.Биржа
	|			И ВТ_АктивныеСигналы.ИнструментИД = биг_ДаблИмпактОперации.ИнструментИД
	|			И ВТ_АктивныеСигналы.ТочкаНачалаПадения = биг_ДаблИмпактОперации.ТочкаНачалаПадения
	|			И ВТ_АктивныеСигналы.КлючНастроек = биг_ДаблИмпактОперации.НастройкаСтратегии
	|ГДЕ
	|	(ВЫРАЗИТЬ(биг_ДаблИмпактОперации.Операция КАК Документ.big_AlgoOrders_OKX)) <> ЗНАЧЕНИЕ(Документ.big_AlgoOrders_OKX.ПустаяСсылка)
	|	И ВЫРАЗИТЬ(биг_ДаблИмпактОперации.Операция КАК Документ.big_AlgoOrders_OKX).Проведен";
	
	Запрос.УстановитьПараметр("КлючНастроек", 			КлючНастройки);
	Запрос.УстановитьПараметр("БезФильтраПоНастройке", 	КлючНастройки = Неопределено);
	Запрос.УстановитьПараметр("ИнструментИД", 			ИнструментИД);
	Запрос.УстановитьПараметр("Биржа", 					Биржа);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Бектест = Ложь Тогда // актуализация ордеров в настоящем времени
			
			биг_МаркетАпи.АктуализироватьАлгоОрдер(Выборка.Операция);	
		Иначе // имитируем работу с биржей
			
			ИскуственноПроверитьВыполнениеОрдера(Выборка, ТаймСтамп);	
		КонецЕсли;
		// получить актуальный статус
		
		ПроверитьАктуальностьСигнала(Выборка, ТаймСтамп);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти //Управление


#Область Интеграция

Процедура ЗафиксироватьОперацию(Операция) Экспорт
	
	//Запись = РегистрыСведений.биг_ДаблИмпактОперации.СоздатьМенеджерЗаписи();
	//Запись.Период				= ТекущаяДатаСеанса();
	//Запись.Биржа 				= Операция.Аккаунт.Владелец;
	//Запись.ИнструментИД			= Операция.instId;
	//Запись.НастройкаСтратегии	= Операция.НастройкаСтратегии;
	//Запись.Аккаунт				= Операция.Аккаунт;
	//Запись.ТочкаНачалаПадения	= Операция.ТочкаНачалаПадения;
	//Запись.Событие				= Операция.Событие;	
	//Запись.Операция				= Операция;        
	//Запись.Записать(Истина);
	
	Набор = РегистрыСведений.биг_ДаблИмпактОперации.СоздатьНаборЗаписей();
	Набор.Отбор.Биржа.Установить(Операция.Аккаунт.Владелец);
	Набор.Отбор.ИнструментИД.Установить(Операция.instId);
	Набор.Отбор.НастройкаСтратегии.Установить(Операция.НастройкаСтратегии);
	Набор.Прочитать();
	
	Запись = Набор.Добавить();
	Запись.Период				= ТекущаяДатаСеанса();
	Запись.Биржа 				= Операция.Аккаунт.Владелец;
	Запись.ИнструментИД			= Операция.instId;
	Запись.НастройкаСтратегии	= Операция.НастройкаСтратегии;
	Запись.Аккаунт				= Операция.Аккаунт;
	Запись.ТочкаНачалаПадения	= Операция.ТочкаНачалаПадения;
	Запись.Событие				= Операция.Событие;	
	Запись.Операция				= Операция;
	
	Набор.Записать(Истина);
	
КонецПроцедуры

Функция ПолучитьНастройкуСтратегии(Биржа, ИнструментИД) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	биг_ИнструментыСтратегийСрезПоследних.КлючНастройки КАК КлючНастройки
	|ИЗ
	|	РегистрСведений.биг_ИнструментыСтратегий.СрезПоследних(, ) КАК биг_ИнструментыСтратегийСрезПоследних
	|ГДЕ
	|	биг_ИнструментыСтратегийСрезПоследних.Биржа = &Биржа
	|	И биг_ИнструментыСтратегийСрезПоследних.ИнструментИД = &ИнструментИД
	|	И биг_ИнструментыСтратегийСрезПоследних.Участие";
	Запрос.УстановитьПараметр("Биржа", Биржа);
	Запрос.УстановитьПараметр("ИнструментИД", ИнструментИД);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.КлючНастройки;	
	
КонецФункции

#КонецОбласти //Интеграция 


#КонецОбласти //ПрограммныйИнтерфейс


#Область СлужебныйИнтерфейс

// to do: перенести в ОМ МаркетАпи
Процедура ЗагрузитьИнформациюОСвечах() Экспорт
	
	// пропустим цикл, если предыдущее задание не завершилось
	Если биг_ОбщегоНазначения.ФоновоеЗаданиеАктивно_ПоКлючу("big_ЗагрузкаИнформацииОСвечах") Тогда
		Возврат;
	КонецЕсли;  
	
	ТекТаймСтамп			= биг_ОбщегоНазначенияКлиентСервер.ДатуВTimestampЧисло(); 
	
	ИнструментыСтратегии 	= ПолучитьВыборкуИнструментовСтратегии(Ложь);
		
	Пока ИнструментыСтратегии.Следующий() Цикл                                                          
		
		// здесь должен быть вызов модуля Маркет АПИ, что бы в зависимости от биржи пошел вызов на конкретный модуль интеграции
		//ОбработкаИнтеграции = ИнструментыСтратегии.Биржа.ИнтеграционныйМодуль;   
		//МодульИнтеграции 	= ДополнительныеОтчетыИОбработки.ОбъектВнешнейОбработки(ОбработкаИнтеграции);
		
		ТаймСтамп				= ТекТаймСтамп;
		
		// получить данные о последней свече
		ПоследняяСвеча 		= НайтиПоследнююСвечуИнструмента(ИнструментыСтратегии, ТаймСтамп);
		ТCПоследнейСвечи	= ?(ПоследняяСвеча <> Неопределено, ПоследняяСвеча.TimeStamp10, биг_ОбщегоНазначенияКлиентСервер.ДатуВTimestampЧисло(Дата(2025, 01, 01)));
		КоличествоСвечей	= 100;
		
		// вычесть её точку из текущего времени, поделить на размер бара
		ТребуетсяБар		= Цел((ТаймСтамп - ТCПоследнейСвечи) / ИнструментыСтратегии.Бар.SecondsAmount) + 1;
		ТребуетсяИтераций	= Цел(ТребуетсяБар/КоличествоСвечей);
		Если ТребуетсяИтераций > 40 Тогда
			ТребуетсяИтераций = 40;
		ИначеЕсли ТребуетсяИтераций = 0 Тогда
			ТребуетсяИтераций = 1;
		КонецЕсли;		
		
		Для Счетчик = 1 По ТребуетсяИтераций Цикл
			
			ТССтрока = биг_ОбщегоНазначенияКлиентСервер.TimeStampЧислоВСтроку(ТаймСтамп);
			
			СтруктураОперации = биг_МаркетАпиКлиентСервер.СтруктураОперации_ЗагрузитьИсториюСвечей(); 			
			СтруктураОперации.Биржа 			= ИнструментыСтратегии.Биржа;
			СтруктураОперации.ИнструментИД		= ИнструментыСтратегии.ИнструментИД;
			СтруктураОперации.Бар				= ИнструментыСтратегии.Бар;
			СтруктураОперации.КоличествоСвечей	= КоличествоСвечей;
			СтруктураОперации.ТочкаДо			= ТаймСтамп * 1000; //у ОКХ формат ТС 13 символов			
			
			биг_МаркетАпи.ЗагрузитьИсториюСвечей(СтруктураОперации);
			
			ТаймСтамп = ТаймСтамп - (ИнструментыСтратегии.Бар.SecondsAmount * КоличествоСвечей);
			
		КонецЦикла;
		
		//ПараметрRSI 	= 14;
		//ТаймСтампRSI 	= ТаймСтамп - (ИнструментыСтратегии.Бар.SecondsAmount * ПараметрRSI); 
		//
		//биг_Индикаторы.ВычислитьПоказатель(ИнструментыСтратегии.Биржа, ИнструментыСтратегии.ИнструментИД, ИнструментыСтратегии.Бар,
		//										Перечисления.биг_ВидыИндикаторов.RSI, ПараметрRSI,,, 
		//										Перечисления.биг_ИсточникиДанныхТехническихИндикаторов.ЦенаЗакрытия, ТаймСтампRSI, ТекТаймСтамп);
		//										
		//										
		//ПараметрМА		= 20;
		//ТаймСтампМА		= ТаймСтамп - (ИнструментыСтратегии.Бар.SecondsAmount * ПараметрМА);
		//биг_Индикаторы.ВычислитьПоказатель(ИнструментыСтратегии.Биржа, ИнструментыСтратегии.ИнструментИД, ИнструментыСтратегии.Бар,
		//										Перечисления.биг_ВидыИндикаторов.MA, ПараметрМА,,, 
		//										Перечисления.биг_ИсточникиДанныхТехническихИндикаторов.volCcy, ТаймСтампМА, ТекТаймСтамп); 
		//											
													
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьМассивАктивныхСигналов(ПараметрыИнструмента, ТаймСтамп, ТолькоАктуальные = Истина) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	биг_ДаблИмпактСигналы.Биржа КАК Биржа,
	|	биг_ДаблИмпактСигналы.ИнструментИД КАК ИнструментИД,
	|	биг_ДаблИмпактСигналы.Бар КАК Бар,
	|	биг_ДаблИмпактСигналы.ТочкаНачалаПадения КАК ТочкаНачалаПадения,
	|	биг_ДаблИмпактСигналы.СреднийОбъем КАК СреднийОбъем,
	|	биг_ДаблИмпактСигналы.УровеньСопротивления КАК УровеньСопротивления,
	|	биг_ДаблИмпактСигналы.ТочкаЗавершенияПадения КАК ТочкаЗавершенияПадения,
	|	биг_ДаблИмпактСигналы.ТочкаРазворота КАК ТочкаРазворота,
	|	биг_ДаблИмпактСигналы.ТочкаВхода1 КАК ТочкаВхода1,
	|	биг_ДаблИмпактСигналы.ТочкаВхода2 КАК ТочкаВхода2,
	|	биг_ДаблИмпактСигналы.ТочкаВыхода1 КАК ТочкаВыхода1,
	|	биг_ДаблИмпактСигналы.ТочкаВыхода2 КАК ТочкаВыхода2,
	|	биг_ДаблИмпактСигналы.ТекущееСобытие КАК ТекущееСобытие,
	|	биг_ДаблИмпактСигналы.ТочкаНачалаСобытия КАК ТочкаНачалаСобытия,
	|	биг_ДаблИмпактСигналы.СигналЗавершен КАК СигналЗавершен,
	|	биг_ДаблИмпактСигналы.ЗавершеноПоложительно КАК ЗавершеноПоложительно,
	|	биг_ДаблИмпактСигналы.ПричинаОтмены КАК ПричинаОтмены,
	|	биг_ДаблИмпактСигналы.ТочкаНачалаПаденияДатой КАК ТочкаНачалаПаденияДатой,
	|	биг_ДаблИмпактСигналы.ТочкаСигналЗавершен КАК ТочкаСигналЗавершен,
	|	биг_ДаблИмпактСигналы.ПаттернСигнала КАК ПаттернСигнала,
	|	биг_ДаблИмпактСигналы.КлючНастроек КАК КлючНастроек,
	|	биг_ДаблИмпактСигналы.Тренд КАК Тренд
	|ИЗ
	|	РегистрСведений.биг_ДаблИмпактСигналы КАК биг_ДаблИмпактСигналы
	|ГДЕ
	|	биг_ДаблИмпактСигналы.Биржа = &Биржа
	|	И НЕ биг_ДаблИмпактСигналы.СигналЗавершен
	|	И биг_ДаблИмпактСигналы.ИнструментИД = &ИнструментИД
	|	И биг_ДаблИмпактСигналы.Бар = &Бар
	|	И биг_ДаблИмпактСигналы.ТочкаНачалаПадения <= &ТаймСтамп
	|	И биг_ДаблИмпактСигналы.КлючНастроек = &КлючНастроек
	|	И НЕ биг_ДаблИмпактСигналы.СигналЗавершен
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТочкаНачалаПадения";
	
	Запрос.УстановитьПараметр("Биржа", 			ПараметрыИнструмента.Биржа);
	Запрос.УстановитьПараметр("ИнструментИД", 	ПараметрыИнструмента.ИнструментИД);
	Запрос.УстановитьПараметр("Бар", 			ПараметрыИнструмента.Бар);
	Запрос.УстановитьПараметр("КлючНастроек", 	ПараметрыИнструмента.КлючНастроек);
	Запрос.УстановитьПараметр("ТаймСтамп", 		ТаймСтамп);

	Если НЕ ТолькоАктуальные Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И НЕ биг_ДаблИмпактСигналы.СигналЗавершен", "");
	КонецЕсли;
	
	МассивСигналов = Новый Массив();
	
	
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Сигнал = ПолучитьСтруктуруСигнала();
			ЗаполнитьЗначенияСвойств(Сигнал, Выборка);
			МассивСигналов.Добавить(Сигнал);
		КонецЦикла;	
		
	Иначе
		
		// добавляем в массив сигналов "пустой сигнал" для анализа текущей точки
		Сигнал = ПолучитьСтруктуруСигнала();
		ЗаполнитьЗначенияСвойств(Сигнал, ПараметрыИнструмента);
		МассивСигналов.Добавить(Сигнал);
	КонецЕсли;
	
	Возврат МассивСигналов;	
		
КонецФункции

Функция ПолучитьДетальнуюИнформациюПоСигналу(Биржа, ИнструментИД, Бар, КлючНастроек, ТочкаНачалаПадения) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	биг_ДаблИмпактСигналы.Биржа КАК Биржа,
	|	биг_ДаблИмпактСигналы.ИнструментИД КАК ИнструментИД,
	|	биг_ДаблИмпактСигналы.Бар КАК Бар,
	|	биг_ДаблИмпактСигналы.КлючНастроек КАК КлючНастроек,
	|	биг_ДаблИмпактСигналы.ТочкаНачалаПадения КАК ТочкаНачалаПадения,
	|	биг_ДаблИмпактСигналы.СреднийОбъем КАК СреднийОбъем,
	|	биг_ДаблИмпактСигналы.УровеньСопротивления КАК УровеньСопротивления,
	|	биг_ДаблИмпактСигналы.ТочкаЗавершенияПадения КАК ТочкаЗавершенияПадения,
	|	биг_ДаблИмпактСигналы.ПаттернСигнала КАК ПаттернСигнала,
	|	биг_ДаблИмпактСигналы.ТочкаРазворота КАК ТочкаРазворота,
	|	биг_ДаблИмпактСигналы.ТочкаВхода1 КАК ТочкаВхода1,
	|	биг_ДаблИмпактСигналы.ТочкаВхода2 КАК ТочкаВхода2,
	|	биг_ДаблИмпактСигналы.ТочкаВыхода1 КАК ТочкаВыхода1,
	|	биг_ДаблИмпактСигналы.ТочкаВыхода2 КАК ТочкаВыхода2,
	|	биг_ДаблИмпактСигналы.ТекущееСобытие КАК ТекущееСобытие,
	|	биг_ДаблИмпактСигналы.ТочкаНачалаСобытия КАК ТочкаНачалаСобытия,
	|	биг_ДаблИмпактСигналы.ТочкаСигналЗавершен КАК ТочкаСигналЗавершен,
	|	биг_ДаблИмпактСигналы.СигналЗавершен КАК СигналЗавершен,
	|	биг_ДаблИмпактСигналы.ЗавершеноПоложительно КАК ЗавершеноПоложительно,
	|	биг_ДаблИмпактСигналы.ПричинаОтмены КАК ПричинаОтмены,
	|	биг_ДаблИмпактСигналы.ТочкаНачалаПаденияДатой КАК ТочкаНачалаПаденияДатой
	|ИЗ
	|	РегистрСведений.биг_ДаблИмпактСигналы КАК биг_ДаблИмпактСигналы
	|ГДЕ
	|	биг_ДаблИмпактСигналы.Биржа = &Биржа
	|	И биг_ДаблИмпактСигналы.ИнструментИД = &ИнструментИД
	|	И биг_ДаблИмпактСигналы.Бар = &Бар
	|	И биг_ДаблИмпактСигналы.КлючНастроек = &КлючНастроек
	|	И биг_ДаблИмпактСигналы.ТочкаНачалаПадения = &ТочкаНачалаПадения";
	
	Запрос.УстановитьПараметр("Биржа", Биржа);
	Запрос.УстановитьПараметр("ИнструментИД", ИнструментИД);
	Запрос.УстановитьПараметр("Бар", Бар);
	Запрос.УстановитьПараметр("КлючНастроек", КлючНастроек);
	Запрос.УстановитьПараметр("ТочкаНачалаПадения", ТочкаНачалаПадения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Сигнал = ПолучитьСтруктуруСигнала();
	ЗаполнитьЗначенияСвойств(Сигнал, Выборка);
	
	Возврат Сигнал;
	
КонецФункции

Функция НайтиОперациюПоСобытиюСигнала(Сигнал, Событие, Аккаунт) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	биг_ДаблИмпактОперации.Операция КАК Операция
	|ИЗ
	|	РегистрСведений.биг_ДаблИмпактОперации КАК биг_ДаблИмпактОперации
	|ГДЕ
	|	биг_ДаблИмпактОперации.Биржа = &Биржа
	|	И биг_ДаблИмпактОперации.ИнструментИД = &ИнструментИД
	|	И биг_ДаблИмпактОперации.ТочкаНачалаПадения = &ТочкаНачалаПадения
	|	И биг_ДаблИмпактОперации.Аккаунт = &Аккаунт
	|	И биг_ДаблИмпактОперации.Событие = &Событие
	|	И биг_ДаблИмпактОперации.НастройкаСтратегии = &НастройкаСтратегии";
	
	Запрос.УстановитьПараметр("Биржа", 				ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Аккаунт, "Владелец"));
	Запрос.УстановитьПараметр("ИнструментИД", 		Сигнал.ИнструментИД);
	Запрос.УстановитьПараметр("ТочкаНачалаПадения", Сигнал.ТочкаНачалаПадения);
	Запрос.УстановитьПараметр("Аккаунт", 			Аккаунт);
	Запрос.УстановитьПараметр("Событие", 			Событие);
	Запрос.УстановитьПараметр("НастройкаСтратегии",	Сигнал.КлючНастроек);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		Возврат Выборка.Операция;
	КонецЕсли;
			
КонецФункции

Функция ЭтаСтратегия() Экспорт
	
	Возврат биг_ОбщегоНазначенияКлиентСервер.ПолучитьЗначениеПоИмени("СтратегияАлгоИмпакт", Истина);
		
КонецФункции

Функция ПолучитьЦенуПоИсторическимДанным(Сигнал, Запись, ТаймСтамп) Экспорт
	
	Бар = Справочники.big_BarTypes.H1;
	
	// TODO: сделать процедуру универсальным методом через ОМ МаркетАпи, а не сразу ОКХ
	Возврат биг_ОКХ_Сервер.ПолучитьЗначенияСвечиПоТочкеСПодборомФрейма(Сигнал.ИнструментИД, ТаймСтамп, Бар);
	
КонецФункции



#КонецОбласти //СлужебныйИнтерфейс


#Область Бектест

Процедура ПровестиБекТестирование(ПараметрыИнструмента, АдресРезультата = Неопределено) Экспорт
		
	Если НЕ ПараметрыИнструмента.Свойство("ФиксироватьДлительность") Тогда
		ПараметрыИнструмента.Вставить("ПараметрыИнструмента", Ложь);	
	КонецЕсли;
	
	Если ПараметрыИнструмента.ФиксироватьДлительность Тогда
		ВремяНачала = ОценкаПроизводительности.НачатьЗамерВремени();	
	КонецЕсли;	
	
	ТочкаОтсчетаТС 		= ПараметрыИнструмента.ТочкаОтсчетаТС;
	КоличествоИтераций 	= ПараметрыИнструмента.КоличествоИтераций;
	
	// откатываем состояние инструмента
	
	ЗаписатьТочкуНаЛинииВремени(ПараметрыИнструмента.Биржа, ПараметрыИнструмента.ИнструментИД, ПараметрыИнструмента.Бар, ПараметрыИнструмента.КлючНастроек, ТочкаОтсчетаТС);
	УдалитьСигналыПослеТочки(ПараметрыИнструмента, ТочкаОтсчетаТС);	
	СтеретьЗафиксированныеОперации(ПараметрыИнструмента, ТочкаОтсчетаТС);
	
	ШагПрогресса 		= Цел(КоличествоИтераций / 100);
	СчетчикПрогресса 	= 0;
	Прогресс			= 0;
	
	Для Сч = 1 По КоличествоИтераций Цикл
		
		//ПроверитьОперацииПоАктивнымСигналам(ТочкаОтсчетаТС, Истина, ПараметрыИнструмента.КлючНастроек, ПараметрыИнструмента.ИнструментИД, ПараметрыИнструмента.Биржа);
		ОбработатьИнструмент(ПараметрыИнструмента, ТочкаОтсчетаТС, Истина);
		
		ТочкаОтсчетаТС 	= ТочкаОтсчетаТС + ПараметрыИнструмента.Бар.SecondsAmount;		
		СчетчикПрогресса = СчетчикПрогресса + 1;
		Если СчетчикПрогресса = ШагПрогресса Тогда
			Прогресс 			= Прогресс + 1;
			СчетчикПрогресса 	= 0;
			
			ДлительныеОперации.СообщитьПрогресс(Прогресс);
		КонецЕсли;
	КонецЦикла;                                                                                                                
		
	Если ПараметрыИнструмента.ФиксироватьДлительность Тогда 		
		КоличествоСигналов = ПолучитьКоличествоСигналовИнструмента(ПараметрыИнструмента);
		ОценкаПроизводительности.ЗакончитьЗамерВремени(ПараметрыИнструмента.НаименованиеЗадания, ВремяНачала, КоличествоСигналов);					
	КонецЕсли;
	
	Если АдресРезультата <> Неопределено Тогда
		УдалитьИзВременногоХранилища(АдресРезультата);
	КонецЕсли;
	
	ЗаписьРезультата = РегистрыСведений.биг_РезультатыБектестов.СоздатьМенеджерЗаписи();
	ЗаписьРезультата.Биржа			= ПараметрыИнструмента.Биржа;
	ЗаписьРезультата.ИнструментИД	= ПараметрыИнструмента.ИнструментИД;
	ЗаписьРезультата.Бар			= ПараметрыИнструмента.Бар;
	ЗаписьРезультата.КлючНастроек	= ПараметрыИнструмента.КлючНастроек; 
	ЗаписьРезультата.Выполнен		= Истина;
	ЗаписьРезультата.Записать(Истина);
	
КонецПроцедуры

Процедура УдалитьСигналыПослеТочки(ПараметрыИнструмента, ТочкаВозвратаТС)
	
	Набор	= РегистрыСведений.биг_ДаблИмпактСигналы.СоздатьНаборЗаписей();
	Набор.Отбор.Биржа.Установить(ПараметрыИнструмента.Биржа);
	Набор.Отбор.ИнструментИД.Установить(ПараметрыИнструмента.ИнструментИД);
	Набор.Отбор.Бар.Установить(ПараметрыИнструмента.Бар);
	Набор.Отбор.КлючНастроек.Установить(ПараметрыИнструмента.КлючНастроек);
	Набор.Прочитать();
	
	МассивУдалить = Новый Массив;
	
	Для каждого Строка Из Набор Цикл
		Если Строка.ТочкаНачалаПадения > ТочкаВозвратаТС Тогда
			МассивУдалить.Добавить(Строка);	
		КонецЕсли;
	КонецЦикла;                            
	
	Для каждого Строка Из МассивУдалить Цикл
		Набор.Удалить(Строка);
	КонецЦикла;
	
	Набор.Записать(Истина);
	
КонецПроцедуры

Процедура СтеретьЗафиксированныеОперации(ПараметрыИнструмента, ТочкаВозвратаТС)
	
	Набор = РегистрыСведений.биг_ДаблИмпактОперации.СоздатьНаборЗаписей();
	Набор.Отбор.Биржа.Установить(ПараметрыИнструмента.Биржа);
	Набор.Отбор.ИнструментИД.Установить(ПараметрыИнструмента.ИнструментИД);
	Набор.Отбор.НастройкаСтратегии.Установить(ПараметрыИнструмента.КлючНастроек);
	
	Набор.Прочитать();
	
	МассивУдалить = Новый Массив();
	
	Для каждого Строка Из Набор Цикл
		Если Строка.ТочкаНачалаПадения > ТочкаВозвратаТС Тогда
			
			Операция = Строка.Операция;
			КлючНастройкиОперации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Операция, "НастройкаСтратегии");
			
			Если КлючНастройкиОперации = ПараметрыИнструмента.КлючНастроек Тогда
				МассивУдалить.Добавить(Строка);	
			КонецЕсли;				
		КонецЕсли;	
	КонецЦикла;                      
	
	Для каждого СтрокаНабора Из МассивУдалить Цикл
		ДокументОбъект = СтрокаНабора.Операция.ПолучитьОбъект();
		ДокументОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		
		УдалитьИсториюЗначенийДокумента(СтрокаНабора.Операция, ТочкаВозвратаТС);
		
		ДокументОбъект.Удалить();
		
		Набор.Удалить(СтрокаНабора);
	КонецЦикла;
	
	Набор.Записать(Истина);
	
КонецПроцедуры 

Процедура УдалитьИсториюЗначенийДокумента(Операция, ТочкаВозвратаТС)
	
	ТочкаПроверки = биг_ОбщегоНазначенияКлиентСервер.TimestampВДату(ТочкаВозвратаТС);
	Если ТипЗнч(Операция) = Тип("ДокументСсылка.big_AlgoOrders_OKX") Тогда
		
		Набор = РегистрыСведений.биг_ОКХ_ИсторияАлгоОрдеров.СоздатьНаборЗаписей();
		Набор.Отбор.Документ.Установить(Операция);
		Набор.Прочитать();
		
		МассивУдалить = Новый Массив;
		
		Для каждого Строка Из Набор Цикл
			Если Строка.Период > ТочкаПроверки Тогда
				МассивУдалить.Добавить(Строка);	
			КонецЕсли;
		КонецЦикла;                            
		
		Для каждого Строка Из МассивУдалить Цикл
			Набор.Удалить(Строка);
		КонецЦикла;
		
		Набор.Записать(Истина);
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти //Бектест 


#Область АнализСигнала


#Область КлючевыеШаги

Процедура ВыполнениеСигнала(Сигнал, КлючНастроек, ТаймСтамп, ШагВыполнен);
		
	Если Сигнал.ТекущееСобытие = Неопределено Тогда		
		ВыявитьЭкстремум(Сигнал, КлючНастроек, ТаймСтамп, ШагВыполнен);		
	Иначе		
		ПровестиАнализПозиции(Сигнал, КлючНастроек, ТаймСтамп, ШагВыполнен);		
	КонецЕсли;
	  
	Если Сигнал.ТекущееСобытие = Перечисления.биг_ДаблИмпактEvents.АИ_ОжиданиеРазворотаТренда Тогда		
		ОпределитьРазворот(Сигнал, КлючНастроек, ТаймСтамп, ШагВыполнен);		 
	КонецЕсли;	
	 
	Если Сигнал.ТекущееСобытие = Перечисления.биг_ДаблИмпактEvents.АИ_ОжиданиеУвеличенияПозиции Тогда		
		ОпределитьПереходОбласти(Сигнал, КлючНастроек, ТаймСтамп, ШагВыполнен);		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ВыявитьЭкстремум(Сигнал, КлючНастроек, ТаймСтамп, ШагВыполнен) 
		
	ТекСвеча = ПолучитьПоследнююСвечуСИндикаторами(Сигнал, КлючНастроек, ТаймСтамп);
	Если ТекСвеча = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекСвеча.Чайкин_МА = 0 Тогда
		// если медиана нулевая, то лучше пропустить свечу	
		Возврат;
	КонецЕсли;  
	
	ВыявленЭкстремум = Ложь;
	
	Если ТекСвеча.Чайкин > 0 Тогда
		ВыявленЭкстремум = ТекСвеча.Чайкин > ТекСвеча.Чайкин_ТВМакс;
	Иначе
		ВыявленЭкстремум = ТекСвеча.Чайкин < ТекСвеча.Чайкин_ТВМин;
	КонецЕсли;
	    
	Если ВыявленЭкстремум Тогда
		Сигнал.Тренд = ?(ТекСвеча.Чайкин > 0, Перечисления.биг_ВидыТрендов.Нисходящий, Перечисления.биг_ВидыТрендов.Восходящий); //фиксируем не текущий тренд, а ожидаемый
		ЗафиксироватьТочкуЭкстремума(Сигнал, ТаймСтамп, КлючНастроек);		
	КонецЕсли;
			
	ШагВыполнен = Истина;	
	
КонецПроцедуры

Процедура ПровестиАнализПозиции(Сигнал, КлючНастроек, ТаймСтамп, ШагВыполнен)
	
	Если ЗначениеЗаполнено(Сигнал.ТочкаВхода1) Тогда
		
		// Позиция есть, Рассчитать уровень стоп-лосс по текущим данным	
		ТекСвеча = ПолучитьПоследнююСвечуСИндикаторами(Сигнал, КлючНастроек, ТаймСтамп);
		Если ТекСвеча = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ОбновитьУровеньСтопЛосс(Сигнал, КлючНастроек, ТаймСтамп, ТекСвеча, ШагВыполнен);		
	КонецЕсли;

КонецПроцедуры

Процедура ОпределитьРазворот(Сигнал, КлючНастроек, ТаймСтамп, ШагВыполнен)
	
	ТекСвеча = ПолучитьПоследнююСвечуСИндикаторами(Сигнал, КлючНастроек, ТаймСтамп);
	Если ТекСвеча = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПорогRSIВерх 	= 55;
	ПорогRSIНиз		= 45;
	
	Если Сигнал.Тренд = Перечисления.биг_ВидыТрендов.Нисходящий Тогда
		
		//ТекСвеча.ЦенаЗакрытия < ТекСвеча.Цена_МА_Короткий
		Если ТекСвеча.Чайкин < ТекСвеча.Чайкин_СМА И ТекСвеча.РСИ >= ПорогRSIВерх Тогда
			
			// Есть условия, где мы ждем разворот
			ЗафиксироватьТочкуВходаОдин(Сигнал, ТаймСтамп, ТекСвеча, ШагВыполнен);
			
		ИначеЕсли ТекСвеча.Чайкин < ТекСвеча.Чайкин_СМА И ТекСвеча.РСИ < ПорогRSIВерх Тогда
			
			// Есть условия, где пора прервать сигнал
			ПричинаОтказа = "Ожидаемый тренд = " + Сигнал.Тренд + ". Чайкин развернулся, но ";
			ПричинаОтказа = ПричинаОтказа + ?(ТекСвеча.РСИ < ПорогRSIВерх, "значение RSI < " + ПорогRSIВерх + ". RSI = " + ТекСвеча.РСИ + " ", "");
			
			ПрерватьОбработкуТекущегоСигнала(Сигнал, ПричинаОтказа, ТаймСтамп);
		КонецЕсли;
		
	ИначеЕсли Сигнал.Тренд = Перечисления.биг_ВидыТрендов.Восходящий Тогда
		
		//ТекСвеча.ЦенаЗакрытия > ТекСвеча.Цена_МА_Короткий
		Если ТекСвеча.Чайкин > ТекСвеча.Чайкин_СМА И ТекСвеча.РСИ <= ПорогRSIНиз Тогда
			
			// Есть условия, где мы ждем разворот
			ЗафиксироватьТочкуВходаОдин(Сигнал, ТаймСтамп, ТекСвеча, ШагВыполнен);	
			
		ИначеЕсли ТекСвеча.Чайкин > ТекСвеча.Чайкин_СМА И ТекСвеча.РСИ > ПорогRSIНиз Тогда
			
			// Есть условия, где пора прервать сигнал
			ПричинаОтказа = "Ожидаемый тренд = " + Сигнал.Тренд + ". Чайкин развернулся, но ";
			ПричинаОтказа = ПричинаОтказа + ?(ТекСвеча.РСИ > ПорогRSIНиз, "значение RSI > " + ПорогRSIНиз + ". RSI = " + ТекСвеча.РСИ + " ", "");
			
			ПрерватьОбработкуТекущегоСигнала(Сигнал, ПричинаОтказа, ТаймСтамп);
		КонецЕсли;
	КонецЕсли;          
		
	ШагВыполнен = Истина;

КонецПроцедуры

Процедура ОпределитьПереходОбласти(Сигнал, КлючНастроек, ТаймСтамп, ШагВыполнен)

	ТекСвеча = ПолучитьПоследнююСвечуСИндикаторами(Сигнал, КлючНастроек, ТаймСтамп);
	Если ТекСвеча = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Сигнал.Тренд = Перечисления.биг_ВидыТрендов.Восходящий И ТекСвеча.Чайкин > 0 Тогда
		
		УвеличитьПозицию(Сигнал, ТекСвеча, ТаймСтамп, КлючНастроек, ШагВыполнен);
		Если ШагВыполнен Тогда
			ПерейтиКМониторингуПозиции(Сигнал, КлючНастроек, ТаймСтамп);	
		КонецЕсли;		
	ИначеЕсли Сигнал.Тренд = Перечисления.биг_ВидыТрендов.Нисходящий И ТекСвеча.Чайкин < 0 Тогда
		
		УвеличитьПозицию(Сигнал, ТекСвеча, ТаймСтамп, КлючНастроек, ШагВыполнен);
		Если ШагВыполнен Тогда
			ПерейтиКМониторингуПозиции(Сигнал, КлючНастроек, ТаймСтамп);	
		КонецЕсли;		
	КонецЕсли;
	
	ШагВыполнен = Истина;
	
КонецПроцедуры

#КонецОбласти //КлючевыеШаги


#Область РаботаССигналом

Процедура ЗафиксироватьТочкуЭкстремума(Сигнал, ТочкаНачалаПадения, КлючНастроек)

	Запись = РегистрыСведений.биг_ДаблИмпактСигналы.СоздатьМенеджерЗаписи();
	Запись.Биржа 					= Сигнал.Биржа;
	Запись.ИнструментИД				= Сигнал.ИнструментИД;
	Запись.Бар						= Сигнал.Бар;
	Запись.КлючНастроек				= КлючНастроек;
	Запись.ТочкаНачалаПадения 		= ТочкаНачалаПадения;
	Запись.ТочкаНачалаПаденияДатой	= биг_ОбщегоНазначенияКлиентСервер.TimestampВДату(ТочкаНачалаПадения);
	Запись.ТекущееСобытие			= Перечисления.биг_ДаблИмпактEvents.АИ_ОжиданиеРазворотаТренда; 
	Запись.ТочкаНачалаСобытия		= ТочкаНачалаПадения;
	Запись.Тренд					= Сигнал.Тренд;
	Запись.Записать(Истина);
	
	биг_ПодсистемаОповещений.ВнутреннееОповещениеПоЗаписиСигнала(Сигнал, Запись);
		
КонецПроцедуры

Процедура ЗафиксироватьТочкуВходаОдин(Сигнал, Таймстамп, ТекСвеча, ШагВыполнен)
	
	// проверка есть ли открытые ордера (позиции?) у текущего инструмента
	//		если есть - то прервать текущий сигнал
	//		если нет - фиксируем точку входа, размещаем ордера
	Если ТекущийИнструментИмеетОткрытыеОрдера(Сигнал) Тогда
		
		ПричинаОтмены = "По данному инструменту уже есть открытая позиция";
		ПрерватьОбработкуТекущегоСигнала(Сигнал, ПричинаОтмены, Таймстамп);		
	Иначе
		
		РазместитьОрдераДляТочкиВходаОдин(Сигнал, ТекСвеча, Таймстамп, ШагВыполнен);
		
		Если ШагВыполнен Тогда		
			Запись = ПолучитьЗаписьСобытийСигнала(Сигнал);
			Запись.ТочкаВхода1			= Таймстамп;
			Запись.ТекущееСобытие		= Перечисления.биг_ДаблИмпактEvents.АИ_ОжиданиеУвеличенияПозиции; 
			Запись.ТочкаНачалаСобытия	= Таймстамп + 1;
			Запись.Записать(Истина);
			
			биг_ПодсистемаОповещений.ВнутреннееОповещениеПоЗаписиСигнала(Сигнал, Запись);
			биг_ПодсистемаОповещений.ПубличноеОповещениеПоЗаписиСигнала(Сигнал, Запись);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПерейтиКМониторингуПозиции(Сигнал, КлючНастроек, ТаймСтамп)
	
	Запись = ПолучитьЗаписьСобытийСигнала(Сигнал);
	Запись.ТекущееСобытие		= Перечисления.биг_ДаблИмпактEvents.АИ_МониторингПозиции; 
	Запись.ТочкаНачалаСобытия	= Таймстамп + 1;
	Запись.Записать(Истина);	
	
	биг_ПодсистемаОповещений.ВнутреннееОповещениеПоЗаписиСигнала(Сигнал, Запись);
	биг_ПодсистемаОповещений.ПубличноеОповещениеПоЗаписиСигнала(Сигнал, Запись);
КонецПроцедуры

Процедура ПрерватьОбработкуТекущегоСигнала(Сигнал, ПричинаОтмены, ТочкаОтмены)
		
	Запись = ПолучитьЗаписьСобытийСигнала(Сигнал);
	 
	Запись.ТочкаСигналЗавершен	= ТочкаОтмены;
	Запись.СигналЗавершен 		= Истина;
	Запись.ПричинаОтмены		= ПричинаОтмены;
	Запись.Записать(Истина);		
	
	биг_ПодсистемаОповещений.ВнутреннееОповещениеПоЗаписиСигнала(Сигнал, Запись);
	
КонецПроцедуры

Процедура ЗавершитьСигналУспешно(Сигнал, ТочкаЗавершения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	биг_ДаблИмпактСигналы.Биржа КАК Биржа,
	|	биг_ДаблИмпактСигналы.ИнструментИД КАК ИнструментИД,
	|	биг_ДаблИмпактСигналы.Бар КАК Бар,
	|	биг_ДаблИмпактСигналы.КлючНастроек КАК КлючНастроек,
	|	биг_ДаблИмпактСигналы.ТочкаНачалаПадения КАК ТочкаНачалаПадения,
	|	биг_ДаблИмпактСигналы.УровеньСопротивления КАК УровеньСопротивления,
	|	биг_ДаблИмпактСигналы.ТочкаЗавершенияПадения КАК ТочкаЗавершенияПадения,
	|	биг_ДаблИмпактСигналы.ПаттернСигнала КАК ПаттернСигнала,
	|	биг_ДаблИмпактСигналы.ТочкаРазворота КАК ТочкаРазворота,
	|	биг_ДаблИмпактСигналы.ТочкаВхода1 КАК ТочкаВхода1,
	|	биг_ДаблИмпактСигналы.ТочкаВхода2 КАК ТочкаВхода2,
	|	биг_ДаблИмпактСигналы.ТочкаВыхода1 КАК ТочкаВыхода1,
	|	биг_ДаблИмпактСигналы.ТочкаВыхода2 КАК ТочкаВыхода2,
	|	биг_ДаблИмпактСигналы.ТекущееСобытие КАК ТекущееСобытие,
	|	биг_ДаблИмпактСигналы.ТочкаНачалаСобытия КАК ТочкаНачалаСобытия,
	|	биг_ДаблИмпактСигналы.ТочкаСигналЗавершен КАК ТочкаСигналЗавершен,
	|	биг_ДаблИмпактСигналы.СигналЗавершен КАК СигналЗавершен,
	|	биг_ДаблИмпактСигналы.ЗавершеноПоложительно КАК ЗавершеноПоложительно,
	|	биг_ДаблИмпактСигналы.ПричинаОтмены КАК ПричинаОтмены,
	|	биг_ДаблИмпактСигналы.ТочкаНачалаПаденияДатой КАК ТочкаНачалаПаденияДатой
	|ИЗ
	|	РегистрСведений.биг_ДаблИмпактСигналы КАК биг_ДаблИмпактСигналы
	|ГДЕ
	|	биг_ДаблИмпактСигналы.Биржа = &Биржа
	|	И биг_ДаблИмпактСигналы.ИнструментИД = &ИнструментИД
	|	И биг_ДаблИмпактСигналы.ТочкаНачалаПадения = &ТочкаНачалаПадения
	|	И биг_ДаблИмпактСигналы.КлючНастроек = &КлючНастроек";
	Запрос.УстановитьПараметр("Биржа", 				Сигнал.Биржа);
	Запрос.УстановитьПараметр("ИнструментИД", 		Сигнал.ИнструментИД);
	Запрос.УстановитьПараметр("ТочкаНачалаПадения", Сигнал.ТочкаНачалаПадения);
	Запрос.УстановитьПараметр("КлючНастроек", 		Сигнал.КлючНастроек);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	                    
	Запись = РегистрыСведений.биг_ДаблИмпактСигналы.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(Запись, Выборка);
	Запись.Прочитать();
	 
	Запись.ТочкаСигналЗавершен		= ТочкаЗавершения;
	Запись.СигналЗавершен 			= Истина;
	Запись.ЗавершеноПоложительно	= Истина;
	Запись.Записать(Истина);
	
КонецПроцедуры

Процедура ЗавершитьСигналОтрицательно(Сигнал, ПричинаОтмены, ТочкаЗавершения)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	биг_ДаблИмпактСигналы.Биржа КАК Биржа,
	|	биг_ДаблИмпактСигналы.ИнструментИД КАК ИнструментИД,
	|	биг_ДаблИмпактСигналы.Бар КАК Бар,
	|	биг_ДаблИмпактСигналы.КлючНастроек КАК КлючНастроек,
	|	биг_ДаблИмпактСигналы.ТочкаНачалаПадения КАК ТочкаНачалаПадения,
	|	биг_ДаблИмпактСигналы.УровеньСопротивления КАК УровеньСопротивления,
	|	биг_ДаблИмпактСигналы.ТочкаЗавершенияПадения КАК ТочкаЗавершенияПадения,
	|	биг_ДаблИмпактСигналы.ПаттернСигнала КАК ПаттернСигнала,
	|	биг_ДаблИмпактСигналы.ТочкаРазворота КАК ТочкаРазворота,
	|	биг_ДаблИмпактСигналы.ТочкаВхода1 КАК ТочкаВхода1,
	|	биг_ДаблИмпактСигналы.ТочкаВхода2 КАК ТочкаВхода2,
	|	биг_ДаблИмпактСигналы.ТочкаВыхода1 КАК ТочкаВыхода1,
	|	биг_ДаблИмпактСигналы.ТочкаВыхода2 КАК ТочкаВыхода2,
	|	биг_ДаблИмпактСигналы.ТекущееСобытие КАК ТекущееСобытие,
	|	биг_ДаблИмпактСигналы.ТочкаНачалаСобытия КАК ТочкаНачалаСобытия,
	|	биг_ДаблИмпактСигналы.ТочкаСигналЗавершен КАК ТочкаСигналЗавершен,
	|	биг_ДаблИмпактСигналы.СигналЗавершен КАК СигналЗавершен,
	|	биг_ДаблИмпактСигналы.ЗавершеноПоложительно КАК ЗавершеноПоложительно,
	|	биг_ДаблИмпактСигналы.ПричинаОтмены КАК ПричинаОтмены,
	|	биг_ДаблИмпактСигналы.ТочкаНачалаПаденияДатой КАК ТочкаНачалаПаденияДатой
	|ИЗ
	|	РегистрСведений.биг_ДаблИмпактСигналы КАК биг_ДаблИмпактСигналы
	|ГДЕ
	|	биг_ДаблИмпактСигналы.Биржа = &Биржа
	|	И биг_ДаблИмпактСигналы.ИнструментИД = &ИнструментИД
	|	И биг_ДаблИмпактСигналы.ТочкаНачалаПадения = &ТочкаНачалаПадения
	|	И биг_ДаблИмпактСигналы.КлючНастроек = &КлючНастроек";
	Запрос.УстановитьПараметр("Биржа", 				Сигнал.Биржа);
	Запрос.УстановитьПараметр("ИнструментИД", 		Сигнал.ИнструментИД);
	Запрос.УстановитьПараметр("ТочкаНачалаПадения", Сигнал.ТочкаНачалаПадения);
	Запрос.УстановитьПараметр("КлючНастроек", 		Сигнал.КлючНастроек);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	                    
	Запись = РегистрыСведений.биг_ДаблИмпактСигналы.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(Запись, Выборка);
	Запись.Прочитать();
	 
	Запись.ТочкаСигналЗавершен		= ТочкаЗавершения;
	Запись.СигналЗавершен 			= Истина;
	Запись.ЗавершеноПоложительно	= Ложь;
	Запись.ПричинаОтмены			= ПричинаОтмены;
	Запись.Записать(Истина);
	
КонецПроцедуры

#КонецОбласти //РаботаССигналом


#КонецОбласти //АнализСигнала


#Область УправлениеОперациями

Процедура РазместитьОрдераДляТочкиВходаОдин(Сигнал, ТекСвеча, ТаймСтамп, ШагВыполнен)
	
	// расчет цен и контрольных уровней 
	ПроцентДепозитаНаВход 	= ПолучитьЗначениеПараметраСтратегии("АИ_2_ВходОдин_ПроцентДепозита", Сигнал.КлючНастроек);
			
	Инструмент				= Справочники.big_Instruments.НайтиПоРеквизиту("instId", Сигнал.ИнструментИД,, Сигнал.Биржа);
	Кратность 				= биг_ОбщегоНазначенияКлиентСервер.ЗначениеРеквизитаОбъекта(Инструмент, "lotSz");
	
	// собираем все аккаунты, подключенные к этому инструменту текущей биржи
	ТаблицаУчастников 		= СобратьАккаунтыДляРеакцииНаСигнал(Сигнал);
	
	Для каждого Запись Из ТаблицаУчастников Цикл
		
		ТриггерСтопЛос	= ОпределитьУровеньСтопЛосс(Сигнал, ТекСвеча, Запись, ТаймСтамп);
		Аккаунт 		= Запись.Участник;
		
		// для каждого аккаунта определяем сумму операции		
		РазмерОрдера	= РассчитатьОриентировочнуюСуммуОперацииВВалютеОперации(Сигнал, Запись, ПроцентДепозитаНаВход, ТаймСтамп);				 
		РазмерОрдера	= биг_ОКХ_Сервер.ПересчитатьВКонтракты(РазмерОрдера, Инструмент);		
		РазмерОрдера 	= биг_ОбщегоНазначенияКлиентСервер.ОкруглитьКратно(РазмерОрдера, Кратность);
		
		Если ШагВыполнен Тогда
			АктуализироватьНастройкиИнструментаНаАккаунте(Сигнал.ИнструментИД, Аккаунт, Сигнал.КлючНастроек, ШагВыполнен);	
		КонецЕсли;
		
		Если ШагВыполнен Тогда
			ТочкаВхода_РазместитьМаркетОрдер(Сигнал, Аккаунт, РазмерОрдера, Перечисления.биг_ДаблИмпактEvents.ПоискТочкиВходаОдин, ТриггерСтопЛос, ТаймСтамп, ШагВыполнен);	
		КонецЕсли;			
	КонецЦикла;
	
КонецПроцедуры

Процедура УвеличитьПозицию(Сигнал, ТекСвеча, ТаймСтамп, КлючНастроек, ШагВыполнен)

	// расчет цен и контрольных уровней 
	ПроцентДепозитаНаВход 	= ПолучитьЗначениеПараметраСтратегии("АИ_3_ВходаДва_ПроцентДепозита", КлючНастроек);
	
	Инструмент				= Справочники.big_Instruments.НайтиПоРеквизиту("instId", Сигнал.ИнструментИД,, Сигнал.Биржа);
	Кратность 				= биг_ОбщегоНазначенияКлиентСервер.ЗначениеРеквизитаОбъекта(Инструмент, "lotSz");
	
	// собираем все аккаунты, подключенные к этому инструменту текущей биржи
	ТаблицаУчастников = СобратьАккаунтыДляРеакцииНаСигнал(Сигнал);
	
	Для каждого Запись Из ТаблицаУчастников Цикл
		
		Аккаунт 		= Запись.Участник;
		ТриггерСтопЛос	= ОпределитьУровеньСтопЛосс(Сигнал, ТекСвеча, Запись, ТаймСтамп);
			
		// для каждого аккаунта определяем сумму операции
		РазмерОрдера	= РассчитатьОриентировочнуюСуммуОперацииВВалютеОперации(Сигнал, Запись, ПроцентДепозитаНаВход, ТаймСтамп);		
		РазмерОрдера	= биг_ОКХ_Сервер.ПересчитатьВКонтракты(РазмерОрдера, Инструмент);		
		РазмерОрдера 	= биг_ОбщегоНазначенияКлиентСервер.ОкруглитьКратно(РазмерОрдера, Кратность);
		
		АктуализироватьНастройкиИнструментаНаАккаунте(Сигнал.ИнструментИД, Запись.Участник, КлючНастроек, ШагВыполнен);
		ТочкаВхода_РазместитьМаркетОрдер(Сигнал, Аккаунт, РазмерОрдера, Перечисления.биг_ДаблИмпактEvents.ПоискТочкиВходаДва, ТриггерСтопЛос, ТаймСтамп, ШагВыполнен);
	КонецЦикла;                                                                                                          		
	
КонецПроцедуры

Процедура ТочкаВхода_РазместитьМаркетОрдер(Сигнал, Аккаунт, РазмерОрдера, Событие, ТриггерСтопЛос = Неопределено, ТаймСтамп, ШагВыполнен) 

	СтруктураОперации = биг_МаркетАпиКлиентСервер.СтруктураОперации_СоздатьОрдер();
	СтруктураОперации.Биржа 			= Сигнал.Биржа;
	СтруктураОперации.Аккаунт 			= Аккаунт;
	СтруктураОперации.Стратегия			= ЭтаСтратегия();
	СтруктураОперации.КлючНастроек		= Сигнал.КлючНастроек;
	СтруктураОперации.Событие			= Событие;
	СтруктураОперации.ИнструментИД		= Сигнал.ИнструментИД;
	СтруктураОперации.РазмерОрдера  	= РазмерОрдера; 
	СтруктураОперации.Сигнал			= Сигнал.ТочкаНачалаПадения;
	
	Если Сигнал.Тренд = Перечисления.биг_ВидыТрендов.Восходящий Тогда
		СтруктураОперации.ОрдерСторона 	= Перечисления.big_OKX_OrderSides.buy;
		
	ИначеЕсли Сигнал.Тренд = Перечисления.биг_ВидыТрендов.Нисходящий Тогда
		СтруктураОперации.ОрдерСторона 	= Перечисления.big_OKX_OrderSides.sell;	
	КонецЕсли;
	
	СтруктураОперации.ОрдерТип			= Перечисления.big_OKX_OrderTypes.market;	
	СтруктураОперации.ИнструментТип		= Перечисления.big_OKX_InstrumentType.SWAP;
	
	Если ТриггерСтопЛос <> Неопределено Тогда
		
		УровеньСтопЛосс		= -1; // ордер будет продан по текущей рыночной цене "market"		
		СтруктураАлгоОрдера = биг_МаркетАпиКлиентСервер.СтруктураОперации_СоздатьАлгоОрдер();
		
		ЗаполнитьЗначенияСвойств(СтруктураАлгоОрдера, СтруктураОперации); //биржа, аккаунт, стратегия, событие, ИнструментИД
		СтруктураАлгоОрдера.ТриггерСтопЛос 	= ТриггерСтопЛос;
		СтруктураАлгоОрдера.ЦенаСтопЛос 	= УровеньСтопЛосс;
		
		Если Сигнал.Тренд = Перечисления.биг_ВидыТрендов.Нисходящий Тогда
			// ШОРТ
			СтруктураАлгоОрдера.НаправлениеДействия = Перечисления.big_OKX_OrderSides.buy;
			СтруктураАлгоОрдера.СторонаПозиции		= Перечисления.big_OKX_PositionSides.long;
		ИначеЕсли Сигнал.Тренд = Перечисления.биг_ВидыТрендов.Восходящий Тогда
			// ЛОНГ
			СтруктураАлгоОрдера.НаправлениеДействия = Перечисления.big_OKX_OrderSides.sell;
			СтруктураАлгоОрдера.СторонаПозиции		= Перечисления.big_OKX_PositionSides.short;
		КонецЕсли;
		
		СтруктураОперации.МассивСвязанныхАлгоОрдеров.Добавить(СтруктураАлгоОрдера);
	КонецЕсли;                                                                                                                                                                                                                                                                                         
	
	Попытка
		ШагВыполнен = биг_МаркетАпи.СоздатьОрдер(Неопределено, СтруктураОперации, Сигнал.Бектест, ТаймСтамп);	
	Исключение
	    ШагВыполнен = Ложь;
	КонецПопытки;
		
	Если НЕ ШагВыполнен Тогда                                                        
		ТекстСообщения = "!!! При размещении ордера произошла ошибка (см. логи интеграции). Время: " + ТекущаяДатаСеанса();
		биг_ПодсистемаОповещений.ВнутреннееОповещение_Произвольное(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьУровеньСтопЛосс(Сигнал, КлючНастроек, ТаймСтамп, ТекСвеча, ШагВыполнен)
	
	ТаблицаУчастников = СобратьАккаунтыДляРеакцииНаСигнал(Сигнал);
	
	Для каждого Запись Из ТаблицаУчастников Цикл
		
		ТриггерСтопЛос		= ОпределитьУровеньСтопЛосс(Сигнал, ТекСвеча, Запись, ТаймСтамп);
		Аккаунт 			= Запись.Участник;
		МассивАлгоОрдеров	= НайтиСтопЛос(Сигнал, Аккаунт);
		
		Для каждого Алгоордер Из МассивАлгоОрдеров Цикл
			Если АлгоОрдер.slTriggerPx <> ТриггерСтопЛос Тогда
				ИзменитьСтопЛосс(Аккаунт, АлгоОрдер, ТриггерСтопЛос, Сигнал, ТаймСтамп, ШагВыполнен);	
			КонецЕсли;			
		КонецЦикла;		
	КонецЦикла;
	
КонецПроцедуры

Процедура ИзменитьСтопЛосс(Аккаунт, АлгоОрдер, НовыйТриггер, Сигнал, ТаймСтамп, ШагВыполнен)
		
	СтруктураОперации = биг_МаркетАпиКлиентСервер.СтруктураОперации_ИзменитьАлгоОрдер();                
	СтруктураОперации.Аккаунт 				= Аккаунт;
	СтруктураОперации.ИнструментИД          = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(АлгоОрдер, "instId");
	СтруктураОперации.КлиентАлгоОрдерИД 	= биг_ОКХ_КлиентСервер.КлиентскийИдентификатор(АлгоОрдер);
	СтруктураОперации.НовыйТриггерСтопЛос	= НовыйТриггер;
	СтруктураОперации.НовыйЦенаСтопЛос		= -1;
	
	Попытка
		ШагВыполнен = биг_МаркетАпи.ИзменитьАлгоОрдер(СтруктураОперации, Сигнал.Бектест, ТаймСтамп);	
	Исключение
	    ШагВыполнен = Ложь;
	КонецПопытки;
	
	Если ШагВыполнен Тогда
		биг_ПодсистемаОповещений.ВнутреннееОповещениеИзменениеУровняСтопЛосс(Сигнал, СтруктураОперации);
		биг_ПодсистемаОповещений.ПубличноеОповещениеИзменениеУровняСтопЛосс(Сигнал, СтруктураОперации);
	Иначе
		ТекстСообщения = "!!! При размещении ордера произошла ошибка (см. логи интеграции). Время: " + ТекущаяДатаСеанса();
		биг_ПодсистемаОповещений.ВнутреннееОповещение_Произвольное(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьВыборкуИнструментовСтратегии(Участие = Истина)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	биг_ИнструментыСтратегийСрезПоследних.Биржа КАК Биржа,
	|	биг_ИнструментыСтратегийСрезПоследних.ИнструментИД КАК ИнструментИД,
	|	биг_ИнструментыСтратегийСрезПоследних.Бар КАК Бар,
	|	биг_ИнструментыСтратегийСрезПоследних.КлючНастройки КАК КлючНастроек
	|ИЗ
	|	РегистрСведений.биг_ИнструментыСтратегий.СрезПоследних(, Стратегия = &Стратегия) КАК биг_ИнструментыСтратегийСрезПоследних
	|ГДЕ
	|	(биг_ИнструментыСтратегийСрезПоследних.Участие = &Участие
	|			ИЛИ &НеИспользоватьФильтр)";
	
	Запрос.УстановитьПараметр("Участие", 				Участие);
	Запрос.УстановитьПараметр("Стратегия", 				ЭтаСтратегия());
	Запрос.УстановитьПараметр("НеИспользоватьФильтр", 	НЕ Участие);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат Выборка;
		
КонецФункции

Функция ПолучитьСтруктуруСигнала()

	Сигнал = Новый Структура;
	Сигнал.Вставить("Биржа", 						Неопределено);
	Сигнал.Вставить("ИнструментИД", 				Неопределено);
	Сигнал.Вставить("Бар", 							Неопределено);
	Сигнал.Вставить("ТочкаНачалаПадения", 			Неопределено);
	Сигнал.Вставить("УровеньСопротивления", 		Неопределено);	
	Сигнал.Вставить("ТочкаЗавершенияПадения", 		Неопределено);
	Сигнал.Вставить("ТочкаРазворота", 				Неопределено);
	Сигнал.Вставить("ТочкаВхода1", 					Неопределено);
	Сигнал.Вставить("ТочкаВхода2", 					Неопределено);
	Сигнал.Вставить("ТочкаВыхода1", 				Неопределено);
	Сигнал.Вставить("ТочкаВыхода2", 				Неопределено);
	Сигнал.Вставить("ТекущееСобытие", 				Неопределено);
	Сигнал.Вставить("ТочкаНачалаСобытия", 			Неопределено);
	Сигнал.Вставить("СигналЗавершен", 				Неопределено);
	Сигнал.Вставить("ЗавершеноПоложительно",		Неопределено);
	Сигнал.Вставить("ПричинаОтмены", 				Неопределено);
	Сигнал.Вставить("ТочкаНачалаПаденияДатой",		Неопределено);
	Сигнал.Вставить("ТочкаСигналЗавершен",			Неопределено);
	Сигнал.Вставить("ПаттернСигнала",				Неопределено);
	Сигнал.Вставить("Бектест",						Неопределено);
	Сигнал.Вставить("КлючНастроек",					Неопределено);
	Сигнал.Вставить("Тренд",						Неопределено);
	
	Возврат Сигнал;
	
КонецФункции

Функция ПолучитьЗаписьСобытийСигнала(Сигнал)
	
	Запись = РегистрыСведений.биг_ДаблИмпактСигналы.СоздатьМенеджерЗаписи();
	Запись.Биржа 					= Сигнал.Биржа;
	Запись.ИнструментИД				= Сигнал.ИнструментИД;
	Запись.Бар						= Сигнал.Бар;
	Запись.КлючНастроек				= Сигнал.КлючНастроек;
	Запись.ТочкаНачалаПадения 		= Сигнал.ТочкаНачалаПадения;
	Запись.Прочитать();
	
	Возврат Запись;
	
КонецФункции

#КонецОбласти


#Область ВспомогательныеПроцедурыФункции

Функция ПолучитьПоследнююСвечуСИндикаторами(Сигнал, КлючНастроек, ТаймСтамп)
	                           
	ПараметрыЗапроса 	= биг_ОбщегоНазначения.ПолучитьСтруктуруПараметровЗапросаДанныхПоСвечам();
	ЗаполнитьЗначенияСвойств(ПараметрыЗапроса, Сигнал); 
	
	РазмерБара = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сигнал.Бар, "SecondsAmount");
	
	ПараметрыЗапроса.СортировкаПоУбыванию				= Истина;
	ПараметрыЗапроса.КоличествоСвечей					= 1;
	ПараметрыЗапроса.ТочкаВремениТС_ЗавершениеПериода 	= биг_ОбщегоНазначения.НачалоПериодаПоБару(ТаймСтамп, Сигнал.Бар) - РазмерБара;
	ПараметрыЗапроса.ТочкаВремениТС_НачалоПериода 		= ПараметрыЗапроса.ТочкаВремениТС_ЗавершениеПериода; //ПараметрыЗапроса.ТочкаВремениТС_ЗавершениеПериода - (РазмерБара * ПараметрыЗапроса.КоличествоСвечей) + 1;
	ПараметрыЗапроса.ОграничениеПериода			       	= ТаймСтамп;
		
	ЗадачиРасчета 		= биг_УправлениеИндикаторамиСервер.ЗадачиРасчетаДляАлгоИмпакт(КлючНастроек);
	МассивСОднойСвечой  = биг_ОбщегоНазначения.ПолучитьДанныеСвечейПоТочкеСИндикаторами(ПараметрыЗапроса, ЗадачиРасчета);
	
	Если МассивСОднойСвечой.Количество() > 0 Тогда
		Свеча = МассивСОднойСвечой[0];
	Иначе
		Свеча = Неопределено;
	КонецЕсли;
	
	Возврат Свеча;
	
КонецФункции

Функция ОпределитьУровеньСтопЛосс(Сигнал, ТекСвеча, Запись, ТаймСтамп)
	
	МассивСтопов		= НайтиСтопЛос(Сигнал, Запись.Участник);
		
	Если Сигнал.Бектест Тогда
		ТекущаяЦена		= ПолучитьЦенуПоИсторическимДанным(Сигнал, Запись, ТаймСтамп);		
	Иначе
		ТекущаяЦена		= ПолучитьТекущуюЦену(Сигнал, Запись);	
	КонецЕсли;
	
	КоличествоАТРдляСЛ	= ПолучитьЗначениеПараметраСтратегии("АИ_2_КоличествоАТРнаСтопЛосс", Сигнал.КлючНастроек);
	РискНаСделку		= ПолучитьЗначениеПараметраСтратегии("АИ_2_Риск", Сигнал.КлючНастроек);
	
	УровеньСтопЛоссАТР 	= ТекущаяЦена + (ТекСвеча.АТР * КоличествоАТРдляСЛ) * ?(Сигнал.Тренд = Перечисления.биг_ВидыТрендов.Нисходящий, 1, -1);		
	УровеньПоРиску		= ТекущаяЦена + (ТекущаяЦена / 100 * РискНаСделку) * ?(Сигнал.Тренд = Перечисления.биг_ВидыТрендов.Нисходящий, 1, -1);
	
	Если Сигнал.Тренд = Перечисления.биг_ВидыТрендов.Восходящий Тогда		
		
		УровеньСтопЛосс = Макс(УровеньСтопЛоссАТР, УровеньПоРиску);
		Если МассивСтопов.Количество() > 0 Тогда
			УровеньСтопЛосс = Макс(УровеньСтопЛоссАТР, МассивСтопов[0].slTriggerPx);	
		КонецЕсли;
		
	ИначеЕсли Сигнал.Тренд = Перечисления.биг_ВидыТрендов.Нисходящий Тогда
		
		УровеньСтопЛосс = Мин(УровеньСтопЛоссАТР, УровеньПоРиску);
		Если МассивСтопов.Количество() Тогда
			УровеньСтопЛосс = Мин(УровеньСтопЛоссАТР, МассивСтопов[0].slTriggerPx);	
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат УровеньСтопЛосс;
	
КонецФункции                                                                    

Процедура АктуализироватьНастройкиИнструментаНаАккаунте(ИнструментИД, Аккаунт, КлючНастроек, ШагВыполнен)
	
	ЗначениеПлеча		= ПолучитьЗначениеПараметраСтратегии("ДИ_2_Плечо", КлючНастроек);
	ЗначениеПлеча		= ?(ЗначениеЗаполнено(ЗначениеПлеча), ЗначениеПлеча, 1);
	
	СтруктураОперации = биг_МаркетАпиКлиентСервер.СтруктураОперации_УстановитьМаржу();

	СтруктураОперации.Вставить("ИнструментИД", ИнструментИД);
	СтруктураОперации.Вставить("УровеньМаржи", ЗначениеПлеча);
	СтруктураОперации.Вставить("РежимТорговли", Перечисления.big_OKX_tdModes.isolated);

	ШагВыполнен = биг_МаркетАпи.УстановитьМаржу(Аккаунт, СтруктураОперации);
	
КонецПроцедуры        

Функция ТребуетсяОбработкаСигнала(Сигнал, КлючНастроек, ТаймСтамп)
	
	ТочкаПоследнегоШага = ПолучитьТекущуюТочкуНаЛинииВремени(Сигнал.Биржа, Сигнал.ИнструментИД, Сигнал.Бар, КлючНастроек);
	СледующийШаг 		= ТочкаПоследнегоШага + Сигнал.Бар.SecondsAmount;
	Возврат ТаймСтамп >= СледующийШаг;
	
КонецФункции

Функция ПолучитьТекущуюТочкуНаЛинииВремени(Биржа, ИнструментИД, Бар, КлючНастроек)
	
	Менеджер = РегистрыСведений.биг_ДаблИмпактВременныеТочки.СоздатьМенеджерЗаписи();
	Менеджер.Биржа 					= Биржа;
	Менеджер.ИнструментИД 			= ИнструментИД;
	Менеджер.Бар					= Бар;
	Менеджер.НастройкаСтратегии		= КлючНастроек;
	Менеджер.Прочитать();
	
	Возврат Менеджер.ТочкаНаЛинииВремени;	
	
КонецФункции

Процедура ЗаписатьТочкуНаЛинииВремени(Биржа, ИнструментИД, Бар, КлючНастроек, ТочкаОтсчетаТС)
	
	Менеджер = РегистрыСведений.биг_ДаблИмпактВременныеТочки.СоздатьМенеджерЗаписи();
	Менеджер.Биржа 					= Биржа;
	Менеджер.ИнструментИД 			= ИнструментИД;
	Менеджер.Бар					= Бар;
	Менеджер.НастройкаСтратегии		= КлючНастроек;
	
	Менеджер.ТочкаНаЛинииВремени	= ТочкаОтсчетаТС;
	Менеджер.ТочкаДатой				= биг_ОбщегоНазначенияКлиентСервер.TimestampВДату(ТочкаОтсчетаТС);
	
	Менеджер.Записать(Истина);
	
КонецПроцедуры

Процедура ЗафиксироватьТочкуТекущегоШага(Инструмент, КлючНастроек, ТаймСтамп)
	
	ЗаписатьТочкуНаЛинииВремени(Инструмент.Биржа, Инструмент.ИнструментИД, Инструмент.Бар, КлючНастроек, биг_ОбщегоНазначения.НачалоПериодаПоБару(ТаймСтамп, Инструмент.Бар));			
		
КонецПроцедуры

Функция НайтиПоследнююСвечуИнструмента(Сигнал, ТаймСтамп)
	
	ПараметрыЗапроса 	= биг_ОбщегоНазначения.ПолучитьСтруктуруПараметровЗапросаДанныхПоСвечам();
	ЗаполнитьЗначенияСвойств(ПараметрыЗапроса, Сигнал); 
	
	ПараметрыЗапроса.ВыбратьПервые			= 1;
	ПараметрыЗапроса.СортировкаПоУбыванию	= Истина;
	
	ДанныеСвечей = биг_ОбщегоНазначения.ПолучитьДанныеСвечейПоТочке(ПараметрыЗапроса);
	
	Если ДанныеСвечей.Количество() = 0 Тогда
		ПоследняяСвеча = Неопределено;
	Иначе
		ПоследняяСвеча = ДанныеСвечей[0];	
	КонецЕсли;
	
	Возврат ПоследняяСвеча;
	
КонецФункции

Функция НайтиМинимальныйУровеньВСигнале(Сигнал)
	
	ПараметрыЗапроса 	= биг_ОбщегоНазначения.ПолучитьСтруктуруПараметровЗапросаДанныхПоСвечам();
	ЗаполнитьЗначенияСвойств(ПараметрыЗапроса, Сигнал); 
	
	ПараметрыЗапроса.ТочкаВремениТС_НачалоПериода 		= Сигнал.ТочкаНачалаПадения;
	ПараметрыЗапроса.ТочкаВремениТС_ЗавершениеПериода   = Сигнал.ТочкаЗавершенияПадения;
	
	ДанныеСвечей 		= биг_ОбщегоНазначения.ПолучитьДанныеСвечейПоТочке(ПараметрыЗапроса);
	
	Минимум = 999999999999;
	Для каждого Свеча Из ДанныеСвечей Цикл
		Минимум = Мин(Свеча.ЦенаМинимум, Минимум);
		//Минимум = Мин(Свеча.ЦенаЗакрытия, Минимум);
	КонецЦикла;
	
	Возврат Минимум;
		
КонецФункции

Функция СобратьАккаунтыДляРеакцииНаСигнал(Сигнал)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	биг_УчастникиСтратегийСрезПоследних.Participiant КАК Участник,
	|	биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.ccy КАК Монета,
	|	биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.availBal КАК ДоступныйБаланс,
	|	биг_УчастникиСтратегийСрезПоследних.СуммаДепозита КАК СуммаДепозита
	|ИЗ
	|	РегистрСведений.биг_УчастникиСтратегий.СрезПоследних(, ) КАК биг_УчастникиСтратегийСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.биг_ОКХ_БаллансАккаунтовДетали.СрезПоследних КАК биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних
	|		ПО биг_УчастникиСтратегийСрезПоследних.Participiant = биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.Account
	|			И (биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.ccy = &USDT)
	|ГДЕ
	|	биг_УчастникиСтратегийСрезПоследних.Участник
	|	И биг_УчастникиСтратегийСрезПоследних.Strategy = &Strategy
	|	И биг_УчастникиСтратегийСрезПоследних.Participiant.Владелец = &Биржа";
	
	Запрос.УстановитьПараметр("Strategy", 	ЭтаСтратегия());
	Запрос.УстановитьПараметр("USDT", 		РегистрыСведений.биг_ПредопределенныеЭлементы.ПолучитьЗначениеПоИмени("USDT"));
	Запрос.УстановитьПараметр("Биржа",		Сигнал.Биржа);

	ТабличаУчастников = Запрос.Выполнить().Выгрузить();
	
	Возврат	ТабличаУчастников;	
		
КонецФункции

Функция НайтиСтопЛос(Сигнал, Аккаунт)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	биг_ДаблИмпактОперации.Операция КАК Операция
	|ИЗ
	|	РегистрСведений.биг_ДаблИмпактОперации КАК биг_ДаблИмпактОперации
	|ГДЕ
	|	биг_ДаблИмпактОперации.Биржа = &Биржа
	|	И биг_ДаблИмпактОперации.ИнструментИД = &ИнструментИД
	|	И биг_ДаблИмпактОперации.ТочкаНачалаПадения = &ТочкаНачалаПадения
	|	И биг_ДаблИмпактОперации.Аккаунт = &Аккаунт
	|	И ВЫРАЗИТЬ(биг_ДаблИмпактОперации.Операция КАК Документ.big_AlgoOrders_OKX).slTriggerPx > 0
	|	И биг_ДаблИмпактОперации.НастройкаСтратегии = &НастройкаСтратегии";
	
	Запрос.УстановитьПараметр("Биржа", 				Сигнал.Биржа);
	Запрос.УстановитьПараметр("ИнструментИД", 		Сигнал.ИнструментИД);
	Запрос.УстановитьПараметр("ТочкаНачалаПадения", Сигнал.ТочкаНачалаПадения);
	Запрос.УстановитьПараметр("Аккаунт", 			Аккаунт);
	Запрос.УстановитьПараметр("НастройкаСтратегии", Сигнал.КлючНастроек);
	                       
	Выборка = Запрос.Выполнить().Выбрать();
		
	МассивСтопов = Новый Массив;
	Пока Выборка.Следующий() Цикл
		МассивСтопов.Добавить(Выборка.Операция);		
	КонецЦикла;
	
	Возврат МассивСтопов;	
	
КонецФункции

Функция ТекущийИнструментИмеетОткрытыеОрдера(Сигнал)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	биг_ДаблИмпактСигналы.Биржа КАК Биржа,
	|	биг_ДаблИмпактСигналы.ИнструментИД КАК ИнструментИД,
	|	биг_ДаблИмпактСигналы.КлючНастроек КАК КлючНастроек,
	|	биг_ДаблИмпактСигналы.ТочкаНачалаПадения КАК ТочкаНачалаПадения
	|ПОМЕСТИТЬ ВТ_АктивныеСигналы
	|ИЗ
	|	РегистрСведений.биг_ДаблИмпактСигналы КАК биг_ДаблИмпактСигналы
	|ГДЕ
	|	НЕ биг_ДаблИмпактСигналы.СигналЗавершен
	|	И биг_ДаблИмпактСигналы.ТочкаНачалаПадения <> &ТекущаяТочкаНачалаПадения
	|	И биг_ДаблИмпактСигналы.Биржа = &Биржа
	|	И биг_ДаблИмпактСигналы.ИнструментИД = &ИнструментИД
	|	И биг_ДаблИмпактСигналы.КлючНастроек = &КлючНастроек
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	биг_ДаблИмпактОперации.Операция КАК Операция
	|ИЗ
	|	РегистрСведений.биг_ДаблИмпактОперации КАК биг_ДаблИмпактОперации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_АктивныеСигналы КАК ВТ_АктивныеСигналы
	|		ПО биг_ДаблИмпактОперации.Биржа = ВТ_АктивныеСигналы.Биржа
	|			И биг_ДаблИмпактОперации.ИнструментИД = ВТ_АктивныеСигналы.ИнструментИД
	|			И биг_ДаблИмпактОперации.НастройкаСтратегии = ВТ_АктивныеСигналы.КлючНастроек
	|			И биг_ДаблИмпактОперации.Операция.ТочкаНачалаПадения = ВТ_АктивныеСигналы.ТочкаНачалаПадения";
	
	Запрос.УстановитьПараметр("ТекущаяТочкаНачалаПадения", 	Сигнал.ТочкаНачалаПадения);
	Запрос.УстановитьПараметр("Биржа", 						Сигнал.Биржа);
	Запрос.УстановитьПараметр("ИнструментИД", 				Сигнал.ИнструментИД);
	Запрос.УстановитьПараметр("КлючНастроек", 				Сигнал.КлючНастроек);
	                 
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	Иначе 
		Возврат Истина;		
	КонецЕсли;
		
КонецФункции

Функция ВычислитьУровеньСопротивленияСигналаНаСтаршемФрейме(Сигнал)
	
	// определение "более старшего" фрейма
	Бар = биг_ОбщегоНазначения.НайтиСтаршийФрейм(Сигнал.Бар);
	
	// Получаем данные о 72 свечах 
	// из базы
	ПараметрыЗапроса 	= биг_ОбщегоНазначения.ПолучитьСтруктуруПараметровЗапросаДанныхПоСвечам();
	ЗаполнитьЗначенияСвойств(ПараметрыЗапроса, Сигнал); 
	
	ПараметрыЗапроса.КоличествоСвечей		= 72;
	ПараметрыЗапроса.ОграничениеПериода     = Сигнал.ТочкаНачалаПадения;
	ПараметрыЗапроса.СортировкаПоУбыванию	= Истина;
	
	ДанныеСвечей = биг_ОбщегоНазначения.ПолучитьДанныеСвечейПоТочке(ПараметрыЗапроса);
	Если ДанныеСвечей.Количество() < ПараметрыЗапроса.КоличествоСвечей Тогда
		
		// если меньше, то запрос к бирже
		ПараметрыЗапроса = биг_МаркетАпиКлиентСервер.СтруктураОперации_ЗагрузитьИсториюСвечей();
		ЗаполнитьЗначенияСвойств(ПараметрыЗапроса, Сигнал);
		
		// !!! TODO: ОКХ ведет учет в 13-ти значном формате.. не гибко, но пока так
		ПараметрыЗапроса.ТочкаДо 			= Сигнал.ТочкаНачалаПадения * 1000; 
		ПараметрыЗапроса.КоличествоСвечей 	= ПараметрыЗапроса.КоличествоСвечей;
	КонецЕсли;
		
		
	// ищем последнюю красную свечу (влево)
	ПредыдущаяСвеча = ДанныеСвечей[0];
	
	Для каждого Строка Из ДанныеСвечей Цикл
		Если биг_ОбщегоНазначения.ЭтоКраснаяСвеча(Строка) Тогда
			
			ПредыдущаяСвеча = Строка;
		Иначе         
			
			// попалась зеленая свеча - предыдущая и была последней красной
			Прервать; 
		КонецЕсли;	
	КонецЦикла;
	
	// ЦенаВыхода = ЦенаОткрытияПоследнейКрасной - 0.1%
	ЦенаВыхода = ПредыдущаяСвеча.ЦенаОткрытия - (ПредыдущаяСвеча.ЦенаОткрытия / 100 * 0.1);
	Возврат ЦенаВыхода;	
		
КонецФункции

Процедура ПроверитьАктуальностьСигнала(Выборка, ТаймСтамп)
	
	Если Выборка.slTriggerPx > 0 Тогда
		
		// это Стоп Лосс
		
		СтатусыСработал = Новый Массив;
		СтатусыСработал.Добавить("EFFECTIVE");
		СтатусыСработал.Добавить("PARTIALLY_EFFECTIVE");
		
		СтатусДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Выборка.Операция, "state");
		Если СтатусыСработал.Найти(ВРег(СтатусДокумента)) <> Неопределено Тогда
			
			// сработал стоп, сигнал нуно завершить
			
			ПрофитУбытокСигнала = НайтиПрофитУбытокСигнала(Выборка);
			Если ПрофитУбытокСигнала <= 0 Тогда
				ЗавершитьСигналОтрицательно(Выборка, "Сработал Стоп-лосс", ТаймСтамп);
			Иначе
				ЗавершитьСигналУспешно(Выборка, ТаймСтамп);
			КонецЕсли;
			
			биг_ПодсистемаОповещений.ВнутреннееОповещениеОСрабатыванииСтопЛосса(Выборка, ПрофитУбытокСигнала);
			
			//ПрофитУбытокВПроцентах = ВычислитьФинРезВПроцентах(Выборка, ПрофитУбытокСигнала);
			//биг_ПодсистемаОповещений.ПубличноеОповещениеОСрабатыванииСтопЛосса(Выборка, ПрофитУбытокВПроцентах);
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

Процедура ИскуственноПроверитьВыполнениеОрдера(Выборка, ТаймСтамп)
	
	// начало - дата создания ордера
	// конец - таймстамп
	// получить данные свечей за период
	
	ПараметрыЗапроса 	= биг_ОбщегоНазначения.ПолучитьСтруктуруПараметровЗапросаДанныхПоСвечам(); 
	ПараметрыЗапроса.Биржа 								= Выборка.Биржа;
	ПараметрыЗапроса.ИнструментИД 						= Выборка.ИнструментИД;      
	
	// TODO: в теории тут может быть любой фрейм, поэтому надо получать точку на минутную свечу, а есл нет на более старший фрейм
	// такая процедура есть.. где то.. 
	ПараметрыЗапроса.Бар								= Справочники.big_BarTypes.H1;
	
	Если ЗначениеЗаполнено(Выборка.Операция.uTime) Тогда
		НачалоПериода = Число(Лев(Формат(Выборка.Операция.uTime, "ЧГ=0"), 10));	
	ИначеЕсли ЗначениеЗаполнено(Выборка.Операция.cTime) Тогда
		НачалоПериода = Число(Лев(Формат(Выборка.Операция.cTime, "ЧГ=0"), 10));
	Иначе
		НачалоПериода = биг_ОбщегоНазначенияКлиентСервер.ДатуВTimestampЧисло(Выборка.Дата);	
	КонецЕсли;
	ПараметрыЗапроса.ТочкаВремениТС_НачалоПериода 		= НачалоПериода + 1;
	ПараметрыЗапроса.ТочкаВремениТС_ЗавершениеПериода   = ТаймСтамп;        
	
	ДанныеСвечей 		= биг_ОбщегоНазначения.ПолучитьДанныеСвечейПоТочкеСИндикаторами(ПараметрыЗапроса);
	
	Если Выборка.slTriggerPx > 0 Тогда
		
		// проверить есть ли Цена Минимум ниже, чем триггер стоп-лосс
		Для каждого Строка Из ДанныеСвечей Цикл
			
			Если (Выборка.side = Перечисления.big_OKX_OrderSides.sell И Строка.ЦенаМинимум <= Выборка.slTriggerPx) ИЛИ
				(Выборка.side = Перечисления.big_OKX_OrderSides.buy И Строка.ЦенаМаксимум >= Выборка.slTriggerPx) Тогда
				
				Если Выборка.slOrdPx = -1 Тогда
					
					// маркет ордер - считаем, что исполнился
					// установить state = effective
					УстановитьСтатусАлгоОрдера(Выборка.Операция, "effective", Перечисления.big_СтатусыТорговыхОбъектов.Исполнен);
					Бектест_СоздатьОрдер(Выборка, ТаймСтамп);
					Прервать;
				Иначе
					
					// лимитный ордер - проверяем опустилась ли цена ниже
					Если Строка.ЦенаМинимум <= Выборка.slOrdPx Тогда
						
						// установить state = effective
						УстановитьСтатусАлгоОрдера(Выборка.Операция, "effective", Перечисления.big_СтатусыТорговыхОбъектов.Исполнен);
						Бектест_СоздатьОрдер(Выборка, ТаймСтамп);
						Прервать;
					КонецЕсли;					
				КонецЕсли;				
			КонецЕсли;			
		КонецЦикла;	
	КонецЕсли;
	   		
	Если Выборка.tpTriggerPx > 0 Тогда
		
		Сообщить("Тейк профиты не доделаны. ОМ биг_АлгоИмпакт.ИскуственноПроверитьВыполнениеОрдера()");
		
		// проверить есть ли Цена Выше, чем триггер тейк-профит
		Для каждого Строка Из ДанныеСвечей Цикл
			
			Если Строка.ЦенаМаксимум >= Выборка.tpTriggerPx Тогда
				
				Если Выборка.tpOrdPx = -1 Тогда
					
					// маркет ордер - считаем, что исполнился
					// установить state = effective
					УстановитьСтатусАлгоОрдера(Выборка.Операция, "effective", Перечисления.big_СтатусыТорговыхОбъектов.Исполнен);
					Бектест_СоздатьОрдер(Выборка, ТаймСтамп);
					Прервать;
				Иначе
					
					// лимитный ордер - проверяем опустилась ли цена ниже
					Если Строка.ЦенаМинимум >= Выборка.tpOrdPx Тогда
						
						// установить state = effective
						УстановитьСтатусАлгоОрдера(Выборка.Операция, "effective", Перечисления.big_СтатусыТорговыхОбъектов.Исполнен);
						Бектест_СоздатьОрдер(Выборка, ТаймСтамп);
						Прервать;
					КонецЕсли;					
				КонецЕсли;				
			КонецЕсли;			
		КонецЦикла;		
	КонецЕсли; 
	
КонецПроцедуры

Процедура УстановитьСтатусАлгоОрдера(Операция, СтатусОКХ, СтатусВнутренний)
	
	ДокОбъект = Операция.ПолучитьОбъект();
	ДокОбъект.state 	= СтатусОКХ;
	ДокОбъект.Статус 	= СтатусВнутренний;
	ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры 

Процедура Бектест_СоздатьОрдер(Выборка, ТаймСтамп)

	СтруктураОперации = биг_МаркетАпиКлиентСервер.СтруктураОперации_СоздатьОрдер();
	СтруктураОперации.Биржа 				= Выборка.Биржа;
	СтруктураОперации.Аккаунт 				= Выборка.Аккаунт;
	СтруктураОперации.Стратегия				= ЭтаСтратегия();
	СтруктураОперации.КлючНастроек			= Выборка.НастройкаСтратегии;
	СтруктураОперации.Сигнал				= Выборка.ТочкаНачалаПадения;
	СтруктураОперации.Событие				= Перечисления.биг_ДаблИмпактEvents.ВыполнениеСтопЛосс;
	СтруктураОперации.ОрдерСторона			= Выборка.side;
	СтруктураОперации.ИнструментТип			= Перечисления.big_OKX_InstrumentType.SWAP; //DI_HARD - стратегия всегда на фьючах или могут быть варинаты ?
	СтруктураОперации.ИнструментИД			= Выборка.ИнструментИД;
	СтруктураОперации.БектестВычислитьPnL	= Истина;
	
	// на текущий момент ТейкПрофиты по стратегии не используются. Но закладываю для универсальности	
	Если Выборка.slOrdPx > 0 ИЛИ Выборка.tpOrdPx > 0 Тогда
		СтруктураОперации.ОрдерТип		= Перечисления.big_OKX_OrderTypes.limit;
		СтруктураОперации.ЦенаОрдера	= ?(ЗначениеЗаполнено(Выборка.slOrdPx), Выборка.slOrdPx, Выборка.tpOrdPx);
	Иначе
		// ОТЛАДКА 
		// Тут должен быть маркет-ордер, но с определением цены пока не придумал.. поэтому делаем лимитный
		//СтруктураОперации.ОрдерТип	= Перечисления.big_OKX_OrderTypes.market;
		СтруктураОперации.ОрдерТип		= Перечисления.big_OKX_OrderTypes.limit;		
		СтруктураОперации.ЦенаОрдера 	= Выборка.slTriggerPx;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Выборка.tpOrdPx) Тогда
		СтруктураОперации.РазмерОрдера  = Выборка.sz;
	Иначе
		СтруктураОперации.РазмерОрдера	= ОпределитьОбъемПокупокВСигналеПоОрдеру(Выборка.Операция);			
	КонецЕсли;
	
	биг_МаркетАпи.СоздатьОрдер(Неопределено, СтруктураОперации, Истина, ТаймСтамп);
	
КонецПроцедуры

Функция РассчитатьОриентировочнуюСуммуОперацииВВалютеОперации(Сигнал, Запись, ПроцентДепозитаНаВход, ТаймСтамп)
		
	Если Сигнал.Бектест Тогда
		// TODO: обращение к маркет апи по Запись.Участник (аккаунт) и признаком бектест
		// маркетапи перенаправляет в модуль нужной биржи (по аккаунту)
		// там для бектеста смотрим текущий накопелнный результат и вычисляем балланс как Депо + (ПрофитЛосс - Комиссия), если он отрицательный
		ДоступныйБаланс = Запись.СуммаДепозита; //а пока что мы в минус "не уходим". Это завышает прибыли, но пока сойдет
	Иначе
		ДоступныйБаланс = Запись.ДоступныйБаланс;
	КонецЕсли;
	
	СуммаПоДепозиту		= Окр(Запись.СуммаДепозита / 100 * ПроцентДепозитаНаВход , 2);
	ДолларовДоступно	= Мин(Запись.ДоступныйБаланс, СуммаПоДепозиту);
	
	ЗначениеПлеча		= ПолучитьЗначениеПараметраСтратегии("ДИ_2_Плечо", Сигнал.КлючНастроек);
	ЗначениеПлеча		= ?(ЗначениеЗаполнено(ЗначениеПлеча), ЗначениеПлеча, 1);
	ДолларовНаОперацию	= ДолларовДоступно * ЗначениеПлеча;
	
	// нельзя брать количество "в притык", иначе ордер не сработает, если за время его создания цена увеличиться
	// поэтому искуственно "завысим" цену в расчетах, что бы был запас 
	Если Сигнал.Бектест Тогда
		ТекущаяЦена		= ПолучитьЦенуПоИсторическимДанным(Сигнал, Запись, ТаймСтамп);		
	Иначе
		ТекущаяЦена		= ПолучитьТекущуюЦену(Сигнал, Запись);	
	КонецЕсли;
	
	ЦенаРасчета			= ТекущаяЦена;	
	РазмерОрдера		= Окр(ДолларовНаОперацию / ЦенаРасчета, 8);
	
	Возврат РазмерОрдера;
	
КонецФункции

Функция ПолучитьТекущуюЦену(Сигнал, Запись)
	
	СтруктураОперации = биг_МаркетАпиКлиентСервер.СтруктураОперации_ПолучитьЦену();
	СтруктураОперации.Биржа			= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.Участник, "Владелец");
	СтруктураОперации.ИнструментТип	= Перечисления.big_OKX_InstrumentType.SWAP; //DI_HARD - пока так. по хорошему нужно это в сигнале фиксировать
	СтруктураОперации.ИнструментИД	= Сигнал.ИнструментИД;
	
	Цена = биг_МаркетАпи.ПолучитьЦенуТикета(СтруктураОперации);
	Возврат Цена;
		
КонецФункции                             

Процедура ПроверитьВходныеПараметры(ТаймСтамп, НастройкаСтратегии)

	Если НастройкаСтратегии = Неопределено Тогда
		Стратегия 			= ЭтаСтратегия();
		НастройкаСтратегии 	= Стратегия.ОсновнаяНастройка;
	КонецЕсли;
	
	Если ТаймСтамп = Неопределено Тогда
		ТаймСтамп = биг_ОбщегоНазначенияКлиентСервер.ДатуВTimestampЧисло();	
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьТаблицуНастроек(НастройкаСтратегии)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	биг_ЗначенияКонтрольныхУровней.КонтрольныйУровень КАК Параметр,
	|	биг_ЗначенияКонтрольныхУровней.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.биг_ЗначенияКонтрольныхУровней КАК биг_ЗначенияКонтрольныхУровней
	|ГДЕ
	|	биг_ЗначенияКонтрольныхУровней.НастройкаСтратегии = &НастройкаСтратегии";
	Запрос.УстановитьПараметр("НастройкаСтратегии", НастройкаСтратегии);
	ТаблицаНастроек = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаНастроек;
		
КонецФункции

Функция ПолучитьЗначениеПараметраСтратегии(ИмяПараметра, КлючНастроек)

	Возврат РегистрыСведений.биг_ЗначенияКонтрольныхУровней.ЗначениеУровняПоИмени(ИмяПараметра, КлючНастроек);
	
КонецФункции

Функция ОпределитьОбъемПокупокВСигналеПоОрдеру(Операция)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(биг_ДаблИмпактОперации.Операция.fillSz) КАК fillSz
	|ИЗ
	|	РегистрСведений.биг_ДаблИмпактОперации КАК биг_ДаблИмпактОперации
	|ГДЕ
	|	биг_ДаблИмпактОперации.Биржа = &Биржа
	|	И биг_ДаблИмпактОперации.ИнструментИД = &ИнструментИД
	|	И биг_ДаблИмпактОперации.ТочкаНачалаПадения = &ТочкаНачалаПадения
	|	И биг_ДаблИмпактОперации.Аккаунт = &Аккаунт
	|	И биг_ДаблИмпактОперации.Операция.side = &Сторона
	|	И (ВЫРАЗИТЬ(биг_ДаблИмпактОперации.Операция КАК Документ.big_Order_OKX)) <> ЗНАЧЕНИЕ(Документ.big_Order_OKX.ПустаяСсылка)
	|	И биг_ДаблИмпактОперации.НастройкаСтратегии = &НастройкаСтратегии
	|	И биг_ДаблИмпактОперации.Операция.Событие В(&СобытиЯПокупки)";
	
	СтрокаРеквизитов 	= "instId, ТочкаНачалаПадения, Аккаунт, НастройкаСтратегии";
	ЗначенияРеквизитов 	= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Операция, СтрокаРеквизитов);
	
	Запрос.УстановитьПараметр("Биржа", 				ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗначенияРеквизитов.Аккаунт, "Владелец"));
	Запрос.УстановитьПараметр("ИнструментИД", 		ЗначенияРеквизитов.instId);
	Запрос.УстановитьПараметр("ТочкаНачалаПадения", ЗначенияРеквизитов.ТочкаНачалаПадения);
	Запрос.УстановитьПараметр("Аккаунт", 			ЗначенияРеквизитов.Аккаунт);
	
	Если Операция.side = Перечисления.big_OKX_OrderSides.buy Тогда
		Запрос.УстановитьПараметр("Сторона", 		Перечисления.big_OKX_OrderSides.sell);
	Иначе
		Запрос.УстановитьПараметр("Сторона", 		Перечисления.big_OKX_OrderSides.buy);
	КонецЕсли;
	Запрос.УстановитьПараметр("НастройкаСтратегии", ЗначенияРеквизитов.НастройкаСтратегии);
	
	СобытияПокупки = Новый Массив;
	СобытияПокупки.Добавить(Перечисления.биг_ДаблИмпактEvents.ПоискТочкиВходаОдин);
	СобытияПокупки.Добавить(Перечисления.биг_ДаблИмпактEvents.ПоискТочкиВходаДва);	
	Запрос.УстановитьПараметр("СобытиЯПокупки", 	СобытияПокупки);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат 0;
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		Возврат Выборка.fillSz;
	КонецЕсли;
	
КонецФункции

Функция НайтиПрофитУбытокСигнала(ВыборкаПоОперации)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(биг_ДаблИмпактОперации.Операция.pnl) КАК ПрофитУбыток,
	|	биг_ДаблИмпактОперации.Операция.fillSz КАК ОперацияfillSz
	|ИЗ
	|	РегистрСведений.биг_ДаблИмпактОперации КАК биг_ДаблИмпактОперации
	|ГДЕ
	|	биг_ДаблИмпактОперации.Биржа = &Биржа
	|	И биг_ДаблИмпактОперации.ИнструментИД = &ИнструментИД
	|	И биг_ДаблИмпактОперации.ТочкаНачалаПадения = &ТочкаНачалаПадения
	|	И биг_ДаблИмпактОперации.Аккаунт = &Аккаунт
	|	И биг_ДаблИмпактОперации.НастройкаСтратегии = &НастройкаСтратегии
	|	И биг_ДаблИмпактОперации.Событие = &Событие
	|
	|СГРУППИРОВАТЬ ПО
	|	биг_ДаблИмпактОперации.Операция.fillSz";
	
	Запрос.УстановитьПараметр("Аккаунт", 			ВыборкаПоОперации.Аккаунт);
	Запрос.УстановитьПараметр("Биржа", 				ВыборкаПоОперации.Биржа);
	Запрос.УстановитьПараметр("ИнструментИД", 		ВыборкаПоОперации.ИнструментИД);
	Запрос.УстановитьПараметр("ТочкаНачалаПадения", ВыборкаПоОперации.ТочкаНачалаПадения);
	Запрос.УстановитьПараметр("НастройкаСтратегии", ВыборкаПоОперации.НастройкаСтратегии);	
	Запрос.УстановитьПараметр("Событие", 			Перечисления.биг_ДаблИмпактEvents.ВыполнениеСтопЛосс);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.ПрофитУбыток;
		
КонецФункции

Функция ПолучитьКоличествоСигналовИнструмента(ПараметрыИнструмента)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЕСТЬNULL(биг_ДаблИмпактСигналы.ТочкаНачалаПадения, 0)) КАК КоличествоСигналов
	|ИЗ
	|	РегистрСведений.биг_ДаблИмпактСигналы КАК биг_ДаблИмпактСигналы
	|ГДЕ
	|	биг_ДаблИмпактСигналы.Биржа = &Биржа
	|	И биг_ДаблИмпактСигналы.ИнструментИД = &ИнструментИД
	|	И биг_ДаблИмпактСигналы.Бар = &Бар
	|	И биг_ДаблИмпактСигналы.КлючНастроек = &КлючНастроек";
	
	Запрос.УстановитьПараметр("Биржа", 			ПараметрыИнструмента.Биржа);
	Запрос.УстановитьПараметр("ИнструментИД", 	ПараметрыИнструмента.ИнструментИД);
	Запрос.УстановитьПараметр("Бар", 			ПараметрыИнструмента.Бар);
	Запрос.УстановитьПараметр("КлючНастроек", 	ПараметрыИнструмента.КлючНастроек);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.КоличествоСигналов;
		
КонецФункции

Функция ВычислитьФинРезВПроцентах(Выборка, ФинРез)
	
	Если Выборка.fillSz = 0 Тогда
		Возврат 0;
	Иначе
		ФинРезВПроцентах = Окр(ФинРез / Выборка.fillSz * 100, 2);
		Возврат ФинРезВПроцентах;
	КонецЕсли;   
	
КонецФункции

Функция ПроверитьНаличиеАктуальнойСвечи(ДанныеСвечей, СортировкаПоУбыванию, Бар, ТаймСтамп)
	
	КоличествоСвечей = ДанныеСвечей.Количество(); 
	Если КоличествоСвечей > 0 Тогда
		
		Свеча = ?(СортировкаПоУбыванию, ДанныеСвечей[0], ДанныеСвечей[КоличествоСвечей-1]); 
		ЦелеваяДатаТС = биг_ОбщегоНазначения.НачалоПериодаПоБару(ТаймСтамп, Бар) - Бар.SecondsAmount;
		
		Если Свеча.TimeStamp < ЦелеваяДатаТС Тогда
			Возврат Ложь;
		Иначе
			Возврат Истина;
		КонецЕсли; 
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

Функция Модуль(Число)

	Возврат ?(Число > 0, Число, -Число);
	
КонецФункции

#КонецОбласти //ВспомогательныеПроцедурыФункции    

 