#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Форма = ПараметрыПриложения[МиграцияПриложенийКлиент.ИмяФормыПереходаВСервис()];
	Если Форма = Неопределено Тогда
		ОткрытьФорму("Обработка.МастерПереходаВОблако.Форма.МастерПереходаВОблако", , 
			ПараметрыВыполненияКоманды.Источник, 
			ПараметрыВыполненияКоманды.Уникальность, 
			ПараметрыВыполненияКоманды.Окно, 
			ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	ИначеЕсли Не Форма.Открыта() Тогда
		Форма.Открыть();
	Иначе
		Форма.Активизировать();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
