
#Область УниверсальныеМетоды

Функция СоздатьКлиентовИСессии_Паблик(Слушатель, Демо = Ложь) Экспорт
	
	ДанныеСокета	= АдресВебСокет_Паблик();		
	Клиент			= НайтиСоздатьКлиентВебСокет(Слушатель, ДанныеСокета, Демо);
	
	ПодобратьКлючИПроверитьСоединение(Слушатель, Клиент);	
		
КонецФункции

Функция СоздатьКлиентовИСессии_Приват(Слушатель, Демо = Неопределено) Экспорт
	
	Если Демо = Неопределено Тогда
		Демо		= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Слушатель, "demo");	
	КонецЕсли;
	
	ДанныеСокета	= АдресаВебСокетОКХ_Приват();
	Клиент			= НайтиСоздатьКлиентВебСокет(Слушатель, ДанныеСокета, Демо);
	
	ПодобратьКлючИПроверитьСоединение(Слушатель, Клиент, Истина);
	
КонецФункции 

Процедура ПроверитьСоздатьСоединениеВебСокет(Слушатель, Клиент, ВыполнитьАвторизацию = Ложь) Экспорт
	
	СостояниеСоединения = Клиент.ПолучитьСостояниеСоединения();
	Если СостояниеСоединения = СостояниеWebSocketСоединения.Открыто ИЛИ СостояниеСоединения = СостояниеWebSocketСоединения.Открывается Тогда
		Соединение = Клиент.ПолучитьТекущееСоединение();
	Иначе
		Соединение = Клиент.Подключить();
		РегистрыСведений.биг_СоединенияВебСокет.ЗафиксироватьКлючСлушателя(Слушатель, Клиент.URLСервера, Клиент.Ключ, Соединение.Ключ, ВыполнитьАвторизацию);
		
		Если ВыполнитьАвторизацию Тогда
			Авторизация(Соединение, Слушатель);
		Иначе
			ПодписатьсяНаОнлайнКаналы(Соединение, Слушатель);
		КонецЕсли;		 
	КонецЕсли;               
	
КонецПроцедуры

Функция ЗакрытьСессиюСлушателя_Паблик(Слушатель) Экспорт
	
	ПубличныйСокет	= АдресВебСокет_Паблик();
	КлючСоединения 	= РегистрыСведений.биг_СоединенияВебСокет.ПолучитьКлючСоединенияСлушателя(Слушатель, ПубличныйСокет.Адрес);
	Если КлючСоединения <> Неопределено И КлючСоединения <> "" Тогда
		Соединение = WebSocketКлиентСоединения.ПолучитьСоединение(КлючСоединения);
		Если Соединение <> Неопределено И Соединение.ПолучитьСостояние() = СостояниеWebSocketСоединения.Открыто Тогда
			Соединение.Закрыть();	
		КонецЕсли;		
	КонецЕсли;	
	
КонецФункции

Функция ЗакрытьСессиюСлушателя_Приват(Слушатель) Экспорт
	
	ЭтоДемо			= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Слушатель, "demo");
	ПриватныйСокет	= АдресаВебСокетОКХ_Приват();	
	АдресПоиска 	= ?(ЭтоДемо, ПриватныйСокет.АдресДемо, ПриватныйСокет.Адрес);
	
	КлючСоединения 	= РегистрыСведений.биг_СоединенияВебСокет.ПолучитьКлючСоединенияСлушателя(Слушатель, АдресПоиска);
	Если КлючСоединения <> Неопределено И КлючСоединения <> "" Тогда
		Соединение = WebSocketКлиентСоединения.ПолучитьСоединение(КлючСоединения);
		Если Соединение <> Неопределено И Соединение.ПолучитьСостояние() = СостояниеWebSocketСоединения.Открыто Тогда
			Соединение.Закрыть();	
		КонецЕсли;		
	КонецЕсли;	
	
КонецФункции

Процедура Подпис_МаркетЦены(СтруктураОбщегоФормата) Экспорт	
		
	ПараметрыОперации = биг_ОКХ_ВебСокет_КлиентСервер.Мап_МаркетЦены(СтруктураОбщегоФормата);
	биг_ОбщегоНазначенияКлиентСервер.УдалитьНеЗаполненныеПараметры(ПараметрыОперации);
	
	ПодписатьсяНаКанал(ПараметрыОперации, СтруктураОбщегоФормата.Слушатель);		
		
КонецПроцедуры

Процедура Подпис_ИзмененияОрдеров(СтруктураОбщегоФормата) Экспорт	
		
	ПараметрыОперации = биг_ОКХ_ВебСокет_КлиентСервер.Мап_ИзмененияОрдеров(СтруктураОбщегоФормата);
	биг_ОбщегоНазначенияКлиентСервер.УдалитьНеЗаполненныеПараметры(ПараметрыОперации);
	
	ПодписатьсяНаКанал(ПараметрыОперации, СтруктураОбщегоФормата.Слушатель);		
		
КонецПроцедуры

#КонецОбласти //УниверсальныеМетоды


#Область ОбработкаСообщений

Процедура ПриПолученииСообщения(Соединение, Сообщение) Экспорт
	
	Если Сообщение = "pong" Тогда
		Возврат;
	КонецЕсли;
	
	Ответ 		= биг_ВебСокет_КлиентСервер.ЧтениеДанныхИзJSON(Сообщение);
	
	Если Ответ.Отработал = Ложь Тогда
		//Сообщить(Ответ.ТекстОшибки);
		ЗаписьЖурналаРегистрации("WebSocket-Client", УровеньЖурналаРегистрации.Предупреждение, Метаданные.WebSocketКлиенты.биг_ВебСокет_ОКХ,, "Ошибка = " + Ответ.ТекстОшибки + " ТекстСообщения = " + Сообщение);
		
	Иначе
		
		Результат 	= Ответ.Результат;
		
		Если Результат.Свойство("data") Тогда
			
			Данные 	= Результат.data;
			Канал	= Результат.arg.channel;
			
			Если Канал = "mark-price" Тогда
				// ничего не делаем пока что
				
			ИначеЕсли Канал = "orders" Тогда		
				ОбработкаОтветов_КаналОрдеров(Соединение, Сообщение, Данные, Канал);
				
			ИначеЕсли Канал = "positions" Тогда			
				ОбработкаОтветов_КаналПозиций(Соединение, Сообщение, Данные, Канал);
				
			ИначеЕсли Канал = "balance_and_position" Тогда			
				ОбработкаОтветов_КаналБалансыИПозиции(Соединение, Сообщение, Данные, Канал);			
			КонецЕсли;
			
		ИначеЕсли Результат.Свойство("event") И Результат.event = "subscribe" Тогда		
			
			КлючСоединения 	= Соединение.Ключ;
			Канал 			= Результат.arg.channel;
			
		ИначеЕсли Результат.Свойство("event") И Результат.event = "login" Тогда
			
			ОбработкаОтветов_Авторизация(Соединение, Сообщение, Результат);	
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаОтветов_КаналОрдеров(Соединение, Сообщение, Данные, Канал)

	Слушатель 		= РегистрыСведений.биг_СоединенияВебСокет.СлушательПоКлючуСоединения(Соединение.Ключ);
	ЗаполнениеOKX 	= Обработки.big_OKX_API.Создать();
	Для каждого СтруктураДанных Из Данные Цикл
		ДокументОперации = ЗаполнениеOKX.Ордер_СоздатьДополнитьПоОтвету(СтруктураДанных, Слушатель);
		
		Если ЗначениеЗаполнено(СтруктураДанных.clOrdId) И ЗначениеЗаполнено(СтруктураДанных.fillSz) Тогда
			
			МассивОпераций = биг_ОКХ_Сервер.ПолучитьМассивСвязанныхОпераций(ДокументОперации);
			биг_СтратегииСервер.ЗафиксироватьОперацию(МассивОпераций);			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаОтветов_КаналПозиций(Соединение, Сообщение, Данные, Канал)

	Слушатель 		= РегистрыСведений.биг_СоединенияВебСокет.СлушательПоКлючуСоединения(Соединение.Ключ);
	ЗаполнениеOKX 	= Обработки.big_OKX_API.Создать();
	Для каждого СтруктураДанных Из Данные Цикл
		ЗаполнениеOKX.Позиция_СоздатьДополнитьПоОтвету(СтруктураДанных, Слушатель);	
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаОтветов_КаналБалансыИПозиции(Соединение, Сообщение, Данные, Канал)
	
	Слушатель 		= РегистрыСведений.биг_СоединенияВебСокет.СлушательПоКлючуСоединения(Соединение.Ключ);
	
	Если Данные.balData.Количество() > 0 Тогда
		// обновление детального баланса. А как же общий ? Самому пересчитывать?
	КонецЕсли;                                                                  
	
	Если Данные.posData.Количество() > 0 Тогда
		// обновление позиций				
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаОтветов_Авторизация(Соединение, Сообщение, Результат)

	Если ЗначениеЗаполнено(Результат.connId) Тогда
		Слушатель 		= РегистрыСведений.биг_СоединенияВебСокет.СлушательПоКлючуСоединения(Соединение.Ключ);
		ПодписатьсяНаОнлайнКаналы(Соединение, Слушатель);	
	КонецЕсли;
	
КонецПроцедуры




#КонецОбласти //ОбработкаСообщений


#Область СлужебныеПроцедурыФункции

Функция НайтиСоздатьКлиентВебСокет(Слушатель, ДанныеСокета, Демо)
		
	АдресПоиска 	= ?(Демо, ДанныеСокета.АдресДемо, ДанныеСокета.Адрес);
	
	КлючКлиента 	= ПолучитьКлючКлиентаВебСокета(Слушатель, АдресПоиска);
	Если КлючКлиента = "" Тогда
		КлючКлиента = Строка(Новый УникальныйИдентификатор());		
	КонецЕсли; 
	
	Возврат ПолучитьКлиентаВебСокет(АдресПоиска, КлючКлиента);
		
КонецФункции

Функция ПолучитьКлючКлиентаВебСокета(Слушатель, АдресПоиска)
	
	Возврат РегистрыСведений.биг_СоединенияВебСокет.КлючКлиентаАдресаПоСлушателю(Слушатель, АдресПоиска);
		
КонецФункции

Функция ПолучитьКлиентаВебСокет(Адрес, Ключ)
	
	Клиент = WebSocketКлиенты.НайтиПоКлючу(Ключ);
	
	Если Клиент = Неопределено Тогда
		Клиент = WebSocketКлиенты.СоздатьКлиента(Метаданные.WebSocketКлиенты.биг_ВебСокет_ОКХ, Ключ);
		Клиент.URLСервера = Адрес;
		Клиент.Записать();		
	КонецЕсли;
	
	Возврат Клиент;
	
КонецФункции

Процедура Авторизация(Соединение, Аккаунт)
	
	СтруктураОперации = биг_ОКХ_ВебСокет_КлиентСервер.СП_Логин();
	
	method 								= "GET";
	requestPath 						= "/users/self/verify";
	timestamp							= Формат(Цел(биг_ОбщегоНазначенияКлиентСервер.ТекущаяДатаВМиллисекундахЭпохаUnixGMT0() / 1000), "ЧГ=0");
	ПараметрыАккаунта 					= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Аккаунт, "APIKey, passphrase, SecretKey");
	
	СтруктураОперации.args[0].apiKey 		= ПараметрыАккаунта.APIKey;
	СтруктураОперации.args[0].passphrase 	= ПараметрыАккаунта.passphrase;
	СтруктураОперации.args[0].timestamp		= timestamp;	
	
	prehashString 						= timestamp + method + requestPath; 
	secretKey 							= ПараметрыАккаунта.SecretKey;	
	secretKeyDoubleData					= ПолучитьДвоичныеДанныеИзСтроки(secretKey);
	sign 								= РаботаВМоделиСервисаБТС.Подпись(secretKeyDoubleData, prehashString);
	
	СтруктураОперации.args[0].sign		= sign;
	
	СтрокаJson 							= биг_КоннекторHTTP.ОбъектВJson(СтруктураОперации);
	
	Параметры = биг_ОКХ_ВебСокет_КлиентСервер.ПараметрыСоединения(Соединение);
	Параметры.Вставить("Сообщение", СтрокаJson);
	биг_ВебСокет_Сервер.ЗаписатьВЛог("ОтправкаСообщения", Соединение.Ключ, Параметры);
	
	Соединение.ОтправитьСообщение(СтрокаJson);
			
КонецПроцедуры

Процедура ПодписатьсяНаОнлайнКаналы(Соединение, Слушатель)
	
	Адрес 								= Соединение.URLСервера;
	МассивПараметровОперацийПодписки 	= СформироватьНеобходимыеПакеты(Адрес);
	
	Для каждого ПараметрыОперацииБиржи Из МассивПараметровОперацийПодписки Цикл
		ПодписатьсяНаКанал(ПараметрыОперацииБиржи, Слушатель);	
	КонецЦикла;
	
КонецПроцедуры 

Процедура ПодписатьсяНаКанал(ПараметрыОперацииБиржи, Слушатель, Соединение = Неопределено)
	
	Если ПараметрыОперацииБиржи.args.Количество() = 0 Тогда
		Сообщить("Не заполнен массив аругментов");
		Возврат;
	КонецЕсли;
	
	Аргумент 		= ПараметрыОперацииБиржи.args[0];
	КаналПодписки 	= Аргумент.channel;
	Демо			= Ложь;
	
	Если ТипЗнч(Слушатель) = Тип("СправочникСсылка.big_MarketAccounts") Тогда
		Демо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Слушатель, "demo");		
	КонецЕсли;
		
	Если Соединение = Неопределено Тогда
		// получить текущее соединение
		URLАдресСоединения 	= биг_ОКХ_ВебСокет_КлиентСервер.ПолучитьУРЛпоНазваниюКаналаПодписки(КаналПодписки, Демо);
		Ключ 				= биг_ВебСокет_Сервер.ПолучитьКлючСоединения(Слушатель, URLАдресСоединения);
		Соединение 			= WebSocketКлиентСоединения.ПолучитьСоединение(Ключ);	
	КонецЕсли;
	
	Состояние 	= Соединение.ПолучитьСостояние();
	
	// проверить состояние соединения
	Если НЕ (Состояние = СостояниеWebSocketСоединения.Открыто ИЛИ Состояние = СостояниеWebSocketСоединения.Открывается) Тогда
		
		Сообщить("Соединение вебсокета отсутствует, хотя должно быть. Подписка на канал не выполнена");
		Возврат;
	КонецЕсли;	

	СтрокаJson 		= биг_КоннекторHTTP.ОбъектВJson(ПараметрыОперацииБиржи);
	
	Параметры = биг_ОКХ_ВебСокет_КлиентСервер.ПараметрыСоединения(Соединение);
	Параметры.Вставить("Сообщение", СтрокаJson);
	биг_ВебСокет_Сервер.ЗаписатьВЛог("ОтправкаСообщения", Ключ, Параметры);
	
	Соединение.ОтправитьСообщение(СтрокаJson);
	
КонецПроцедуры                                      

Процедура ПодобратьКлючИПроверитьСоединение(Слушатель, Клиент, ВыполнитьАвторизацию = Ложь)

	КлючСоединения = РегистрыСведений.биг_СоединенияВебСокет.ПолучитьКлючСоединенияСлушателя(Слушатель, Клиент.URLСервера);
	Если КлючСоединения = Неопределено ИЛИ КлючСоединения = "" Тогда
		
		ПроверитьСоздатьСоединениеВебСокет(Слушатель, Клиент, ВыполнитьАвторизацию);
	Иначе
		
		// проверить, что Соединение живое
		Соединение = WebSocketКлиентСоединения.ПолучитьСоединение(КлючСоединения);
		Если Соединение = Неопределено Тогда
			ПроверитьСоздатьСоединениеВебСокет(Слушатель, Клиент, ВыполнитьАвторизацию);
		Иначе
			Состояние 	= Соединение.ПолучитьСостояние();
			Если Состояние = СостояниеWebSocketСоединения.Закрыто ИЛИ Состояние = СостояниеWebSocketСоединения.Закрывается Тогда
				ПроверитьСоздатьСоединениеВебСокет(Слушатель, Клиент, ВыполнитьАвторизацию);	
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция АдресаВебСокетОКХ_Приват()
	
	Структура = Новый Структура();
	Структура.Вставить("Адрес", 	"wss://ws.okx.com:8443/ws/v5/private");
	Структура.Вставить("АдресДемо", "wss://wspap.okx.com:8443/ws/v5/private");
	
	Возврат Структура;
		
КонецФункции

Функция АдресВебСокет_Паблик()
	
	Структура = Новый Структура();
	Структура.Вставить("Адрес", 	"wss://ws.okx.com:8443/ws/v5/public");
	Структура.Вставить("АдресДемо", "wss://wspap.okx.com:8443/ws/v5/public");
	
	Возврат Структура;
		
КонецФункции

#КонецОбласти //СлужебныеПроцедурыФункции  


#Область ОнлайнПодписки

Функция СформироватьНеобходимыеПакеты(Адрес)

	МассивПакетов = Новый Массив;
	
	ПриватАдреса 	= АдресаВебСокетОКХ_Приват();
	Если Адрес = ПриватАдреса.Адрес ИЛИ Адрес = ПриватАдреса.АдресДемо Тогда
		
		ПараметрыОперацииБиржи = ПараметрыПодпискиНаОбновлениеОрдеров();
		МассивПакетов.Добавить(ПараметрыОперацииБиржи);
		
		ПараметрыОперацииБиржи = ПараметрыПодпискиНаОбновлениеПозиций();
		МассивПакетов.Добавить(ПараметрыОперацииБиржи);
	КонецЕсли;
	
	// Для паблик данных пока что не требуется постоянно поддерживать какие то подписки,
	// но если потребуется это должно жить здесь
	
	//ПабликАдреса	= АдресВебСокет_Паблик();
	//Если Адрес = ПабликАдреса.Адрес ИЛИ Адрес = ПабликАдреса.АдресДемо Тогда
	//	
	//КонецЕсли;
	
	Возврат МассивПакетов;
	
КонецФункции

Функция ПараметрыПодпискиНаОбновлениеОрдеров()
		
	Параметры = биг_ОКХ_ВебСокет_КлиентСервер.СП_Подписка_ИзмененияОрдеров();
	Параметры.op = "subscribe"; 
	
	МассивАргументов = Новый Массив();
	Аргумент = биг_ВебСокет_КлиентСервер.Опис_ИзмененияОрдеров_Аргументы();
	Аргумент.ИнструментТип = "SPOT";
	МассивАргументов.Добавить(Аргумент);
	
	Аргумент = биг_ВебСокет_КлиентСервер.Опис_ИзмененияОрдеров_Аргументы();
	Аргумент.ИнструментТип = "SWAP";
	МассивАргументов.Добавить(Аргумент);
	
	Аргумент = биг_ВебСокет_КлиентСервер.Опис_ИзмененияОрдеров_Аргументы();
	Аргумент.ИнструментТип = "FUTURES";
	МассивАргументов.Добавить(Аргумент);
	
	Аргумент = биг_ВебСокет_КлиентСервер.Опис_ИзмененияОрдеров_Аргументы();
	Аргумент.ИнструментТип = "MARGIN";
	МассивАргументов.Добавить(Аргумент);
	
	Параметры.args = биг_ОКХ_ВебСокет_КлиентСервер.СП_Аргументы_ИзмененияОрдеров(МассивАргументов);
	биг_ОбщегоНазначенияКлиентСервер.УдалитьНеЗаполненныеПараметры(Параметры);
	
	Возврат Параметры;
		
КонецФункции

Функция ПараметрыПодпискиНаОбновлениеПозицийИБалансов()
	
	Параметры = биг_ОКХ_ВебСокет_КлиентСервер.СП_Подписка_БалансыИПозиции();
	биг_ОбщегоНазначенияКлиентСервер.УдалитьНеЗаполненныеПараметры(Параметры);
	
	Возврат Параметры;
	
КонецФункции

Функция ПараметрыПодпискиНаОбновлениеПозиций()

	Параметры = биг_ОКХ_ВебСокет_КлиентСервер.СП_Подписка_Позиции();
	
	МассивАргументов = Новый Массив;
	
	Аргумент = биг_ОКХ_ВебСокет_КлиентСервер.СП_Подписка_Позиции_Аргумент();
	Аргумент.instType = "MARGIN";
	МассивАргументов.Добавить(Аргумент);
	
	Аргумент = биг_ОКХ_ВебСокет_КлиентСервер.СП_Подписка_Позиции_Аргумент();
	Аргумент.instType = "SWAP";
	МассивАргументов.Добавить(Аргумент);
	
	Аргумент = биг_ОКХ_ВебСокет_КлиентСервер.СП_Подписка_Позиции_Аргумент();
	Аргумент.instType = "FUTURES";
	МассивАргументов.Добавить(Аргумент);
	
	Аргумент = биг_ОКХ_ВебСокет_КлиентСервер.СП_Подписка_Позиции_Аргумент();
	Аргумент.instType = "OPTION";
	МассивАргументов.Добавить(Аргумент);
	
	Параметры.args = МассивАргументов;
	биг_ОбщегоНазначенияКлиентСервер.УдалитьНеЗаполненныеПараметры(Параметры);
	
	Возврат Параметры;
	
КонецФункции


#КонецОбласти //ОнлайнПодписки