////////////////////////////////////////////////////////////////////////////////
// Подсистема "Выгрузка загрузка данных".
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает список объектов метаданных, имеющих свойства, для которых используется тип ХранилищеЗначения.
// 
// Возвращаемое значение: 
//	см. ВыгрузкаЗагрузкаДанныхСлужебный.СсылкиНаТипы
//
Функция СписокОбъектовМетаданныхИмеющихХранилищеЗначения() Экспорт
	
	Типы = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
		Тип("ХранилищеЗначения"));
	
	Возврат ВыгрузкаЗагрузкаДанныхСлужебный.СсылкиНаТипы(Типы);
	
КонецФункции

#КонецОбласти
