
  
#Область ПрограммныйИнтерфейс


#Область НСИ

Функция GET_DownloadCandles(ПараметрыОперацииБиржи) Экспорт
		
	Ответ = биг_ОКХАпиСервер.GET_Candles(ПараметрыОперацииБиржи);
	
	Если Ответ["code"] <> "0" Тогда		
		Сообщить(Ответ["msg"]);
		Результат = Ложь;		
	Иначе 	
		ОбработатьОтветБиржиПоДаннымСвечей(ПараметрыОперацииБиржи, Ответ);
		Результат = Истина;
	КонецЕсли;	
	
	биг_ОбщегоНазначения.Пауза(0.06);
	
	Возврат Результат;
	
КонецФункции

Функция GET_Candles(ПараметрыОперацииБиржи) Экспорт
		
	Ответ = биг_ОКХАпиСервер.GET_Candles(ПараметрыОперацииБиржи);
	
	МассивСвечей = Новый Массив();
	
	Если Ответ["code"] <> "0" Тогда		
		Сообщить(Ответ["msg"]);		
	Иначе		
		МассивСвечей = СформироватьМассивСвечей(Ответ["data"]);		
	КонецЕсли;	
	
	биг_ОбщегоНазначения.Пауза(0.06);
	
	Возврат МассивСвечей;
	
КонецФункции

Функция GET_CandlesHistory(ПараметрыОперацииБиржи) Экспорт

	Ответ 	= биг_ОКХАпиСервер.GET_CandlesHistory(ПараметрыОперацииБиржи);	
	
	Если Ответ["code"] <> "0" Тогда		
		Сообщить(Ответ["msg"]);
		Результат = Ложь;		
	Иначе 	
		ОбработатьОтветБиржиПоДаннымСвечей(ПараметрыОперацииБиржи, Ответ);
		Результат = Истина;
	КонецЕсли;
	
	биг_ОбщегоНазначения.Пауза(0.11);
	
	Возврат Результат;
	
КонецФункции

Функция GET_CandlesHistoryData(ПараметрыОперацииБиржи) Экспорт

	Ответ 			= биг_ОКХАпиСервер.GET_CandlesHistory(ПараметрыОперацииБиржи);	
	МассивСвечей 	= Новый Массив(); 
	
	Если Ответ["code"] <> "0" Тогда		
		Сообщить(Ответ["msg"]);		
	Иначе 	
		МассивСвечей = СформироватьМассивСвечей(Ответ["data"]);
	КонецЕсли;
	
	биг_ОбщегоНазначения.Пауза(0.11);
	
	Возврат МассивСвечей;
	
КонецФункции

Функция GET_DownloadInstruments(ПараметрыОперацииБиржи) Экспорт

	Аккаунт = биг_ОбщегоНазначенияКлиентСервер.ПолучитьЗначениеПоИмени("OKXDemoAccount");
	Ответ 	= биг_ОКХАпиСервер.GET_Instruments(ПараметрыОперацииБиржи, Аккаунт);
	Market 	= БиржаOKX();
	
	Если Ответ["code"] = "0" Тогда
		
		МассивДанныхОбИнструментах = Ответ["data"];	
		
		Для Каждого Data Из МассивДанныхОбИнструментах Цикл
			
			СоздатьОбновитьИнструмент(Data, Market);				
		КонецЦикла;                                     
		Результат = Истина;
	Иначе
		
		Сообщить(Ответ["msg"]);
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

Функция GET_DownloadCurrencies(ПараметрыОперацииБиржи, Аккаунт) Экспорт
	
	Ответ 	= биг_ОКХАпиСервер.GET_DownloadCurrencies(ПараметрыОперацииБиржи, Аккаунт);
	Market 	= БиржаOKX();
	
	Если Ответ["code"] = "0" Тогда
		
		МассивДанных = Ответ["data"];	
		
		Для Каждого Data Из МассивДанных Цикл
			
			СоздатьОбновитьМонеты(Data);				
		КонецЦикла;                                     
		Результат = Истина;
	Иначе
		
		Сообщить(Ответ["msg"]);
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 


Функция GET_Price(ПараметрыОперацииБиржи) Экспорт

	Ответ 	= биг_ОКХАпиСервер.GET_Price(ПараметрыОперацииБиржи);
	Market 	= БиржаOKX();
	
	Если Ответ["code"] = "0" Тогда
		
		МассивДанныхОбИнструментах = Ответ["data"];	
		
		Для Каждого Data Из МассивДанныхОбИнструментах Цикл
			
			Результат =  Число(Data["markPx"]);				
		КонецЦикла;                                     
		
	Иначе
		
		Сообщить(Ответ["msg"]);
		Результат = Неопределено;
	КонецЕсли;
	
	биг_ОбщегоНазначения.Пауза(0.21);
	
	Возврат Результат;
	
КонецФункции

Функция GET_PriceTickers(ПараметрыОперацииБиржи) Экспорт

	Ответ 	= биг_ОКХАпиСервер.GET_PriceTickers(ПараметрыОперацииБиржи);
	Market 	= БиржаOKX();
	
	Если Ответ["code"] = "0" Тогда
		
		МассивДанныхОбИнструментах = Ответ["data"];	
		
		Для Каждого Data Из МассивДанныхОбИнструментах Цикл
			
			Если Data["instId"] = ПараметрыОперацииБиржи.instId Тогда
				Результат = Data["last"];
				Прервать;
			КонецЕсли;							
		КонецЦикла;                                     
		
	Иначе
		
		Сообщить(Ответ["msg"]);
		Результат = Неопределено;
	КонецЕсли;
	
	биг_ОбщегоНазначения.Пауза(0.11);
	
	Возврат Результат;
	
КонецФункции

// Реализация вызова метода API
Функция GET_Tickers(ПараметрыОперацииБиржи) Экспорт
	
	Ответ 	= биг_ОКХАпиСервер.GET_Tickers(ПараметрыОперацииБиржи);
	
	Если Ответ["code"] = "0" Тогда
		
		МассивДанных 	= Ответ["data"];
		
		ТипЧисло 	= ОбщегоНазначения.ОписаниеТипаЧисло(30, 8);
		ТипСтрока	= ОбщегоНазначения.ОписаниеТипаСтрока(100);
		Таблица 	= Новый ТаблицаЗначений;
		
		// Добавление колонок с русскими названиями
		Таблица.Колонки.Добавить("Инструмент", 				Новый ОписаниеТипов("СправочникСсылка.big_Instruments")); // Ссылка на инструмент
		Таблица.Колонки.Добавить("ТипИнструмента", 			ТипСтрока); // instType
		Таблица.Колонки.Добавить("ИнструментИД", 			ТипСтрока); // instId
		Таблица.Колонки.Добавить("ПоследняяЦена", 			ТипЧисло); // last
		Таблица.Колонки.Добавить("РазмерПоследнейСделки", 	ТипЧисло); // lastSz
		Таблица.Колонки.Добавить("ЦенаПредложения", 		ТипЧисло); // askPx
		Таблица.Колонки.Добавить("РазмерПредложения", 		ТипЧисло); // askSz
		Таблица.Колонки.Добавить("ЦенаСпроса", 				ТипЧисло); // bidPx
		Таблица.Колонки.Добавить("РазмерСпроса", 			ТипЧисло); // bidSz
		Таблица.Колонки.Добавить("Открытие24ч", 			ТипЧисло); // open24h
		Таблица.Колонки.Добавить("Максимум24ч", 			ТипЧисло); // high24h
		Таблица.Колонки.Добавить("Минимум24ч", 				ТипЧисло); // low24h
		Таблица.Колонки.Добавить("Объем24ч_ВВалюте", 		ТипЧисло); // volCcy24h
		Таблица.Колонки.Добавить("Объем24ч", 				ТипЧисло); // vol24h
		Таблица.Колонки.Добавить("ОбъемСодUTC0", 			ТипЧисло); // sodUtc0
		Таблица.Колонки.Добавить("ОбъемСодUTC8", 			ТипЧисло); // sodUtc8
		Таблица.Колонки.Добавить("ВремяСервера", 			ТипЧисло); // ts
		
		// Заполнение таблицы данными
		Для Каждого Соответствие Из МассивДанных Цикл
			НоваяСтрока = Таблица.Добавить();
			
			НоваяСтрока.Инструмент 				= Справочники.big_Instruments.НайтиПоРеквизиту("instId", Соответствие["instId"]);
			НоваяСтрока.ТипИнструмента 			= Соответствие["instType"];
			НоваяСтрока.ИнструментИД 			= Соответствие["instId"];
			НоваяСтрока.ПоследняяЦена 			= Число(Соответствие["last"]);
			НоваяСтрока.РазмерПоследнейСделки 	= Число(Соответствие["lastSz"]);
			НоваяСтрока.ЦенаПредложения 		= Число(Соответствие["askPx"]);
			НоваяСтрока.РазмерПредложения 		= Число(Соответствие["askSz"]);
			НоваяСтрока.ЦенаСпроса 				= Число(Соответствие["bidPx"]);
			НоваяСтрока.РазмерСпроса 			= Число(Соответствие["bidSz"]);
			НоваяСтрока.Открытие24ч 			= Число(Соответствие["open24h"]);
			НоваяСтрока.Максимум24ч 			= Число(Соответствие["high24h"]);
			НоваяСтрока.Минимум24ч 				= Число(Соответствие["low24h"]);
			НоваяСтрока.Объем24ч_ВВалюте 		= Число(Соответствие["volCcy24h"]);
			НоваяСтрока.Объем24ч 				= Число(Соответствие["vol24h"]);
			НоваяСтрока.ОбъемСодUTC0 			= Число(Соответствие["sodUtc0"]);
			НоваяСтрока.ОбъемСодUTC8 			= Число(Соответствие["sodUtc8"]);
			НоваяСтрока.ВремяСервера 			= Число(Соответствие["ts"]);
		КонецЦикла;
		
		Результат 		= Таблица;		
	Иначе
		
		Сообщить(Ответ["msg"]);
		Результат = Неопределено;
	КонецЕсли;
	
	биг_ОбщегоНазначения.Пауза(0.11);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти //НСИ


#Область Аккаунт

Функция GET_AccountBalance(ПараметрыОперацииБиржи, Аккаунт) Экспорт
	
	ОтветПоБаллансу = биг_ОКХАпиСервер.GET_AccountBallance(Аккаунт);

	Если ОтветПоБаллансу["code"] <> "0" Тогда 
		
		Сообщить(ОтветПоБаллансу["msg"]);
		Результат = Ложь;
	Иначе
		
		data = ОтветПоБаллансу["data"];		
		ЗафиксироватьОбщуюИнформациюОБалансе(data, Аккаунт);
		Результат = Истина;
	КонецЕсли;	          
	
	Возврат Результат;
		
КонецФункции 

Функция GET_AccountConfiguration(Аккаунт) Экспорт
	
	Ответ = биг_ОКХАпиСервер.GET_AccountConfig(Аккаунт);

	Если Ответ["code"] <> "0" Тогда 
		
		Сообщить(Ответ["msg"]);
		Результат = Ложь;
	Иначе
		
		data = Ответ["data"];		
		ОбновитьДанныеАккаунтаOKX(data, Аккаунт);
		Результат = Истина;
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции

Функция POST_SetLeverage(ПараметрыОперацииБиржи, Аккаунт) Экспорт
	
	Ответ = биг_ОКХАпиСервер.POST_SetLeverage(ПараметрыОперацииБиржи, Аккаунт);

	Если Ответ["code"] <> "0" Тогда 
		
		Сообщить(Ответ["msg"]);
		Результат = Ложь;
	Иначе
		
		data = Ответ["data"];		
		Результат = Истина;
	КонецЕсли;	          
	
	биг_ОбщегоНазначения.Пауза(0.11);
	
	Возврат Результат;
		
КонецФункции

Функция POST_SetAccountMode(ПараметрыОперацииБиржи, Аккаунт) Экспорт
	
	Ответ = биг_ОКХАпиСервер.POST_SetAccountMode(ПараметрыОперацииБиржи, Аккаунт);

	Если Ответ["code"] <> "0" Тогда 
		
		Сообщить(Ответ["msg"]);
		Результат = Ложь;
	Иначе
		
		data = Ответ["data"];		
		Результат = Истина;
	КонецЕсли;	          
	
	биг_ОбщегоНазначения.Пауза(0.11);
	
	Возврат Результат;
		
КонецФункции

Функция POST_SetPositionMode(ПараметрыОперацииБиржи, Аккаунт) Экспорт
	
	Ответ = биг_ОКХАпиСервер.POST_SetPositionMode(ПараметрыОперацииБиржи, Аккаунт);

	Если Ответ["code"] <> "0" Тогда 
		
		Сообщить(Ответ["msg"]);
		Результат = Ложь;
	Иначе
		
		data = Ответ["data"];		
		Результат = Истина;
	КонецЕсли;	          
	
	биг_ОбщегоНазначения.Пауза(0.41);
	
	Возврат Результат;
		
КонецФункции

Функция GET_Bills(ПараметрыОперацииБиржи, Аккаунт) Экспорт

	Ответ = биг_ОКХАпиСервер.GET_Bills(ПараметрыОперацииБиржи, Аккаунт);

	Если Ответ["code"] <> "0" Тогда 
		
		Сообщить(Ответ["msg"]);
		Результат = Ложь;
	Иначе
		
		data = Ответ["data"];		

		Результат = Истина;
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции

Функция GET_BillsThreeMonths(ПараметрыОперацииБиржи, Аккаунт) Экспорт

	Ответ = биг_ОКХАпиСервер.GET_BillsThreeMonths(ПараметрыОперацииБиржи, Аккаунт);

	Если Ответ["code"] <> "0" Тогда 
		
		Сообщить(Ответ["msg"]);
		Результат = Ложь;
	Иначе
		
		data = Ответ["data"];		
		
		Результат = Истина;
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции


#КонецОбласти //Аккаунт


#Область Ордер

Функция POST_PlaceOrder(ПараметрыОперацииБиржи, Аккаунт) Экспорт
		
	// создать JSON по структуре
	//JSON = Ордер_СформироватьСтруктуруЗапроса(Order);	
	
	// отправить документ
	Ответ = биг_ОКХАпиСервер.POST_PlaceOrders(ПараметрыОперацииБиржи, Аккаунт);
	
	Если Ответ["code"] <> "0" Тогда 
		
		Сообщить(Ответ["msg"]);
		
		data = Ответ["data"];
		Если data <> Неопределено Тогда
			
			Для каждого Соответствие Из data Цикл
				
				КодОшибки 		= Соответствие["sCode"];
				ТекстОшибки		= Соответствие["sMsg"];
				Идентификатор 	= Соответствие["clOrdId"];
				
				UUID 			= биг_ОбщегоНазначенияКлиентСервер.ДополнитьUUIDразделителями(Соответствие["clOrdId"]);
				UUID			= Новый УникальныйИдентификатор(UUID);
				Ордер 			= Документы.big_Order_OKX.ПолучитьСсылку(UUID);
				АлгоОрдер		= Документы.big_AlgoOrders_OKX.ПолучитьСсылку(UUID);
				
				ДокументОшибки	= ?(ЗначениеЗаполнено(Ордер), Ордер, АлгоОрдер);
				
				Шаблон 			= "Inner object: %1, error code: %2, error text: %3";
				ТекстОшибки		= СтрШаблон(Шаблон, ДокументОшибки, КодОшибки, ТекстОшибки);
				Сообщить(ТекстОшибки);
				
			КонецЦикла;
		КонецЕсли;		
		Результат = Ложь;
		
	Иначе
		
		data = Ответ["data"];		
		Для каждого OrderData Из data Цикл
			//после запуска WebSocket не нужно, вызывает конфликт. Инфа об ордере прилетит через вебсокет.
			//Ордер_Отправка_ЗафиксироватьОтвет(OrderData, Аккаунт);
			Ордер_Отправка_АктуализироватьАлгоОрдера(OrderData, Аккаунт);
		КонецЦикла;
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция GET_OrderDetails(ПараметрыОперацииБиржи, Аккаунт) Экспорт
	
	Ответ = биг_ОКХАпиСервер.GET_OrderDetails(ПараметрыОперацииБиржи, Аккаунт);
	
	Если Ответ["code"] <> "0" Тогда 
		
		Сообщить(Ответ["msg"]);	
		Результат = Ложь;
	Иначе
		
		data = Ответ["data"];		
		Для каждого OrderData Из data Цикл
			
			Ордер_СоздатьДополнитьПоОтвету(OrderData, Аккаунт); 		 	
		КонецЦикла;
		Результат = Истина;
	КонецЕсли;             
	
	Возврат Результат;
	
КонецФункции

Функция POST_AmendOrder() Экспорт
	
	Результат = Ложь;
	
	//Если СтруктураИзменений.Количество() = 0 Тогда
	//	Сообщить("Структура не содержит полей для изменения");
	//	Возврат;
	//КонецЕсли;
	//
	//АлгоОбъект = АлгоОрдер.ПолучитьОбъект();
	//
	////обязательные параметры	
	////RequestParameters = Новый Структура("ordId", АлгоОрдер_НайтиИдентификаторОсновногоОрдера(АлгоОрдер));
	////
	//
	//RequestParameters = Новый Структура("clOrdId", АлгоОрдер.attachAlgoClOrdId);
	//RequestParameters.Вставить("instId", АлгоОрдер.Instrument.instId);
	//
	//// необязательные параметры
	//Для каждого Элемент Из СтруктураИзменений Цикл
	//	
	//	АлгоОбъект[Элемент.Ключ] 	= Элемент.Значение;		
	//	ИмяНовогоПараметра 			= "new" + ВРег(Лев(Элемент.Ключ, 1)) + Сред(Элемент.Ключ, 2);
	//	
	//	биг_ОбщегоНазначенияКлиентСервер.ADDParameterIfNotEmpty(RequestParameters, Элемент.Значение, ИмяНовогоПараметра);	
	//КонецЦикла;
	//
	//Ответ = биг_ОКХАпиСервер.POST_AmendOrder(RequestParameters, АлгоОрдер.Аккаунт);

	//Если Ответ["code"] <> "0" Тогда 
	//	Сообщить(Ответ["msg"]);
	//	
	//	data = Ответ["data"];
	//	Если data <> Неопределено Тогда
	//		
	//		Для каждого Соответствие Из data Цикл
	//			
	//			КодОшибки 		= Соответствие["sCode"];
	//			ТекстОшибки		= Соответствие["sMsg"];				
	//			ДокументОшибки	= АлгоОрдер;
	//			
	//			Шаблон 			= "Inner object: %1, error code: %2, error text: %3";
	//			ТекстОшибки		= СтрШаблон(Шаблон, ДокументОшибки, КодОшибки, ТекстОшибки);
	//			Сообщить(ТекстОшибки);
	//			
	//		КонецЦикла;
	//	КонецЕсли;		
	//		
	//Иначе
	//	
	//	АлгоОбъект.Записать(РежимЗаписиДокумента.Запись);		
	//КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция POST_CancelOrder() Экспорт

	Результат = Ложь;
	
	Возврат Результат;
	
КонецФункции

Функция GET_PendingOrders(ПараметрыОперацииБиржи, Аккаунт) Экспорт
	
	Ответ = биг_ОКХАпиСервер.GET_PendingOrders(ПараметрыОперацииБиржи, Аккаунт);

	Если Ответ["code"] <> "0" Тогда 
		
		Сообщить(Ответ["msg"]);
		Результат = Ложь;
	Иначе
		
		data = Ответ["data"];
		
		Для каждого dataSet Из data Цикл
			Ордер_СоздатьДополнитьПоОтвету(dataSet, Аккаунт, Истина);		
		КонецЦикла;      
		
		ЗапуститьВосстановлениеПоследовательностиВФоне();
		
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция GET_OrdersHistory_7(ПараметрыОперацииБиржи, Аккаунт) Экспорт
						
	Ответ = биг_ОКХАпиСервер.GET_OrdersHistory_7(ПараметрыОперацииБиржи, Аккаунт);
	Количество = 0;
	
	Если Ответ["code"] <> "0" Тогда 
		
		Сообщить(Ответ["msg"]);
		Результат = Ложь;
	Иначе
		
		data = Ответ["data"];
		
		МинДата 	= ТекущаяДатаСеанса();
		МаксДата 	= Дата(1,1,1);
		
		Для каждого OrderData Из data Цикл
			
			ДатаОрдераТС 	= OrderData["cTime"];
			ДатаОрдера		= биг_ОбщегоНазначенияКлиентСервер.TimestampВДату(ДатаОрдераТС);
			МинДата			= ?(ДатаОрдера < МинДата, ДатаОрдера, МинДата);
			МаксДата		= ?(ДатаОрдера > МаксДата, ДатаОрдера, МаксДата);
			
			Ордер_СоздатьДополнитьПоОтвету(OrderData, Аккаунт, Истина);
			Количество = Количество + 1;
		КонецЦикла;		
		
		ЗапуститьВосстановлениеПоследовательностиВФоне();
		
		Результат = Истина;
	КонецЕсли;             
	
	СтруктураОтвет = Новый Структура();
	СтруктураОтвет.Вставить("Результат", Результат);
	СтруктураОтвет.Вставить("МинДата", МинДата);
	СтруктураОтвет.Вставить("МаксДата", МаксДата);
	СтруктураОтвет.Вставить("Количество", Количество);
	
	
	Возврат СтруктураОтвет;
	
КонецФункции

#КонецОбласти //Ордер


#Область АлгоОрдер

Функция POST_PlaceAlgoOrder(ПараметрыОперацииБиржи, Аккаунт) Экспорт		
												
	Ответ = биг_ОКХАпиСервер.POST_PlaceAlgoOrder(ПараметрыОперацииБиржи, Аккаунт);
	
	Если Ответ["code"] <> "0" Тогда 
				
		АлгоОрдер_ВывестиТекстОтветаБезОбработки(Ответ);
		Результат = Ложь;
	Иначе
		
		data = Ответ["data"];		
		Для каждого НаборДанных Из data Цикл
			// после запуска WebSocket не нужно, вызывает конфликт. Инфа об ордере прилетит через вебсокет.
			// однако для АлгоОрдеров отдельный канал и он доступен только в подписке Бизнес
			АлгоОрдер_Place_ОбработатьПоложительныйОтвет(НаборДанных);
		КонецЦикла;
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция GET_AlgoOrderDetails(ПараметрыОперацииБиржи, Аккаунт) Экспорт
	
	Ответ = биг_ОКХАпиСервер.GET_AlgoOrderDetails(ПараметрыОперацииБиржи, Аккаунт);
	
	Если Ответ["code"] <> "0" Тогда 
		
		Сообщить(Ответ["msg"]);
		Результат = Ложь;
	Иначе
		
		data = Ответ["data"];		
		Для каждого Данные Из data Цикл			
			АлгоОрдер_СоздатьДополнитьПоОтвету(Данные, Аккаунт); 		 	
		КонецЦикла;
		
		Результат = Истина;
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

Функция POST_AmendAlgoOrder(ПараметрыОперацииБиржи, Аккаунт) Экспорт
	
	Ответ = биг_ОКХАпиСервер.POST_AmendAlgoOrder(ПараметрыОперацииБиржи, Аккаунт);
	
	Если Ответ["code"] <> "0" Тогда 
				
		АлгоОрдер_ВывестиТекстОтветаБезОбработки(Ответ);
		Результат = Ложь;
	Иначе
				
		АлгоОрдер_Изменить_ПрименитьКДокументу(ПараметрыОперацииБиржи);
		Результат = Истина;
	КонецЕсли;             
	
	Возврат Результат;
	
КонецФункции

Функция GET_AlgoOrderHistory(ПараметрыОперацииБиржи, Аккаунт) Экспорт
	
	Ответ = биг_ОКХАпиСервер.GET_AlgoOrderHistory(ПараметрыОперацииБиржи, Аккаунт);
	
	Если Ответ["code"] <> "0" Тогда 
		
		Сообщить(Ответ["msg"]);
		Результат = Ложь;
	Иначе
		
		data = Ответ["data"];		
		Для каждого Данные Из data Цикл			
			АлгоОрдер_СоздатьДополнитьПоОтвету(Данные, Аккаунт); 		 	
		КонецЦикла;
		
		Результат = Истина;
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

Функция GET_AlgoOrderList(ПараметрыОперацииБиржи, Аккаунт) Экспорт
	
	Ответ = биг_ОКХАпиСервер.GET_AlgoOrderList(ПараметрыОперацииБиржи, Аккаунт);
	
	Если Ответ["code"] <> "0" Тогда 
		
		Сообщить(Ответ["msg"]);
		Результат = Ложь;
	Иначе
		
		data = Ответ["data"];		
		Для каждого Данные Из data Цикл			
			АлгоОрдер_СоздатьДополнитьПоОтвету(Данные, Аккаунт); 		 	
		КонецЦикла;
		
		Результат = Истина;
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

Функция POST_CancelAlgoOrder(ПараметрыОперацииБиржи, Аккаунт) Экспорт
	
	Ответ = биг_ОКХАпиСервер.POST_CancelAlgoOrder(ПараметрыОперацииБиржи, Аккаунт);
	
	Если Ответ["code"] <> "0" Тогда 
				
		АлгоОрдер_ВывестиТекстОтветаБезОбработки(Ответ);
		Результат = Ложь;
	Иначе
		
		data = Ответ["data"];		
		Для каждого НаборДанных Из data Цикл
			
			//	Вызвать метод по актуализации ордера
			ПараметрыОперации = биг_МаркетАпиКлиентСервер.СтруктураЗапроса_АктуализироватьАлгоОрдер();
			ПараметрыОперации.algoId = НаборДанных["algoId"];
			GET_AlgoOrderDetails(ПараметрыОперации, Аккаунт);	
			
		КонецЦикла;
		Сообщить("АлгоОрдер отменен - нужен обработчик успешного события");
		Результат = Истина;
	КонецЕсли;

	Возврат Результат;
КонецФункции

#КонецОбласти //АлгоОрдер


#Область Позиция

Функция GET_Positions(ПараметрыОперацииБиржи, Аккаунт) Экспорт

	Ответ 		= биг_ОКХАпиСервер.GET_Positions(ПараметрыОперацииБиржи, Аккаунт);	
	Результат 	= Ложь;
	
	Если Ответ["code"] <> "0" Тогда 
		Сообщить(Ответ["msg"]);		
	Иначе
		
		data = Ответ["data"];		
		Для каждого PositionData Из data Цикл
			
			Позиция_СоздатьДополнитьПоОтвету(PositionData, Аккаунт);
			//ЗафиксироватьИнформациюОПозицииВРегистр(Аккаунт, ПараметрыОперацииБиржи.instId, PositionData);
		КонецЦикла;
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

Функция GET_PositionHistory(ПараметрыОперацииБиржи, Аккаунт) Экспорт
	
	Ответ = биг_ОКХАпиСервер.GET_PositionHistory(ПараметрыОперацииБиржи, Аккаунт);
	Результат = Ложь;
	
	Если Ответ["code"] <> "0" Тогда 
		Сообщить(Ответ["msg"]);		
	Иначе
		
		data = Ответ["data"];		
		Для каждого PositionData Из data Цикл
			
			Позиция_СоздатьДополнитьПоОтвету(PositionData, Аккаунт); 		 	
		КонецЦикла;
		Результат = Истина;		
	КонецЕсли;
	
КонецФункции

Функция POST_ClosePosition(ПараметрыОперацииБиржи, Аккаунт) Экспорт
	
	Ответ 		= биг_ОКХАпиСервер.POST_ClosePositions(ПараметрыОперацииБиржи, Аккаунт);
	Результа 	= Ложь;
	
	Если Ответ["code"] <> "0" Тогда 
		Сообщить(Ответ["msg"]);	
	Иначе
		
		data = Ответ["data"];		
		Для каждого PositionData Из data Цикл
			   		
			ДокументОбъект 						= Документы.big_Positions_OKX.НайтиПоРеквизиту("posId", ПараметрыОперацииБиржи.posId).ПолучитьОбъект();
			ДокументОбъект.Статус				= Перечисления.big_СтатусыТорговыхОбъектов.Исполнен;
			ДокументОбъект.ЗакрытПринудительно	= Истина;
			Попытка
				ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
				Результат = Истина;
			Исключение
				
				Информация = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				ЗаписьЖурналаРегистрации("OKX.POST_ClosePosition", УровеньЖурналаРегистрации.Ошибка, 
										Метаданные.Документы.big_Positions_OKX, ДокументОбъект.Ссылка, Информация);
			КонецПопытки;			
		КонецЦикла;		
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти //Позиция


#КонецОбласти //ПрограммныйИнтерфейс 


#Область РаботаСОрдерами
 
#Область Order_Технические

Функция Ордер_СформироватьСтруктуруЗапроса(Order)

	//instId,tdMode,ccy,clOrdId,tag,side,posSide,ordType,sz,
	//px,pxUsd,pxVol,reduceOnly,tgtCcy,banAmend,quickMgnType,stpId,stpMode,attachAlgoOrds
	
	JSON 	= Ордер_ПолучитьСтруктуруДляЗаполненияJSON();
	Объект 	= Order.ПолучитьОбъект();
	
	Для каждого Элемент Из JSON Цикл
		
		НазваниеРеквизита 	= Элемент.Ключ;
		Реквизит 			= Объект[НазваниеРеквизита];
		ТипРеквизита 		= ТипЗнч(Реквизит);
		
		Если ТипРеквизита = Тип("Строка") Тогда
			
			JSON[НазваниеРеквизита] = Реквизит; 
			
		ИначеЕсли ТипРеквизита = Тип("Число") Тогда 
			
			JSON[НазваниеРеквизита] = Формат(Реквизит, "ЧЦ=30; ЧДЦ=8; ЧРД=.; ЧГ=0");
			
		Иначе
			
			JSON[НазваниеРеквизита] = Строка(Реквизит);	
		КонецЕсли;
	КонецЦикла;
	   	
	СтрокаUUID 				= Order.УникальныйИдентификатор();
	СтрокаUUID 				= СтрЗаменить(СтрокаUUID, "-", ""); 
	JSON.clOrdId			= СтрокаUUID;
		                  
	биг_ОбщегоНазначенияКлиентСервер.УдалитьНеиспользуемыеКлючи(JSON);
	
	МассивАлгоОрдеров = Новый Массив;
	
	Для каждого Строка Из Order.attachAlgoOrds Цикл
		АлгоОрдер = АлгоОрдер_СформироватьСтруктуруЗапроса(Строка.AlgoOrder);
		МассивАлгоОрдеров.Добавить(АлгоОрдер);
	КонецЦикла;
	
	JSON.Вставить("attachAlgoOrds", МассивАлгоОрдеров);
	
	Возврат JSON;
	
КонецФункции  
     
Функция Ордер_ПолучитьСтруктуруДляЗаполненияJSON()

	Возврат Новый Структура("banAmend, instId,tdMode,ccy,clOrdId,tag,side,posSide,ordType,sz,px,pxUsd,pxVol,reduceOnly,tgtCcy,quickMgnType,stpId,stpMode");  
	
КонецФункции

Процедура Ордер_Отправка_ЗафиксироватьОтвет(OrderData, Аккаунт)

	ts 		= OrderData["ts"];
	tag 	= OrderData["tag"];
	sMsg 	= OrderData["sMsg"];
	sCode 	= OrderData["sCode"];
	ordId 	= OrderData["ordId"];
	clOrdId = OrderData["clOrdId"];
	
	Если ЗначениеЗаполнено(clOrdId) Тогда
		UUID 	= биг_ОбщегоНазначенияКлиентСервер.ДополнитьUUIDразделителями(OrderData["clOrdId"]);
		UUID	= Новый УникальныйИдентификатор(UUID);
		Ордер 	= Документы.big_Order_OKX.ПолучитьСсылку(UUID); 
		
		ОрдерОбъект = Ордер.ПолучитьОбъект();
		ОрдерОбъект.ordId 			= ordId;
		ОрдерОбъект.cTime13 		= ts;
		ОрдерОбъект.cTime10			= Лев(ts, 10);
		ОрдерОбъект.cTime			= Число(ОрдерОбъект.cTime10);
		ОрдерОбъект.cTimeDateTime 	= биг_ОбщегоНазначенияКлиентСервер.TimestampВДату(ОрдерОбъект.cTime);
		ОрдерОбъект.Комментарий 	= "ts = " + ts + ", sMsg = " + sMsg;
		ОрдерОбъект.Статус			= Перечисления.big_СтатусыТорговыхОбъектов.Активный;
		ОрдерОбъект.Аккаунт			= Аккаунт;
		
		Попытка
			ОрдерОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение			
			Ордер_ЗаписатьДокументВРежимеЗаписи(ОрдерОбъект);					
		КонецПопытки;
		
	Иначе
		
		Шаблон = "ts = %1, tag = %2, sMsg = %3, sCode = %4, ordId = %5, clOrdId = %6";
		Информация = СтрШаблон(Шаблон, ts, tag, sMsg, sCode, ordId, clOrdId); 
		ЗаписьЖурналаРегистрации("OKX.PlaceOrder", УровеньЖурналаРегистрации.Ошибка, Метаданные.Документы.big_Order_OKX,, Информация);
	КонецЕсли;
	     	
КонецПроцедуры

Функция Ордер_СоздатьДополнитьПоОтвету(OrderData, Аккаунт, ЗагрузкаИстории = Ложь) Экспорт

	clOrdId	= OrderData["clOrdId"];
	ordId	= OrderData["ordId"];
	
	Если ЗначениеЗаполнено(clOrdId) И СтрДлина(clOrdId) = 32 Тогда		
		UUID 	= биг_ОбщегоНазначенияКлиентСервер.ДополнитьUUIDразделителями(OrderData["clOrdId"]);
		Если ЗначениеЗаполнено(UUID) Тогда
			UUID	= Новый УникальныйИдентификатор(UUID);
			Ордер 	= Документы.big_Order_OKX.ПолучитьСсылку(UUID);
		Иначе
			Ордер 	= "Объект не найден";
		КонецЕсли;	
			 	
		Если СтрНайти(Ордер, "Объект не найден") <> 0 Тогда
	    	Ордер = Неопределено;
		КонецЕсли;
	КонецЕсли;	
	
	Если Ордер = Неопределено И ЗначениеЗаполнено(ordId) Тогда
		Ордер	= Документы.big_Order_OKX.НайтиПоРеквизиту("ordId", ordId);
		Если НЕ ЗначениеЗаполнено(Ордер) Тогда
			Ордер = Неопределено;	
		КонецЕсли;
	КонецЕсли;
	
	Если Ордер = Неопределено Тогда
		
		ДокументОбъект 		= Документы.big_Order_OKX.СоздатьДокумент();
		ДокументОбъект.Дата = ТекущаяДатаСеанса();		
	Иначе 	
		
		ДокументОбъект		= Ордер.ПолучитьОбъект();
	КонецЕсли;
		
	ПоляИсключения		= "algoClOrdId, uTime, attachAlgoOrds, linkedAlgoOrd";
	биг_ОбщегоНазначения.ЗаполнитьОбъектПоСоответствию(ДокументОбъект, OrderData, ПоляИсключения);
	Ордер_ЗаполнитьПоля(ДокументОбъект, OrderData);
	УстановитьВремяДокументаПоДаннымБиржи(ДокументОбъект, OrderData["cTime"]);
	
	ДокументОбъект.Аккаунт 		= Аккаунт; 
	ДокументОбъект.Стратегия 	= биг_СтратегииСервер.ОпределитьСтратегиюАккаунта(Аккаунт);
	Если ЗначениеЗаполнено(ДокументОбъект.Стратегия) Тогда
		ДокументОбъект.НастройкаСтратегии 	= биг_СтратегииСервер.ОпределитьНастройкуОперации(ДокументОбъект.Стратегия, Аккаунт, ДокументОбъект.instId);	
	КонецЕсли; 
	ДозаполнитьОрдерПоАлгоордеру(ДокументОбъект);
	
	
	linkedAlgoOrd = OrderData["linkedAlgoOrd"];
	ДокументОбъект.linkedAlgoOrd.Очистить();
	Для каждого Элемент Из linkedAlgoOrd Цикл
		Если ЗначениеЗаполнено(Элемент.Значение) Тогда
			НС = ДокументОбъект.linkedAlgoOrd.Добавить();
			НС.algoId = Элемент.Значение;
		КонецЕсли;			
	КонецЦикла;
	
	Попытка
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
		Если ЗагрузкаИстории Тогда                    
			МассивОпераций = Новый Массив();
			МассивОпераций.Добавить(ДокументОбъект.Ссылка);
			биг_СтратегииСервер.ЗафиксироватьОперацию(МассивОпераций);
		КонецЕсли;
	Исключение			
		Ордер_ЗаписатьДокументВРежимеЗаписи(ДокументОбъект);					
	КонецПопытки;
	
	Возврат ДокументОбъект.Ссылка;
	
КонецФункции 

Процедура Ордер_ЗаписатьОтветОРазмещении(OrderData, Order)
	
	ts 		= OrderData["ts"];
	sMsg	= OrderData["sMsg"];
	ordId	= OrderData["ordId"];
	
	ОрдерОбъект = Order.ПолучитьОбъект();
	
	ОрдерОбъект.Комментарий	= sMsg;
	ОрдерОбъект.ordId		= ordId;                      
	
	ОрдерОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

Процедура Ордер_ЗаполнитьПоля(ДокументОбъект, OrderData)
		
	АпдейтТС						= OrderData["uTime"];
	СоздТС                          = OrderData["cTime"];
	
	ДокументОбъект.cTime13			= СоздТС;
	ДокументОбъект.cTime10			= Лев(СоздТС, 10);
	ДокументОбъект.cTime			= Число(ДокументОбъект.cTime10);
	ДокументОбъект.cTimeDateTime	= биг_ОбщегоНазначенияКлиентСервер.TimestampВДату(ДокументОбъект.cTime);
	
	ДокументОбъект.uTime13			= АпдейтТС;
	ДокументОбъект.uTime10			= Лев(АпдейтТС, 10);
	ДокументОбъект.uTime			= Число(ДокументОбъект.cTime10);
	ДокументОбъект.uTimeDateTime	= биг_ОбщегоНазначенияКлиентСервер.TimestampВДату(ДокументОбъект.cTime);
	
	ДокументОбъект.instType 		= биг_ОбщегоНазначения.ПолучитьЗначениеПеречисления("big_OKX_InstrumentType", OrderData["instType"]); 
	ДокументОбъект.ordType          = биг_ОбщегоНазначения.ПолучитьЗначениеПеречисления("big_OKX_OrderTypes", OrderData["ordType"]);
	ДокументОбъект.posSide          = биг_ОбщегоНазначения.ПолучитьЗначениеПеречисления("big_OKX_PositionSides", OrderData["posSide"]);
	ДокументОбъект.side             = биг_ОбщегоНазначения.ПолучитьЗначениеПеречисления("big_OKX_OrderSides", OrderData["side"]);
	ДокументОбъект.slTriggerPxType  = биг_ОбщегоНазначения.ПолучитьЗначениеПеречисления("big_OKX_TriggerPxTypes", OrderData["slTriggerPxType"]);
	ДокументОбъект.stpMode          = биг_ОбщегоНазначения.ПолучитьЗначениеПеречисления("big_OKX_SelfTradePreventionModes", OrderData["stpMode"]);
	ДокументОбъект.tdMode           = биг_ОбщегоНазначения.ПолучитьЗначениеПеречисления("big_OKX_tdModes", OrderData["tdMode"]);
	//ДокументОбъект.tpOrdKind        = биг_ОбщегоНазначения.ПолучитьЗначениеПеречисления("big_OKX_TPOrderKinds", OrderData["tpOrdKind"]); // потому что веб сокет не отдает это поле, комент как костыль
	ДокументОбъект.tpTriggerPxType  = биг_ОбщегоНазначения.ПолучитьЗначениеПеречисления("big_OKX_TriggerPxTypes", OrderData["tpTriggerPxType"]); 	
	
КонецПроцедуры

Процедура Ордер_ЗаписатьДокументВРежимеЗаписи(ДокументОбъект)
	
	Попытка
		ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);	
	Исключение
		Информация = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации("OKX.PlaceOrder", УровеньЖурналаРегистрации.Ошибка, Метаданные.Документы.big_Order_OKX, ДокументОбъект.Ссылка, Информация);
	КонецПопытки;
	
КонецПроцедуры

Процедура ДозаполнитьОрдерПоАлгоордеру(ДокументОбъект)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	big_AlgoOrders_OKX.Ссылка КАК Ссылка,
	|	big_AlgoOrders_OKX.Стратегия КАК Стратегия,
	|	big_AlgoOrders_OKX.НастройкаСтратегии КАК НастройкаСтратегии,
	|	big_AlgoOrders_OKX.ТочкаНачалаПадения КАК ТочкаНачалаПадения,
	|	big_AlgoOrders_OKX.slTriggerPx КАК slTriggerPx,
	|	big_AlgoOrders_OKX.tpTriggerPx КАК tpTriggerPx
	|ИЗ
	|	Документ.big_AlgoOrders_OKX КАК big_AlgoOrders_OKX
	|ГДЕ
	|	big_AlgoOrders_OKX.ordId = &ordId";
	Запрос.УстановитьПараметр("ordId", ДокументОбъект.ordId);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		ДокументОбъект.Стратегия 			= Выборка.Стратегия;
		ДокументОбъект.НастройкаСтратегии 	= Выборка.НастройкаСтратегии;
		ДокументОбъект.ТочкаНачалаПадения	= Выборка.ТочкаНачалаПадения;
		
		Если ЗначениеЗаполнено(Выборка.slTriggerPx) Тогда
			ДокументОбъект.Событие = Перечисления.биг_ДаблИмпактEvents.ВыполнениеСтопЛосс;	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти //Order_Технические

#Область AlgoOrder_Технические

Функция АлгоОрдер_СформироватьСтруктуруЗапроса(Order)
	
	JSON 	= АлгоОРдер_ПолучитьСтруктуруДляЗаполненияJSON();	
	Объект 	= Order.ПолучитьОбъект();
	
	Для каждого Элемент Из JSON Цикл
		
		НазваниеРеквизита 	= Элемент.Ключ;
		Реквизит 			= Объект[НазваниеРеквизита];
		ТипРеквизита 		= ТипЗнч(Реквизит);
		
		Если ТипРеквизита = Тип("Строка") Тогда
			
			JSON[НазваниеРеквизита] = Реквизит; 
			
		ИначеЕсли ТипРеквизита = Тип("Число") Тогда 
			
			JSON[НазваниеРеквизита] = Формат(Реквизит, "ЧЦ=30; ЧДЦ=8; ЧРД=.; ЧГ=0");
			
		Иначе
			
			JSON[НазваниеРеквизита] = Строка(Реквизит);	
		КонецЕсли;
	КонецЦикла;
	
	СтрокаUUID 				= Order.УникальныйИдентификатор();
	СтрокаUUID 				= СтрЗаменить(СтрокаUUID, "-", ""); 
	JSON.attachAlgoClOrdId	= СтрокаUUID;
		                  
	биг_ОбщегоНазначенияКлиентСервер.УдалитьНеиспользуемыеКлючи(JSON);
	
	Возврат JSON;
	
КонецФункции  
     
Функция АлгоОРдер_ПолучитьСтруктуруДляЗаполненияJSON()

	Возврат Новый Структура("attachAlgoClOrdId, tpTriggerPx, tpOrdPx, tpOrdKind, tpTriggerPxType, slTriggerPx, slOrdPx, slTriggerPxType, sz, amendPxOnTriggerType, algoId");  
	
КонецФункции

Функция АлгоОрдер_СоздатьДополнитьПоОтвету(Data, Аккаунт)

	algoClOrdId	= Data["algoClOrdId"];
	algoId		= Data["algoId"];
	
	Если ЗначениеЗаполнено(algoClOrdId) И СтрДлина(algoClOrdId) = 32 Тогда		
		UUID 	= биг_ОбщегоНазначенияКлиентСервер.ДополнитьUUIDразделителями(Data["algoClOrdId"]);
		Если ЗначениеЗаполнено(UUID) Тогда
			UUID	= Новый УникальныйИдентификатор(UUID);
			Ордер 	= Документы.big_AlgoOrders_OKX.ПолучитьСсылку(UUID);
		Иначе
			Ордер 	= "Объект не найден";
		КонецЕсли;	
			 	
		Если СтрНайти(Ордер, "Объект не найден") <> 0 Тогда
	    	Ордер = Неопределено;
		КонецЕсли;
	КонецЕсли;	
	
	Если Ордер = Неопределено И ЗначениеЗаполнено(algoId) Тогда
		Ордер	= Документы.big_AlgoOrders_OKX.НайтиПоРеквизиту("algoId", algoId);
		Если НЕ ЗначениеЗаполнено(Ордер) Тогда
			Ордер = Неопределено;	
		КонецЕсли;
	КонецЕсли; 
	
	Если Ордер = Неопределено Тогда
		
		ДокументОбъект 		= Документы.big_AlgoOrders_OKX.СоздатьДокумент();
		ДокументОбъект.Дата = ТекущаяДатаСеанса();		
	Иначе 	
		
		ДокументОбъект		= Ордер.ПолучитьОбъект();
	КонецЕсли;
	
	ПоляИсключения		= "attachAlgoOrds";
	биг_ОбщегоНазначения.ЗаполнитьОбъектПоСоответствию(ДокументОбъект, Data, ПоляИсключения);
	АлгоОрдер_ЗаполнитьПоляИзОтвета(ДокументОбъект, Data);
	
	ДокументОбъект.Аккаунт 		= Аккаунт; 
	ДокументОбъект.Стратегия 	= биг_СтратегииСервер.ОпределитьСтратегиюАккаунта(Аккаунт);
	Если ЗначениеЗаполнено(ДокументОбъект.Стратегия) Тогда
		ДокументОбъект.НастройкаСтратегии 	= биг_СтратегииСервер.ОпределитьНастройкуОперации(ДокументОбъект.Стратегия, Аккаунт, ДокументОбъект.instId);	
	КонецЕсли;    
	
    УстановитьВремяДокументаПоДаннымБиржи(ДокументОбъект, Data["cTime"]); 
	
	Попытка
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение 	
		АлгоОрдер_ЗаписатьВРежимеЗаписи(ДокументОбъект);					
	КонецПопытки;
	
	Возврат ДокументОбъект.Ссылка;
		
КонецФункции 

Процедура АлгоОрдер_ЗаполнитьПоляИзОтвета(ДокументОбъект, Data)
	
	//ДокументОбъект.tpOrdKind        = биг_ОбщегоНазначения.ПолучитьЗначениеПеречисления("big_OKX_TPOrderKinds", Data["tpOrdKind"]); // потому что веб сокет не отдает это поле, комент как костыль
	ДокументОбъект.tpTriggerPxType  = биг_ОбщегоНазначения.ПолучитьЗначениеПеречисления("big_OKX_TriggerPxTypes", Data["tpTriggerPxType"]);	
	ДокументОбъект.slTriggerPxType  = биг_ОбщегоНазначения.ПолучитьЗначениеПеречисления("big_OKX_TriggerPxTypes", Data["slTriggerPxType"]);
	
	ДокументОбъект.tdMode 			= биг_ОбщегоНазначения.ПолучитьЗначениеПеречисления("big_OKX_tdModes", Data["tdMode"]);
	ДокументОбъект.side 			= биг_ОбщегоНазначения.ПолучитьЗначениеПеречисления("big_OKX_OrderSides", Data["side"]);
	ДокументОбъект.posSide 			= биг_ОбщегоНазначения.ПолучитьЗначениеПеречисления("big_OKX_PositionSides", Data["posSide"]);
	ДокументОбъект.ordType 			= биг_ОбщегоНазначения.ПолучитьЗначениеПеречисления("big_OKX_OrderTypes", Data["ordType"]);
	ДокументОбъект.triggerPxType 	= биг_ОбщегоНазначения.ПолучитьЗначениеПеречисления("big_OKX_TriggerPxTypes", Data["triggerPxType"]);
		           
КонецПроцедуры

Процедура АлгоОрдер_ЗаписатьВРежимеЗаписи(ДокументОбъект)
	
	Попытка
		ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);	
	Исключение
		Информация = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации("OKX.PlaceOrder", УровеньЖурналаРегистрации.Ошибка, Метаданные.Документы.big_AlgoOrders_OKX, ДокументОбъект.Ссылка, Информация);
	КонецПопытки;
	
КонецПроцедуры

Функция АлгоОрдер_НайтиИдентификаторОсновногоОрдера(АлгоОрдер)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	big_Order_OKXattachAlgoOrds.Ссылка.ordId КАК ordId
	|ИЗ
	|	Документ.big_Order_OKX.attachAlgoOrds КАК big_Order_OKXattachAlgoOrds
	|ГДЕ
	|	big_Order_OKXattachAlgoOrds.AlgoOrder = &AlgoOrder";
	Запрос.УстановитьПараметр("AlgoOrder", АлгоОрдер);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.ordId;
	       
КонецФункции

Процедура Ордер_Отправка_АктуализироватьАлгоОрдера(OrderData, Аккаунт)

	clOrdId = OrderData["clOrdId"];
	UUID 	= биг_ОбщегоНазначенияКлиентСервер.ДополнитьUUIDразделителями(OrderData["clOrdId"]);
	UUID	= Новый УникальныйИдентификатор(UUID);
	Ордер 	= Документы.big_Order_OKX.ПолучитьСсылку(UUID);
	
	Если ЗначениеЗаполнено(Ордер) Тогда
		Для каждого Строка Из Ордер.attachAlgoOrds Цикл
			АлгоОрдер = Строка.АлгоОрдер;
			АлгоОрдер_Актуализировать(АлгоОрдер);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура АлгоОрдер_Актуализировать(АлгоОрдер)

	СтруктураОперации = биг_МаркетАпиКлиентСервер.СтруктураОперации_АктуализироватьАлгоОрдер();	
	СтруктураОперации.КлиентАлгоОрдерИД = биг_ОКХ_КлиентСервер.КлиентскийИдентификатор(АлгоОрдер);	
	биг_МаркетАпи.АктуализироватьАлгоОрдер(АлгоОрдер, СтруктураОперации);
	
КонецПроцедуры

  

Процедура АлгоОрдер_Place_ОбработатьПоложительныйОтвет(НаборДанных)
	
	tag 		= НаборДанных["tag"];
	sMsg 		= НаборДанных["sMsg"];
	sCode 		= НаборДанных["sCode"];
	algoId 		= НаборДанных["algoId"];
	algoClOrdId = НаборДанных["algoClOrdId"];
	
	Если ЗначениеЗаполнено(algoClOrdId) Тогда
		UUID 	= биг_ОбщегоНазначенияКлиентСервер.ДополнитьUUIDразделителями(algoClOrdId);
		UUID	= Новый УникальныйИдентификатор(UUID);
		АлгоОрдер 	= Документы.big_AlgoOrders_OKX.ПолучитьСсылку(UUID); 
		
		ОрдерОбъект = АлгоОрдер.ПолучитьОбъект();
		ОрдерОбъект.algoId 			= algoId;
		ОрдерОбъект.tag				= tag;
		ОрдерОбъект.Комментарий 	= "sMsg = " + sMsg;
		ОрдерОбъект.Статус			= Перечисления.big_СтатусыТорговыхОбъектов.Активный;
		
		Попытка
			ОрдерОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение			
			Ордер_ЗаписатьДокументВРежимеЗаписи(ОрдерОбъект);					
		КонецПопытки;
		
		//ЗафиксироватьОперацию(Стратегия, ОрдерОбъект);
	Иначе
		
		Шаблон = "В ответе не обнаружено значения algoClOrdId";
		//Информация = СтрШаблон(Шаблон, ts, tag, sMsg, sCode, ordId, clOrdId); 
		ЗаписьЖурналаРегистрации("OKX.PlaceAlgoOrder", УровеньЖурналаРегистрации.Ошибка, Метаданные.Документы.big_AlgoOrders_OKX,, Шаблон);
	КонецЕсли;	
		
КонецПроцедуры


Процедура АРХИВ_АлгоОрдер_СоздатьДополнитьПоОтвету(OrderData)
	
	algoClOrdId	= OrderData["algoClOrdId"];
	algoId	= OrderData["algoId"];
	
	Если ЗначениеЗаполнено(algoClOrdId) И СтрДлина(algoClOrdId) = 32 Тогда		
		UUID 	= биг_ОбщегоНазначенияКлиентСервер.ДополнитьUUIDразделителями(OrderData["algoClOrdId"]);
		Если ЗначениеЗаполнено(UUID) Тогда
			UUID	= Новый УникальныйИдентификатор(UUID);
			Ордер 	= Документы.big_AlgoOrders_OKX.ПолучитьСсылку(UUID);
		Иначе
			Ордер 	= "Объект не найден";
		КонецЕсли;	
			 	
		Если СтрНайти(Ордер, "Объект не найден") <> 0 Тогда
	    	Ордер = Неопределено;
		КонецЕсли;
	КонецЕсли;	
	
	Если Ордер = Неопределено И ЗначениеЗаполнено(algoId) Тогда
		Ордер	= Документы.big_AlgoOrders_OKX.НайтиПоРеквизиту("algoId", algoId);
		Если НЕ ЗначениеЗаполнено(Ордер) Тогда
			Ордер = Неопределено;	
		КонецЕсли;
	КонецЕсли;
	
	Если Ордер = Неопределено Тогда
		
		ДокументОбъект 		= Документы.big_AlgoOrders_OKX.СоздатьДокумент();
		ДокументОбъект.Дата = ТекущаяДатаСеанса();		
	Иначе 	
		
		ДокументОбъект		= Ордер.ПолучитьОбъект();
	КонецЕсли;
	
	ПоляИсключения = "";
	биг_ОбщегоНазначения.ЗаполнитьОбъектПоСоответствию(ДокументОбъект, OrderData, ПоляИсключения);
	Ордер_ЗаполнитьПоля(ДокументОбъект, OrderData);
	
	
	Попытка
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение			
		Ордер_ЗаписатьДокументВРежимеЗаписи(ДокументОбъект);					
	КонецПопытки;	
		
КонецПроцедуры



#КонецОбласти //AlgoOrder_Технические 


#Область Бектест

Процедура АлгоОрдер_Изменить_ПрименитьКДокументу(ПараметрыОперацииБиржи, ТаймСтамп = Неопределено) Экспорт
    
	УИДСтрока	= биг_ОбщегоНазначенияКлиентСервер.ДополнитьUUIDразделителями(ПараметрыОперацииБиржи.algoClOrdId);
	УИД 		= Новый УникальныйИдентификатор(УИДСтрока);
	Ссылка 		= Документы.big_AlgoOrders_OKX.ПолучитьСсылку(УИД);
	ОрдерОбъект = Ссылка.ПолучитьОбъект();
	
	Для каждого Элемент Из ПараметрыОперацииБиржи Цикл
		
		Если СтрНачинаетсяС(Элемент.Ключ, "new") Тогда  
			
			ИмяРеквизитаОрдера = НРег(Сред(Элемент.Ключ, 4, 1)) + Сред(Элемент.Ключ, 5);
			ОрдерОбъект[ИмяРеквизитаОрдера] = Элемент.Значение;
		КонецЕсли;			
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ТаймСтамп) Тогда
		ОрдерОбъект.uTime = ТаймСтамп;
	Иначе
		ОрдерОбъект.uTime = биг_ОбщегоНазначенияКлиентСервер.ДатуВTimestampЧисло();	
	КонецЕсли;
	ОрдерОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

#КонецОбласти //Бектест


#КонецОбласти //РаботаСОрдерами


#Область РаботаСПозициями

Процедура Позиция_СоздатьДополнитьПоОтвету(PositionData, Аккаунт) Экспорт

	posId	= PositionData["posId"];
	cTime 	= Число(PositionData["cTime"]);
	
	ДокументСсылка 	= Позиция_НайтиПоИдентификаторуИВремени(posId, cTime); //Документы.big_Positions_OKX.НайтиПоРеквизиту("posId", posId);	
	ЭтоНовый 		= Ложь; 
	
	Если НЕ ЗначениеЗаполнено(ДокументСсылка) Тогда
		ДокументОбъект 			= Документы.big_Positions_OKX.СоздатьДокумент();
		ДокументОбъект.posId 	= posId;
		ДокументОбъект.cTime	= cTime;
		ДокументОбъект.Аккаунт	= Аккаунт;		
		
		cTime10					= cTime / 1000;
		ДокументОбъект.Дата		= биг_ОбщегоНазначенияКлиентСервер.TimestampВДату(cTime10);
		ДокументОбъект.cTime10	= cTime10;
		
		ДокументОбъект.СопоставитьСоСделкой = Истина;
		ЭтоНовый							= Истина;
	Иначе
		ДокументОбъект			= ДокументСсылка.ПолучитьОбъект();	
	КонецЕсли;
	
	ПоляИсключения		= "closeOrderAlgo, uTime";
	биг_ОбщегоНазначения.ЗаполнитьОбъектПоСоответствию(ДокументОбъект, PositionData, ПоляИсключения);
	Позиция_ЗаполнитьПоля(ДокументОбъект, PositionData);
	Позиция_ЗаполнитьТЧОрдерАлго(ДокументОбъект, PositionData);	
	Позиция_СопоставлениеСоСделкой(ДокументОбъект, ЭтоНовый);
	
	Если ДокументОбъект.pos > 0 И ДокументОбъект.closeAvgPx = 0 Тогда
		ДокументОбъект.Статус = Перечисления.big_СтатусыТорговыхОбъектов.Активный;
	ИначеЕсли ДокументОбъект.pos = 0 И ДокументОбъект.closeAvgPx > 0 Тогда
		ДокументОбъект.Статус = Перечисления.big_СтатусыТорговыхОбъектов.Исполнен;	
	КонецЕсли;
	
	ДокументОбъект.ПометкаУдаления = Ложь;
	
	Попытка
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		
		Позиция_ЗаписатьДокументВРежимеЗаписи(ДокументОбъект);					
	КонецПопытки;
	
КонецПроцедуры

Процедура Позиция_ЗаполнитьПоля(ДокументОбъект, PositionData)
		
	ДокументОбъект.mgnMode          = биг_ОбщегоНазначения.ПолучитьЗначениеПеречисления("big_OKX_tdModes", 			PositionData["mgnMode"]);	
	ДокументОбъект.instType 		= биг_ОбщегоНазначения.ПолучитьЗначениеПеречисления("big_OKX_InstrumentType", 	PositionData["instType"]);
	ДокументОбъект.posSide          = биг_ОбщегоНазначения.ПолучитьЗначениеПеречисления("big_OKX_PositionSides", 	PositionData["posSide"]);
	ДокументОбъект.margin           = биг_ОбщегоНазначения.ПолучитьЗначениеПеречисления("big_OKX_tdModes", 			PositionData["mgnMode"]);
	      	
	//Instrument - по режиму и ид
	ДокументОбъект.Instrument		= НайтиИнструмент(ДокументОбъект.instType, ДокументОбъект.instId);
	
	ДокументОбъект.uTime = PositionData["uTime"];
	Если ЗначениеЗаполнено(ДокументОбъект.uTime) Тогда
		ДокументОбъект.uTime10 = Лев(ДокументОбъект.uTime, 10);	
	КонецЕсли;
	
	ДокументОбъект.pTime = PositionData["pTime"];
	Если ЗначениеЗаполнено(ДокументОбъект.pTime) Тогда
		ДокументОбъект.pTime10 = Лев(ДокументОбъект.pTime, 10);	
	КонецЕсли;
	   
КонецПроцедуры 

Процедура Позиция_ЗаполнитьТЧОрдерАлго(ДокументОбъект, PositionData)
	
	closeOrderAlgo = PositionData["closeOrderAlgo"];
	
	Если closeOrderAlgo <> Неопределено Тогда
		
		Для каждого closeOrder Из closeOrderAlgo Цикл
		
			AlgoOrder = Документы.big_AlgoOrders_OKX.СоздатьДополнитьОрдерПоОтвету(closeOrder); 
			НС = ДокументОбъект.closeOrderAlgo.Добавить();
			НС.algoId 		= closeOrder["algoId"];
			НС.AlgoOrder	= AlgoOrder;
			
		КонецЦикла;		
	КонецЕсли	
		
КонецПроцедуры

Процедура Позиция_ЗаписатьДокументВРежимеЗаписи(ДокументОбъект)
	
	Попытка
		ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);	
	Исключение
		Информация = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации("OKX.Position", УровеньЖурналаРегистрации.Ошибка, Метаданные.Документы.big_Positions_OKX, ДокументОбъект.Ссылка, Информация);
	КонецПопытки;
	
КонецПроцедуры

Функция Позиция_НайтиПоИдентификаторуИВремени(posId, cTime)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	big_Positions_OKX.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.big_Positions_OKX КАК big_Positions_OKX
	|ГДЕ
	|	big_Positions_OKX.posId = &posId
	|	И big_Positions_OKX.cTime = &cTime";
	Запрос.УстановитьПараметр("posId", posId);
	Запрос.УстановитьПараметр("cTime", cTime);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Результат = Неопределено;
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Результат = Выборка.Ссылка;
	КонецЕсли;                     
	
	Возврат Результат;
		
КонецФункции

Процедура Позиция_СопоставлениеСоСделкой(ДокументОбъект, ЭтоНовый)

	Если ДокументОбъект.СопоставитьСоСделкой И НЕ ДокументОбъект.СопоставленаСоСделкой Тогда
		
		// для нового документа
		Если ЭтоНовый Тогда
			
			УИД 			= Новый УникальныйИдентификатор;
			СсылкаНаДок		= Документы.big_Positions_OKX.ПолучитьСсылку(УИД);
			ДокументОбъект.УстановитьСсылкуНового(СсылкаНаДок);			
			СсылкаДокумента = СсылкаНаДок;			
		Иначе
			
			СсылкаДокумента = ДокументОбъект.Ссылка;
		КонецЕсли;                                 
		
		ПараметрыПоиска = Новый Структура();
		ПараметрыПоиска.Вставить("Аккаунт", 		ДокументОбъект.Аккаунт);
		ПараметрыПоиска.Вставить("Инструмент", 		НайтиИнструмент(ДокументОбъект.instId, ДокументОбъект.instType));
		ПараметрыПоиска.Вставить("СторонаПозиции", 	ДокументОбъект.posSide);
		ПараметрыПоиска.Вставить("Плечо", 			ДокументОбъект.lever);
		ПараметрыПоиска.Вставить("РежимМаржи", 		ДокументОбъект.mgnMode);
		ПараметрыПоиска.Вставить("ДатаОткрытия", 	ДокументОбъект.cTime10);
		
		биг_ПортфельноеУправление.ЗаполнитьСделкуДляПозиции(СсылкаДокумента, ДокументОбъект.СопоставитьСоСделкой, ДокументОбъект.СопоставленаСоСделкой, ПараметрыПоиска);
	КонецЕсли;
	
КонецПроцедуры


Процедура ЗафиксироватьИнформациюОПозицииВРегистр(Аккаунт, ИнструментИД, PositionData)
	
	Запись = РегистрыСведений.биг_ДаблИмпактОперации.СоздатьМенеджерЗаписи();
	Запись.Биржа 		= Аккаунт.Владелец;
	Запись.ИнструментИД	= ИнструментИД;
	Запись.Аккаунт		= Аккаунт;
	
	posId				= PositionData["posId"];
	cTime 				= PositionData["cTime"];
	Запись.Операция		= Позиция_НайтиПоИдентификаторуИВремени(posId, cTime);
	Запись.Записать(Истина);
	
КонецПроцедуры


#КонецОбласти //РаботаСПозициями


#Область НСИ

Функция СформироватьМассивСвечей(МассивДанныхОСвечах)
	
	МассивСвечей = Новый Массив();
	
	Для Каждого Data Из МассивДанныхОСвечах Цикл
		
		Свеча = Новый Структура("TimeStamp13, TimeStamp10, TimeStamp, Дата, ЦенаОткрытия, ЦенаМаксимум, ЦенаМинимум, ЦенаЗакрытия, Объем, volCcy, volCcyQuote, confirm");
		Свеча.TimeStamp13 		= Data[0];
		Свеча.TimeStamp10		= Лев(Свеча.TimeStamp13, 10);
		Свеча.TimeStamp			= Число(Свеча.TimeStamp10);
		Свеча.Дата				= биг_ОбщегоНазначенияКлиентСервер.TimestampВДату(Свеча.TimeStamp10);
		Свеча.ЦенаОткрытия		= Число(Data[1]);
		Свеча.ЦенаМаксимум		= Число(Data[2]);
		Свеча.ЦенаМинимум		= Число(Data[3]);
		Свеча.ЦенаЗакрытия		= Число(Data[4]);
		Свеча.Объем				= Число(Data[5]);
		Свеча.volCcy			= Число(Data[6]);
		Свеча.volCcyQuote		= Число(Data[7]);
		Свеча.confirm			= Число(Data[8]);
		
		МассивСвечей.Добавить(Свеча);
	КонецЦикла;
	
	Возврат МассивСвечей;
	
КонецФункции

Процедура СоздатьОбновитьИнструмент(Data, Market)
	
	instId 			= Data.Get("instId");
	instTypeString 	= Data.Get("instType");
	instType		= Перечисления.big_OKX_InstrumentType[instTypeString];
	
	ИнструментСсылка = НайтиИнструмент(instId, instType);
	
	Если ЗначениеЗаполнено(ИнструментСсылка) Тогда
		Инструмент = ИнструментСсылка.ПолучитьОбъект();
	Иначе
		Инструмент = Справочники.big_Instruments.СоздатьЭлемент();
	КонецЕсли;
	
	Инструмент.Владелец = Market;
	Инструмент.Наименование = "[" + Market + "] " + "[" + instType + "] " + instId;
	
	биг_ОбщегоНазначения.ЗаполнитьОбъектПоСоответствию(Инструмент, Data); 
	
	Инструмент.instType 	= instType;	
	Инструмент.baseCcy 		= биг_ОбщегоНазначения.НайтиСоздатьВалюту("ccy", Data["baseCcy"]);
	Инструмент.quoteCcy 	= биг_ОбщегоНазначения.НайтиСоздатьВалюту("ccy", Data["quoteCcy"]);
	Инструмент.settleCcy 	= биг_ОбщегоНазначения.НайтиСоздатьВалюту("ccy", Data["settleCcy"]);
	Инструмент.ctValCcy 	= биг_ОбщегоНазначения.НайтиСоздатьВалюту("ccy", Data["ctValCcy"]);
	
	Инструмент.Записать();
		
КонецПроцедуры

Процедура СоздатьОбновитьМонеты(Data)

	Монета 			= биг_ОбщегоНазначения.НайтиСоздатьВалюту("ccy", Data["ccy"]);
	МонетаОбъект 	= Монета.ПолучитьОбъект();
	
	биг_ОбщегоНазначения.ЗаполнитьОбъектПоСоответствию(МонетаОбъект, Data); 
	
	МонетаОбъект.Записать();
	
КонецПроцедуры


Функция НайтиИнструмент(instId, instType)
	
	Market = БиржаOKX();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	big_Instruments.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.big_Instruments КАК big_Instruments
	|ГДЕ
	|	big_Instruments.instId = &instId
	|	И big_Instruments.instType = &instType
	|	И big_Instruments.Владелец = &Market
	|	И НЕ big_Instruments.ПометкаУдаления";
	Запрос.УстановитьПараметр("instId", 	instId);
	Запрос.УстановитьПараметр("instType", 	instType); 
	Запрос.УстановитьПараметр("Market", 	Market);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Ссылка;	
	
КонецФункции

Процедура ОбработатьОтветБиржиПоДаннымСвечей(ПараметрыОперацииБиржи, Ответ)

	Биржа 				= БиржаOKX();
	МассивДанныхОСвечах = Ответ["data"];
	
	Для Каждого Data Из МассивДанныхОСвечах Цикл
		
		Бар			= ПараметрыОперацииБиржи.bar;
		СоздатьСвечу(Data, Биржа, ПараметрыОперацииБиржи.instId, ПараметрыОперацииБиржи.bar);
	КонецЦикла;		
	
КонецПроцедуры

Процедура СоздатьСвечу(Data, Биржа, instId, bar)
             			
	// https://www.okx.com/docs-v5/en/?shell#order-book-trading-market-data-get-candlesticks
	TimeStamp13 	= Data[0];
	TimeStamp10		= Лев(TimeStamp13, 10);
	TimeStamp		= Число(TimeStamp10);
	Дата			= биг_ОбщегоНазначенияКлиентСервер.TimestampВДату(TimeStamp10);
	OpenPrice		= Число(Data[1]);
	HighestPrice	= Число(Data[2]);
	LowestPrice		= Число(Data[3]);
	ClosePrice		= Число(Data[4]);
	TradingVolume	= Число(Data[5]);
	volCcy			= Число(Data[6]);
	volCcyQuote		= Число(Data[7]);
	confirm 		= Число(Data[8]);
	
	Запись = РегистрыСведений.биг_ДанныеСвечей.СоздатьМенеджерЗаписи();
	Запись.Биржа			= Биржа;
	Запись.ИнструментИД 	= instId;
	Запись.Бар				= Справочники.big_BarTypes.НайтиПоНаименованию(bar, Истина);
	Запись.TimeStamp13		= TimeStamp13;
	Запись.TimeStamp10		= TimeStamp10;
	Запись.TimeStamp		= TimeStamp; 
	Запись.ДатаОткрытия		= Дата;
	Запись.ЦенаОткрытия		= OpenPrice;
	Запись.ЦенаМаксимум		= HighestPrice;
	Запись.ЦенаМинимум		= LowestPrice;
	Запись.ЦенаЗакрытия		= ClosePrice;
	Запись.Объем			= TradingVolume;
	Запись.volCcy			= volCcy;
	Запись.volCcyQuote		= volCcyQuote;
	Запись.confirm			= ?(confirm=1, Истина, Ложь);
	Запись.Записать(Истина);
			
КонецПроцедуры

Процедура ЗафиксироватьОбщуюИнформациюОБалансе(data, Аккаунт)

	Для каждого Соответствие Из data Цикл
		
		uTime13 = Соответствие["uTime"];
		uTime10 = Лев(uTime13, 10);
		uTime	= Число(uTime10);
		
		Если ИнформацияОБалансеИзменилась(Аккаунт, uTime10) Тогда
			
			ОбщаяЗаписьБалланса = РегистрыСведений.биг_ОКХ_БаллансАккаунтов.СоздатьМенеджерЗаписи();
			ОбщаяЗаписьБалланса.Account = Аккаунт;
			
			биг_ОбщегоНазначения.ЗаполнитьОбъектПоСоответствию(ОбщаяЗаписьБалланса, Соответствие);
					
			Период 	= биг_ОбщегоНазначенияКлиентСервер.TimestampВДату(uTime);
			dataId	= Новый УникальныйИдентификатор;
			
			ОбщаяЗаписьБалланса.Период	= Период;
			ОбщаяЗаписьБалланса.dataId	= dataId;
			ОбщаяЗаписьБалланса.uTime	= uTime;
			ОбщаяЗаписьБалланса.uTime10	= uTime10;
			ОбщаяЗаписьБалланса.uTime13	= uTime13;
			
			ОбщаяЗаписьБалланса.Записать(Истина);
			
			ЗафиксироватьДетальнуюИнформациюОБалансе(Соответствие["details"], ОбщаяЗаписьБалланса);
			
		КонецЕсли;		
	КонецЦикла;  
	
КонецПроцедуры

Функция ИнформацияОБалансеИзменилась(Аккаунт, uTime10)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	биг_ОКХ_БаллансАккаунтовСрезПоследних.Account КАК Account,
	|	биг_ОКХ_БаллансАккаунтовСрезПоследних.uTime10 КАК uTime10
	|ИЗ
	|	РегистрСведений.биг_ОКХ_БаллансАккаунтов.СрезПоследних(
	|			,
	|			Account = &Аккаунт
	|				И uTime10 = &ТекущаяОтметка) КАК биг_ОКХ_БаллансАккаунтовСрезПоследних";
	
	Запрос.УстановитьПараметр("Аккаунт", Аккаунт);
	Запрос.УстановитьПараметр("ТекущаяОтметка", uTime10);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		
		// uTime10 последней записи отличается - значит что то поменялось
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;       
		
КонецФункции


Процедура ЗафиксироватьДетальнуюИнформациюОБалансе(МассивДеталейБаланса, ОбщаяЗаписьБалланса)
	
	// установить нулями баланс тех монет, которых больше нет на аккаунте
	ТекущийБалансАккаунта = ПолучитьТекущийДетальныйБаланс(ОбщаяЗаписьБалланса.Account);	
	Для каждого Строка Из ТекущийБалансАккаунта Цикл
		НазваниеМонеты = Строка.ccy.ccy;
		Если МонетаОтсутствуетВНовомБалансе(НазваниеМонеты, МассивДеталейБаланса) Тогда
			ДетальнаяЗаписьБаланса = РегистрыСведений.биг_ОКХ_БаллансАккаунтовДетали.СоздатьМенеджерЗаписи();
			ДетальнаяЗаписьБаланса.Период = ТекущаяДата();
			ДетальнаяЗаписьБаланса.Account	= ОбщаяЗаписьБалланса.Account;
			ДетальнаяЗаписьБаланса.ccy		= Строка.ccy;			
			ДетальнаяЗаписьБаланса.Записать(Истина);
		КонецЕсли;
	КонецЦикла;
	
	// установить баланс монет на аккаунте
	Для каждого Соответствие Из МассивДеталейБаланса Цикл
		
		Монета = Соответствие["ccy"];
		Поиск = Новый Структура("НазваниеМонеты", Монета);
		Результат = ТекущийБалансАккаунта.НайтиСтроки(Поиск);
		
		ДетальнаяЗаписьБаланса = РегистрыСведений.биг_ОКХ_БаллансАккаунтовДетали.СоздатьМенеджерЗаписи();		
		биг_ОбщегоНазначения.ЗаполнитьОбъектПоСоответствию(ДетальнаяЗаписьБаланса, Соответствие);
				
		uTime13 = Соответствие["uTime"];
		uTime10 = Лев(uTime13, 10);
		uTime	= Число(uTime10);
		Период 	= биг_ОбщегоНазначенияКлиентСервер.TimestampВДату(uTime);
		
		ДетальнаяЗаписьБаланса.dataId	= ОбщаяЗаписьБалланса.dataId;
		ДетальнаяЗаписьБаланса.Период 	= Период;
		ДетальнаяЗаписьБаланса.Account	= ОбщаяЗаписьБалланса.Account;
		ДетальнаяЗаписьБаланса.ccy		= биг_ОбщегоНазначения.НайтиСоздатьВалюту("ccy", Соответствие["ccy"]);
		
		ДетальнаяЗаписьБаланса.uTime 	= uTime;
		ДетальнаяЗаписьБаланса.uTime10 	= uTime10;
		ДетальнаяЗаписьБаланса.uTime13 	= uTime13; 
		
		ДетальнаяЗаписьБаланса.Записать(Истина);
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьДанныеАккаунтаOKX(Данные, Аккаунт)

	Для каждого Соответствие Из Данные Цикл
		
		//uid = Соответствие.Получить("uid");		
		//Аккаунт = НайтиАккаунтПоРеквизитам(uid, demo);
		
		Если ЗначениеЗаполнено(Аккаунт) Тогда
			
			АккаунтОбъект = Аккаунт.ПолучитьОбъект();
			
			биг_ОбщегоНазначения.ЗаполнитьОбъектПоСоответствию(АккаунтОбъект, Соответствие);
			
			НаименованиеКонтрагента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(АккаунтОбъект.Контрагент, "Наименование");
			АккаунтОбъект.Наименование =  НаименованиеКонтрагента + " / " + АккаунтОбъект.label;
			АккаунтОбъект.Записать();
			
		Иначе
			
			// реализовать ветку вместе с Мастером создания новых аккаунтов.
			// до тех пор создание вручную и указывать uid
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция НайтиАккаунтПоРеквизитам(uid, demo)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	big_MarketAccounts.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.big_MarketAccounts КАК big_MarketAccounts
	|ГДЕ
	|	big_MarketAccounts.uid = &uid
	|	И big_MarketAccounts.demo = &demo";
	Запрос.УстановитьПараметр("uid", uid);
	Запрос.УстановитьПараметр("demo", demo);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат неопределено;
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Ссылка;
	КонецЕсли; 
	
КонецФункции


Функция БиржаOKX()

	Возврат РегистрыСведений.биг_ПредопределенныеЭлементы.ПолучитьЗначениеПоИмени("OKX");
	
КонецФункции

#КонецОбласти //НСИ


#Область Служебные

Функция МонетаОтсутствуетВНовомБалансе(НазваниеМонеты, МассивДеталейБаланса)
	
	МонетаОтсутствует = Истина;
	Для каждого Соответствие Из МассивДеталейБаланса Цикл
		Если Соответствие["ccy"] = НазваниеМонеты Тогда
			МонетаОтсутствует = Ложь;
			Прервать;
		КонецЕсли;	
	КонецЦикла;
	
	Возврат МонетаОтсутствует;
	
КонецФункции

Функция ПолучитьТекущийДетальныйБаланс(Аккаунт)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.Период КАК Период,
	|	биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.Account КАК Account,
	|	биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.ccy КАК ccy,
	|	биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.dataId КАК dataId,
	|	биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.availBal КАК availBal,
	|	биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.availEq КАК availEq,
	|	биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.uTime КАК uTime,
	|	биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.uTime10 КАК uTime10,
	|	биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.uTime13 КАК uTime13,
	|	биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.borrowFroz КАК borrowFroz,
	|	биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.cashBal КАК cashBal,
	|	биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.crossLiab КАК crossLiab,
	|	биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.disEq КАК disEq,
	|	биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.eq КАК eq,
	|	биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.eqUsd КАК eqUsd,
	|	биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.fixedBal КАК fixedBal,
	|	биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.frozenBal КАК frozenBal,
	|	биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.imr КАК imr,
	|	биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.interest КАК interest,
	|	биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.isoEq КАК isoEq,
	|	биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.isoLiab КАК isoLiab,
	|	биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.isoUpl КАК isoUpl,
	|	биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.liab КАК liab,
	|	биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.maxLoan КАК maxLoan,
	|	биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.mgnRatio КАК mgnRatio,
	|	биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.mmr КАК mmr,
	|	биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.notionalLever КАК notionalLever,
	|	биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.ordFrozen КАК ordFrozen,
	|	биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.rewardBal КАК rewardBal,
	|	биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.spotInUseAmt КАК spotInUseAmt,
	|	биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.clSpotInUseAmt КАК clSpotInUseAmt,
	|	биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.maxSpotInUseAmt КАК maxSpotInUseAmt,
	|	биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.spotIsoBal КАК spotIsoBal,
	|	биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.stgyEq КАК stgyEq,
	|	биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.twap КАК twap,
	|	биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.upl КАК upl,
	|	биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.uplLiab КАК uplLiab,
	|	биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.smtSyncEq КАК smtSyncEq,
	|	биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.maxSpotInUse КАК maxSpotInUse,
	|	биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.totalPnlRatio КАК totalPnlRatio,
	|	биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.totalPnl КАК totalPnl,
	|	биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.spotUpl КАК spotUpl,
	|	биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.spotBal КАК spotBal,
	|	биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.spotUplRatio КАК spotUplRatio,
	|	биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.openAvgPx КАК openAvgPx,
	|	биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.accAvgPx КАК accAvgPx,
	|	биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.notionalUsdForBorrow КАК notionalUsdForBorrow,
	|	биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.spotCopyTradingEq КАК spotCopyTradingEq,
	|	биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.collateralEnabled КАК collateralEnabled,
	|	биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.ccy.Наименование КАК НазваниеМонеты
	|ИЗ
	|	РегистрСведений.биг_ОКХ_БаллансАккаунтовДетали.СрезПоследних(, Account = &Аккаунт) КАК биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних
	|ГДЕ
	|	биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.eqUsd <> 0";
	Запрос.УстановитьПараметр("Аккаунт", Аккаунт);
	ТаблицаБаланса = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаБаланса;
	
КонецФункции

Процедура АлгоОрдер_ВывестиТекстОтветаБезОбработки(Ответ)

	Сообщить(Ответ["msg"]);
		
	data = Ответ["data"];
	Если data <> Неопределено Тогда
		
		Для каждого Соответствие Из data Цикл
			
			КодОшибки 		= Соответствие["sCode"];
			ТекстОшибки		= Соответствие["sMsg"];
			Идентификатор 	= Соответствие["algoClOrdId"];
			
			Если ЗначениеЗаполнено(Идентификатор) Тогда
				СтрокаUUID		= биг_ОбщегоНазначенияКлиентСервер.ДополнитьUUIDразделителями(Соответствие["algoClOrdId"]);
				UUID			= Новый УникальныйИдентификатор(СтрокаUUID);
				АлгоОрдер		= Документы.big_AlgoOrders_OKX.ПолучитьСсылку(UUID);
			Иначе
				АлгоОрдер		= "";	
			КонецЕсли;
			  		
			Шаблон 			= "Inner object: %1, error code: %2, error text: %3";
			ТекстОшибки		= СтрШаблон(Шаблон, АлгоОрдер, КодОшибки, ТекстОшибки);
			Сообщить(ТекстОшибки);
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Функция СформироватьСтруктуруЗапросаПоОписаниюСсылки(Ссылка)

	JSON 	= биг_ОбщегоНазначения.СтруктураРеквизитовПоМетаданным(Ссылка);	
	биг_ОбщегоНазначения.ЗаполнитьСтруктуруПоОбъектуСУчетомТипов(JSON, Ссылка.ПолучитьОбъект());		                  
	биг_ОбщегоНазначенияКлиентСервер.УдалитьНеиспользуемыеКлючи(JSON);
		
	Возврат JSON;
	
КонецФункции

Процедура УстановитьВремяДокументаПоДаннымБиржи(ДокументОбъект, cTime)
	
	СтрокаСоздания10 = Лев(cTime, 10);
	ДокументОбъект.Дата = биг_ОбщегоНазначенияКлиентСервер.TimestampВДату(СтрокаСоздания10);
		
КонецПроцедуры

Процедура ЗапуститьВосстановлениеПоследовательностиВФоне()

	ВыполняемыйМетод 			= "биг_ПортфельноеУправление.ВосстановитьПоследовательностьСебестоимостиМонет";	
	ПараметрыЗапуска			= Новый Структура();
	СтруктураФоновогоЗадания 	= биг_ОбщегоНазначения.ЗапуститьФоновоеЗадание(ВыполняемыйМетод, ПараметрыЗапуска);	
	
КонецПроцедуры

#КонецОбласти //Служебные

 
#Область РасчетПоказателейИндикатораRSI

// индикаторы нужно вынести в отдельную обработку, т.к. это унивесральные интсрументы.


#КонецОбласти //РасчетПоказателейИндикатораRSI


