#Область ПрограммныйИнтерфейс

// Обработчик при выгрузке данных.
//
// Параметры:
//   Объект - КонстантаМенеджерЗначения, СправочникОбъект, ДокументОбъект, ПланСчетовОбъект -
//			- ПланВидовХарактеристикОбъект, ПланВидовРасчетаОбъект, РегистрСведенийНаборЗаписей -
//          - РегистрНакопленияНаборЗаписей, РегистрБухгалтерииНаборЗаписей, РегистрРасчетаНаборЗаписей -
//			- ПоследовательностьНаборЗаписей, ПерерасчетНаборЗаписей, БизнесПроцессОбъект, ЗадачаОбъект - выгружаемый объект.
//   ПараметрыВыгрузки - Структура - параметры выгрузки
//   ЗаписьXML - ЗаписьXML - Для самостоятельной сериализации.
//   КоличествоОбъектов - Число - Счетчик, который необходимо увеличить, чтобы объект был выгружен
//   Отказ - Булево - если данному параметру установить значение Истина, то объект не будет выгружен, при этом
//   				можно самостоятельно сериализовать объект, например через ПараметрыВыгрузки.Сериализатор в ЗаписьXML.
//@skip-check module-empty-method - переопределяемый метод.
Процедура ПриВыгрузкеОбъекта(Объект, ПараметрыВыгрузки, ЗаписьXML, КоличествоОбъектов, Отказ) Экспорт
КонецПроцедуры

// Обработчик при загрузке данных.
//
// Параметры:
//   Объект - КонстантаМенеджерЗначения, СправочникОбъект, ДокументОбъект, ПланСчетовОбъект -
//			- ПланВидовХарактеристикОбъект, ПланВидовРасчетаОбъект, РегистрСведенийНаборЗаписей -
//          - РегистрНакопленияНаборЗаписей, РегистрБухгалтерииНаборЗаписей, РегистрРасчетаНаборЗаписей -
//			- ПоследовательностьНаборЗаписей, ПерерасчетНаборЗаписей, БизнесПроцессОбъект, ЗадачаОбъект - загружаемый объект.
//   Отказ - Булево - если данному параметру установить значение Истина, то объект не будет загружен.
//@skip-check module-empty-method - переопределяемый метод.
Процедура ПриЗагрузкеОбъекта(Объект, Отказ) Экспорт
КонецПроцедуры

// Обработчик при регистрации изменений.
//
// Параметры:
//   Источник - КонстантаМенеджерЗначения, СправочникОбъект, ДокументОбъект, ПланСчетовОбъект -
//			- ПланВидовХарактеристикОбъект, ПланВидовРасчетаОбъект, РегистрСведенийНаборЗаписей -
//          - РегистрНакопленияНаборЗаписей, РегистрБухгалтерииНаборЗаписей, РегистрРасчетаНаборЗаписей -
//			- ПоследовательностьНаборЗаписей, ПерерасчетНаборЗаписей, БизнесПроцессОбъект, ЗадачаОбъект - 
//			регистрируемый объект.
//   Отказ - Булево - если данному параметру установить значение Истина, то объект не будет зарегистрирован.
//@skip-check module-empty-method - переопределяемый метод.
Процедура ПриРегистрацииИзмененийОбъекта(Источник, Отказ) Экспорт	
КонецПроцедуры

// При определении разрешенных к выгрузке объектов метаданных.
// Предполагаемое использование для объектов метаданных, добавленых в расширении, фильтр по которым нельзя настроить из 
// Менеджера сервиса.
// 
// Параметры:
//  ОбъектыМетаданных - Соответствие из КлючИЗначение - коллекция объектов метаданных:
//   * Ключ - Строка - Имя объекта метаданных
//   * Значение - Булево - Признак, разрешено ли выгружать данный объект
//@skip-check module-empty-method - переопределяемый метод.
Процедура ПриОпределенииРазрешенныхКВыгрузкеОбъектовМетаданных(ОбъектыМетаданных) Экспорт
КонецПроцедуры

#КонецОбласти
	
