   
   
   

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнениеФормыПоУмолчанию();  
	ЗаполнитьФорму();	
	             
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//ПодключитьОбработчикОжидания("ОбработчикОбновленияФормы", 60);
	ЗаполнитьСписокВыбораИнструментов();
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикОбновленияФормы() Экспорт
	
	ЗаполнитьФорму();
	
КонецПроцедуры

#КонецОбласти //ОбработчикиСобытийФормы


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура БарПриИзменении(Элемент)
	
	ВеличинаБара = ПолучитьВеличинуБараНаСервере(Бар);
	ЗаполнитьФорму();
	
КонецПроцедуры

&НаКлиенте
Процедура ИнструментПриИзменении(Элемент)
	
	КлючНастроек = НайтиКлючСтратегии(Стратегия, ИнструментИД);
	ЗаполнитьФорму();   
	
КонецПроцедуры

&НаКлиенте
Процедура КлючНастроекПриИзменении(Элемент)
	
	ЗаполнитьФорму();
	
КонецПроцедуры

#КонецОбласти //ОбработчикиСобытийЭлементовШапкиФормы


#Область ОбработчикиСобытийЭлементовТаблицыФормыИмяТаблицыФормы

&НаКлиенте
Процедура МассТест_СписокИнструментИДЗначениеПриИзменении(Элемент)
	
	
КонецПроцедуры

#КонецОбласти //ОбработчикиСобытийЭлементовТаблицыФормыИмяТаблицыФормы


#Область ОбработчикиКомандФормы

 &НаКлиенте
Процедура КомандаОбновить(Команда) 
	
	ЭмуляцияВыполнитьТекущийШагНаСервере();
	ОбновитьДанныеМонитора(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ЭмуляцияШагВПраво(Команда)
	
	ЭмуляцияШагВправоСместитьТочкуИОбработать();	
	ОбновитьДанныеМонитора();
	
КонецПроцедуры 

&НаКлиенте
Процедура ЭмуляцияДоКонца(Команда)
	
	//количество шагов и вызов в цикле
	ТочкаОтсчетаТС = биг_ОбщегоНазначенияКлиентСервер.ДатуВTimestampЧисло(ТочкаОтсчета);
	ТекущаяДатаТС  = биг_ОбщегоНазначенияКлиентСервер.ДатуВTimestampЧисло(биг_ОбщегоНазначения.ТекущаяДатаНаСервере());
	
	МассТест_СписокИнструментИД.Очистить();
	МассТест_СписокИнструментИД.Добавить(ИнструментИД, ИнструментИД);
	МассТест_СписокКлючей.Очистить();
	МассТест_СписокКлючей.Добавить(КлючНастроек, КлючНастроек);
	
	СформироватьЗапуститьОчередьЗаданийБектеста(Истина);		
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.МониторБектеста;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВернутьЭмуляциюКТочке(Команда)
	
	Оповещение 		= Новый ОписаниеОповещения("ВернутьЭмуляциюКТочкеЗавершение", ЭтаФорма);
	ТочкаОтладки	= Дата(2024, 01, 10, 22, 0, 0);
	ПоказатьВводДаты(Оповещение, ТочкаОтладки, "Укажите дату к которому нужно вернуть эмуляцию", Частидаты.ДатаВремя);
	
КонецПроцедуры

&НаКлиенте
Процедура ПросмотрСигналов(Команда)
	
	НастройкиКомпоновкиДанных 		= Новый НастройкиКомпоновкиДанных;
	
	ЭлементОтбора = НастройкиКомпоновкиДанных.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.Использование 	= Истина;
	ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Биржа");
	ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение 	= Биржа;
	 	
	ЭлементОтбора = НастройкиКомпоновкиДанных.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.Использование 	= Истина;
	ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("ИнструментИД");
	ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение 	= ИнструментИД;
	
	ЭлементОтбора = НастройкиКомпоновкиДанных.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.Использование 	= Истина;
	ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Бар");
	ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение 	= Бар;
	          	
	ПараметрыПросмотра 				= Новый Структура("ФиксированныеНастройки", НастройкиКомпоновкиДанных);		
	
	ОткрытьФорму("РегистрСведений.биг_ДаблИмпактСигналы.ФормаСписка", ПараметрыПросмотра, ЭтаФорма,,,,, РежимОткрытияОкнаФормы.Независимый);
	        
КонецПроцедуры

&НаКлиенте
Процедура ГрафикВлево(Команда)
	ГрафикВлевоНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ГрафикВправо(Команда)
	ГрафикВправоНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ФокусНаТочку(Команда)
	
	Оповещение 		= Новый ОписаниеОповещения("ФокусНаТочкуЗавершение", ЭтаФорма);
	ТочкаФокуса		= Дата(2024, 1, 1, 0, 0, 0);
	ПоказатьВводДаты(Оповещение, ТочкаФокуса, "Укажите дату фокусировки графика", Частидаты.ДатаВремя);
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьВсеНастройки(Команда)

	ИндикаторПрогрессаБектестаОбщий = 0;
	СформироватьЗапуститьОчередьЗаданийБектеста();	
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборКлючейПоЗначениюПараметров(Команда)
	
	ПараметрыОткрытия 	= Новый Структура("Стратегия", Стратегия);
	Оповещение 			= Новый ОписаниеОповещения("ПодборКлючейПоЗначениюПараметровЗавершение", ЭтаФорма);
	ОткрытьФорму("Обработка.биг_МониторСтратегий.Форма.ФормаПодбораКлючей", ПараметрыОткрытия, ЭтаФорма,,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры


&НаСервере
Процедура ГрафикВлевоНаСервере()
	
	ТаймСтампЛеваяСвеча		= ТаймСтампЛеваяСвеча - Бар.SecondsAmount;	
	ТаймСтампПраваяСвеча	= ТаймСтампПраваяСвеча - Бар.SecondsAmount;	
	
	ПересчитатьЗависимыеТочкиОбновитьМонитор();
	
КонецПроцедуры

&НаСервере
Процедура ГрафикВправоНаСервере()

	ТаймСтампЛеваяСвеча		= ТаймСтампЛеваяСвеча + Бар.SecondsAmount;	
	ТаймСтампПраваяСвеча	= ТаймСтампПраваяСвеча + Бар.SecondsAmount;	
	
	ПересчитатьЗависимыеТочкиОбновитьМонитор();
	
КонецПроцедуры

&НаКлиенте
Процедура ФокусНаТочкуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		РазмерБара = ПолучитьВеличинуБараНаСервере(Бар);
		ТочкаОтсчета = Результат + (РазмерБара * 40);
		
		ОбновитьДанныеМонитора();
		ЗагрузитьНастройкиСтратегии();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборКлючейПоЗначениюПараметровЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		//Если ИсключаяВыполненныеТесты Тогда
		//	ОтфильтроватьНастройкиСВыполненнымТестом(Результат);	
		//КонецЕсли;		
		
		//МассТест_СписокКлючей.Очистить();
		Для каждого Ключ Из Результат Цикл
			МассТест_СписокКлючей.Добавить(Ключ, Ключ);
		КонецЦикла; 	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьОчередьЗаданий(Команда)
	
	ТаблицаБектестов.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьЗадания(Команда)
	
	ДобавитьЗаданияБектестов();
	
КонецПроцедуры

#КонецОбласти //ОбработчикиКомандФормы


#Область Бектест

&НаКлиенте
Процедура ЭмуляцияШагВправоСместитьТочкуИОбработать()

	ТочкаОтсчета 	= ТочкаОтсчета + ВеличинаБара;		
	ТочкаОтсчетаТС	= биг_ОбщегоНазначенияКлиентСервер.ДатуВTimestampЧисло(ТочкаОтсчета);
		
	ПараметрыИнструмента = Новый Структура();
	ПараметрыИнструмента.Вставить("Биржа", 			Биржа);
	ПараметрыИнструмента.Вставить("ИнструментИД", 	ИнструментИД);
	ПараметрыИнструмента.Вставить("Бар", 			Бар);
	ПараметрыИнструмента.Вставить("КлючНастроек", 	КлючНастроек);
	
	ЗапускЭмуляцииНаСервере(ПараметрыИнструмента, ТочкаОтсчетаТС);
	
КонецПроцедуры

&наСервереБезКонтекста
Процедура ЗапускЭмуляцииНаСервере(ПараметрыИнструмента, ТочкаОтсчетаТС)
	
	биг_АлгоИмпакт.ПроверитьОперацииПоАктивнымСигналам(ТочкаОтсчетаТС, Истина, ПараметрыИнструмента.КлючНастроек, ПараметрыИнструмента.ИнструментИД, ПараметрыИнструмента.Биржа);
	биг_АлгоИмпакт.ОбработатьИнструмент(ПараметрыИнструмента, ТочкаОтсчетаТС, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьЗапуститьОчередьЗаданийБектеста(ОтТекущейТочки = Ложь)
	
	ИндикаторПрогрессаБектестаОбщий = 0;
	
	Если ОчередьЗаданийНеОтработана() Тогда
		Сообщить("Еще обрабатывается текущая очередь заданий");
		Возврат;
	КонецЕсли;	                                                                                                          
	ТаблицаБектестов.Очистить();
		
	ДобавитьЗаданияБектестов(ОтТекущейТочки);	
	
	ДатаНачалаБектеста = ТекущаяДата();
	ПодключитьОбработчикиОжиданий();	
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьОбработчикиОжиданий()

	// подключим обработку ожидания получения "отклика" на форму
	ПодключитьОбработчикОжидания("ОбработчикОжиданияИндикатор", 55);
	ПодключитьОбработчикОжидания("ОбработчикОжиданияУправлениеОчередьюЗаданий", 60);
	
	// вызовем обработчик сразу вручную, что бы не ожидать запуска первой пачки 60 секунд
	ОбработчикОжиданияУправлениеОчередьюЗаданий();
	
КонецПроцедуры


&НаКлиенте
Процедура ДобавитьЗаданияБектестов(ОтТекущейТочки  = Ложь)
	
	//Для каждого ЭлементНастройка Из МассТест_СписокКлючей Цикл
	Для каждого ЭлементИнструмента Из МассТест_СписокИнструментИД Цикл
		
		ТекИнструментИД = ЭлементИнструмента.Значение;
		Если НЕ ЗначениеЗаполнено(ТекИнструментИД) Тогда
			Продолжить;
		КонецЕсли;
		
		//ТекКлючНастроек 	= ЭлементНастройка.Значение;			
		//Если НЕ ЗначениеЗаполнено(ТекКлючНастроек) Тогда
		//	Продолжить;
		//КонецЕсли;
		
		//Для каждого ЭлементИнструмента Из МассТест_СписокИнструментИД Цикл
		Для каждого ЭлементНастройка Из МассТест_СписокКлючей Цикл
		
			//ТекИнструментИД = ЭлементИнструмента.Значение;
			//Если НЕ ЗначениеЗаполнено(ТекИнструментИД) Тогда
			//	Продолжить;
			//КонецЕсли; 
			
			ТекКлючНастроек 	= ЭлементНастройка.Значение;			
			Если НЕ ЗначениеЗаполнено(ТекКлючНастроек) Тогда
				Продолжить;
			КонецЕсли;
			
			Если ОтТекущейТочки Тогда
				ТочкаОтсчетаТС = биг_ОбщегоНазначенияКлиентСервер.ДатуВTimestampЧисло(ТочкаОтсчета);
			Иначе
				ТочкаОтсчетаТС = биг_ОбщегоНазначенияКлиентСервер.ДатуВTimestampЧисло(Дата(2024,1,1));
			КонецЕсли;
			
			ТекущаяДатаТС  		= биг_ОбщегоНазначенияКлиентСервер.ДатуВTimestampЧисло(биг_ОбщегоНазначения.ТекущаяДатаНаСервере());
			
			Разница 			= ТекущаяДатаТС - ТочкаОтсчетаТС;
			КоличествоИтераций 	= Цел(Разница / ВеличинаБара);
			
			НаименованиеЗадания = "Бектест: " + ТекИнструментИД + ", " + ТекКлючНастроек;
			
			НовоеЗадание = ТаблицаБектестов.Добавить();
			НовоеЗадание.Биржа 						= Биржа;
			НовоеЗадание.ИнструментИД 				= ТекИнструментИД;
			НовоеЗадание.Бар 						= Бар;
			НовоеЗадание.КлючНастроек 				= ТекКлючНастроек;
			НовоеЗадание.ТочкаОтсчетаТС 			= ТочкаОтсчетаТС;
			НовоеЗадание.ТочкаОтсчета				= биг_ОбщегоНазначенияКлиентСервер.TimestampВДату(ТочкаОтсчетаТС);
			НовоеЗадание.КоличествоИтераций 		= КоличествоИтераций;
			НовоеЗадание.НаименованиеЗадания 		= НаименованиеЗадания; 
			
			// коды состояний:
			// 0 - ожидает
			// 1 - запущено
			// 2 - выполнено
			НовоеЗадание.Состояние = 0;
			
		КонецЦикла;
	КонецЦикла;
	
	Если ИсключаяВыполненныеТесты Тогда
		ОтфильтроватьНастройкиСВыполненнымТестом();	
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Функция ЗапуститьБектестНаСервере(ПараметрыЗапуска, НаименованиеЗадания)
		
	ВыполняемыйМетод 		= "биг_АлгоИмпакт.ПровестиБекТестирование";
	
	ПараметрыВыполнения 	= ДлительныеОперации.ПараметрыВыполненияВФоне(Неопределено);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеЗадания;
	ПараметрыВыполнения.ЗапуститьВФоне 				= Истина;
	//ПараметрыВыполнения.Вставить("ИдентификаторФормы", ЭтаФорма.ИдентификаторЗадания); 
	
	СтруктураФоновогоЗадания = ДлительныеОперации.ВыполнитьВФоне(ВыполняемыйМетод, ПараметрыЗапуска, ПараметрыВыполнения);
	
	Возврат СтруктураФоновогоЗадания;
	
КонецФункции

&НаКлиенте 
Процедура ОбработчикОжиданияИндикатор() 
	
	ОтборВыполняются = Новый Структура("Состояние", 1);
	АктивныеЗадания = ТаблицаБектестов.НайтиСтроки(ОтборВыполняются);
	
	Для каждого Строка Из АктивныеЗадания Цикл 		
					
		Прогресс = ПрочитатьПрогресс(Строка.ИдентификаторЗадания);
		Если НЕ ТипЗнч(Прогресс) = Тип("Структура") Тогда
			
			Строка.Состояние = 2;
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(Прогресс) = Тип("Структура") 
			И (Прогресс.Свойство("ЗаданиеЗавершеноСОшибками") ИЛИ Прогресс.Свойство("ЗаданиеОтмененоПользователем")) Тогда
			
			Строка.Состояние = 2;
			Продолжить;
		КонецЕсли;
		
		Если Прогресс.Свойство("ЗаданиеВыполнено") И Прогресс.ЗаданиеВыполнено Тогда
			Строка.Прогресс			= 100;
			Строка.Состояние 		= 2;
		Иначе
			Если Прогресс.Свойство("Процент") Тогда
				Строка.Прогресс		= Прогресс.Процент;
			КонецЕсли;
		КонецЕсли;	
		
	КонецЦикла; 
	
	// средний прогресс
	РассчитатьСреднийПрогресс();
	
	ОтборВыполнено 	= Новый Структура("Состояние", 2);
	СтрокиВыполнено	= ТаблицаБектестов.НайтиСтроки(ОтборВыполнено);
	
	Если СтрокиВыполнено.Количество() = ТаблицаБектестов.Количество() Тогда
		
		// всё выполнено
		ОтключитьОбработчикОжидания("ОбработчикОжиданияИндикатор");
		ОбновитьДанныеМонитора();
	КонецЕсли;

	// оценить время до завершения операции
	ОценитьВремяДоОкончанияБектеста(СтрокиВыполнено);
	  
КонецПроцедуры

&НаКлиенте
Процедура ОценитьВремяДоОкончанияБектеста(СтрокиВыполнено)
	
	ТекТочка = ТекущаяДата();
	ТекДлительность = ТекТочка - ДатаНачалаБектеста;
	
	КоличествоВыполнено = СтрокиВыполнено.Количество();
	Если КоличествоВыполнено > 0 Тогда
		ВремениНаЗадание	= Окр(ТекДлительность / КоличествоВыполнено, 2);
		ОставшеесяВремяСек	= (ТаблицаБектестов.Количество() - КоличествоВыполнено) * ВремениНаЗадание;
		ОставшеесяВремяЧас	= Окр(ОставшеесяВремяСек/3600, 2);
		
		Элементы.НадписьОсталосьВремени.Заголовок = "До завершения операции: " + ОставшеесяВремяЧас + " часов"; 
	КонецЕсли;	
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработчикОжиданияУправлениеОчередьюЗаданий()
	
	ОтборОжидающие 		= Новый Структура("Состояние", 0);
	ЗаданияВОчереди		= ТаблицаБектестов.НайтиСтроки(ОтборОжидающие);
	
	Если ЗаданияВОчереди.Количество() = 0 Тогда
		ОтключитьОбработчикОжидания("ОбработчикОжиданияУправлениеОчередьюЗаданий");
		Возврат;
	КонецЕсли;
	
	
	ОтборВыполняются	= Новый Структура("Состояние", 1);
	ЗаданияВыполняются	= ТаблицаБектестов.НайтиСтроки(ОтборВыполняются);
	
	ЛимитЗаданий 		= 12; // TODO - может заюзать механизм определения количества потоков из модуля ДлительныеОперации?
	МожноЗапустить		= ЛимитЗаданий - ЗаданияВыполняются.Количество();
	КоличествоЗапустить	= Мин(МожноЗапустить, ЗаданияВОчереди.Количество());
	
	Если КоличествоЗапустить > 0 Тогда 
		
		Для ИНД = 0 По КоличествоЗапустить - 1 Цикл
			
			Задание = ЗаданияВОчереди[ИНД];
			
			ПараметрыИнструмента = Новый Структура();
			ПараметрыИнструмента.Вставить("Биржа", 						Задание.Биржа);
			ПараметрыИнструмента.Вставить("ИнструментИД", 				Задание.ИнструментИД);
			ПараметрыИнструмента.Вставить("Бар", 						Задание.Бар);
			ПараметрыИнструмента.Вставить("КлючНастроек", 				Задание.КлючНастроек);
			ПараметрыИнструмента.Вставить("ТочкаОтсчетаТС", 			Задание.ТочкаОтсчетаТС);
			ПараметрыИнструмента.Вставить("КоличествоИтераций", 		Задание.КоличествоИтераций);
			ПараметрыИнструмента.Вставить("НаименованиеЗадания",		Задание.НаименованиеЗадания);
			ПараметрыИнструмента.Вставить("ФиксироватьДлительность",	Истина);
			
			// запустить фоном метод  биг_ДаблИмпакт2.ПровестиБекТестирование(ПараметрыИнструмента)			
			СтруктураФоновогоЗадания 	= ЗапуститьБектестНаСервере(ПараметрыИнструмента, Задание.НаименованиеЗадания);
			
			//ПараметрыОжидания  = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
			//ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
			
			//ДлительныеОперацииКлиент.ОжидатьЗавершение(СтруктураФоновогоЗадания, Новый ОписаниеОповещения("ОбработатьДанные", ЭтотОбъект), ПараметрыОжидания);
			
			// 1 - запущено
			Задание.Состояние 				= 1;
			Задание.ИдентификаторЗадания = СтруктураФоновогоЗадания.ИдентификаторЗадания;
		КонецЦикла;		
	КонецЕсли;	
	
КонецПроцедуры


&наСервереБезКонтекста
Функция ПрочитатьПрогресс(Знач ИдентификаторФоновогоЗадания) Экспорт
	
	Задание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторФоновогоЗадания);
	
	Если Задание = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Задание.Состояние = СостояниеФоновогоЗадания.ЗавершеноАварийно Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// используем БСП
	ПрогрессЗадания = ДлительныеОперации.ПрочитатьПрогресс(ИдентификаторФоновогоЗадания);
	
	Если ПрогрессЗадания = Неопределено
	 Или ТипЗнч(ПрогрессЗадания) <> Тип("Структура") Тогда 
		ПрогрессЗадания = Новый Структура;
	КонецЕсли;
	ПрогрессЗадания.Вставить("ЗаданиеВыполнено", ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторФоновогоЗадания));
	
	Возврат ПрогрессЗадания;
	
КонецФункции

&НаКлиенте
Процедура РассчитатьСреднийПрогресс()
	
	СуммаПрогресс = 0;
	
	Для каждого Строка Из ТаблицаБектестов Цикл
		СуммаПрогресс = СуммаПрогресс + ?(Строка.Состояние = 2, 100, Строка.Прогресс);	
	КонецЦикла;                                         
	
	Если ТаблицаБектестов.Количество() > 0 Тогда
		ИндикаторПрогрессаБектестаОбщий = СуммаПрогресс / ТаблицаБектестов.Количество();
	Иначе
		ИндикаторПрогрессаБектестаОбщий = 0;	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Функция ОчередьЗаданийНеОтработана()
	
	КоличествоЗаданий = ТаблицаБектестов.Количество();
	ВыполненныеЗадания	= ТаблицаБектестов.НайтиСтроки(Новый Структура("Состояние", 2)); 
	
	Если КоличествоЗаданий = 0 Тогда
		
		// очередь пустая
		Возврат Ложь;
		
	Иначе
		
		Если ВыполненныеЗадания.Количество() < КоличествоЗаданий Тогда
			
			// еще не всё выполнено
			Возврат Истина;	
		Иначе
			
			// все задания выполнены
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли; 
	
КонецФункции

&НаСервере
Процедура ОтфильтроватьНастройкиСВыполненнымТестом()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаЗаданий.Биржа КАК Биржа,
	|	ТаблицаЗаданий.ИнструментИД КАК ИнструментИД,
	|	ТаблицаЗаданий.Бар КАК Бар,
	|	ТаблицаЗаданий.КлючНастроек КАК КлючНастроек,
	|	ТаблицаЗаданий.ТочкаОтсчетаТС КАК ТочкаОтсчетаТС,
	|	ТаблицаЗаданий.КоличествоИтераций КАК КоличествоИтераций,
	|	ТаблицаЗаданий.НаименованиеЗадания КАК НаименованиеЗадания
	|ПОМЕСТИТЬ ВТ_ТаблицаЗаданий
	|ИЗ
	|	&ТаблицаЗаданий КАК ТаблицаЗаданий
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаЗаданий.Биржа КАК Биржа,
	|	ВТ_ТаблицаЗаданий.ИнструментИД КАК ИнструментИД,
	|	ВТ_ТаблицаЗаданий.Бар КАК Бар,
	|	ВТ_ТаблицаЗаданий.КлючНастроек КАК КлючНастроек,
	|	ВТ_ТаблицаЗаданий.ТочкаОтсчетаТС КАК ТочкаОтсчетаТС,
	|	ВТ_ТаблицаЗаданий.КоличествоИтераций КАК КоличествоИтераций,
	|	ВТ_ТаблицаЗаданий.НаименованиеЗадания КАК НаименованиеЗадания,
	|	ЕСТЬNULL(биг_РезультатыБектестов.Выполнен, ЛОЖЬ) КАК Поле1
	|ИЗ
	|	ВТ_ТаблицаЗаданий КАК ВТ_ТаблицаЗаданий
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.биг_РезультатыБектестов КАК биг_РезультатыБектестов
	|		ПО ВТ_ТаблицаЗаданий.Биржа = биг_РезультатыБектестов.Биржа
	|			И ВТ_ТаблицаЗаданий.ИнструментИД = биг_РезультатыБектестов.ИнструментИД
	|			И ВТ_ТаблицаЗаданий.Бар = биг_РезультатыБектестов.Бар
	|			И ВТ_ТаблицаЗаданий.КлючНастроек = биг_РезультатыБектестов.КлючНастроек
	|ГДЕ
	|	ЕСТЬNULL(биг_РезультатыБектестов.Выполнен, ЛОЖЬ) = ЛОЖЬ";
	Запрос.УстановитьПараметр("ТаблицаЗаданий", ТаблицаБектестов.Выгрузить());
	
	ТаблицаБектестов.Очистить();	
	ТаблицаБектестов.Загрузить(Запрос.Выполнить().Выгрузить());
	                            	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	биг_КлючиНастроекСтратегии.Ссылка КАК Ссылка,
	//|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ биг_РезультатыБектестов.ИнструментИД) КАК ИнструментИД
	//|ИЗ
	//|	Справочник.биг_КлючиНастроекСтратегии КАК биг_КлючиНастроекСтратегии
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.биг_РезультатыБектестов КАК биг_РезультатыБектестов
	//|		ПО биг_КлючиНастроекСтратегии.Ссылка = биг_РезультатыБектестов.КлючНастроек
	//|			И (биг_РезультатыБектестов.Биржа = &Биржа)
	//|			И (биг_РезультатыБектестов.Бар = &Бар)
	//|			И (биг_РезультатыБектестов.Выполнен)
	//|ГДЕ
	//|	биг_КлючиНастроекСтратегии.Ссылка В(&МассивСсылок)
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	биг_КлючиНастроекСтратегии.Ссылка
	//|
	//|ИМЕЮЩИЕ
	//|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ биг_РезультатыБектестов.ИнструментИД) = 0";
	//
	//Запрос.УстановитьПараметр("Стратегия", 		Стратегия);
	//Запрос.УстановитьПараметр("Биржа", 			Биржа);
	//Запрос.УстановитьПараметр("Бар", 			Бар);
	//Запрос.УстановитьПараметр("МассивСсылок", 	Результат);
	//
	//Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		
КонецПроцедуры


&НаСервере
Процедура ДоделатьБектестыНаСервере(ТСТочкиЗавершения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	биг_ДаблИмпактВременныеТочки.Биржа КАК Биржа,
	|	биг_ДаблИмпактВременныеТочки.ИнструментИД КАК ИнструментИД,
	|	биг_ДаблИмпактВременныеТочки.Бар КАК Бар,
	|	биг_ДаблИмпактВременныеТочки.НастройкаСтратегии КАК НастройкаСтратегии,
	|	биг_ДаблИмпактВременныеТочки.ТочкаНаЛинииВремени КАК ТочкаОтсчетаТС,
	|	биг_ДаблИмпактВременныеТочки.Бар.SecondsAmount КАК ВеличинаБара,
	|	биг_ДаблИмпактВременныеТочки.ТочкаДатой КАК ТочкаДатой
	|ИЗ
	|	РегистрСведений.биг_ДаблИмпактВременныеТочки КАК биг_ДаблИмпактВременныеТочки
	|ГДЕ
	|	биг_ДаблИмпактВременныеТочки.ТочкаНаЛинииВремени < &ДатаЗавершения
	|	И биг_ДаблИмпактВременныеТочки.НастройкаСтратегии.Владелец = &Стратегия";
	
	Запрос.УстановитьПараметр("ДатаЗавершения", ТСТочкиЗавершения);
	Запрос.УстановитьПараметр("Стратегия", Стратегия);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТаблицаБектестов.Очистить();
	ТекущаяДатаТС  		= ТСТочкиЗавершения;
	
	Пока Выборка.Следующий() Цикл
				
		Разница 			= ТекущаяДатаТС - Выборка.ТочкаОтсчетаТС;
		КоличествоИтераций 	= Цел(Разница / Выборка.ВеличинаБара);
		
		НаименованиеЗадания = "Бектест: " + Стратегия + ", " + Выборка.ИнструментИД + ", " + Выборка.НастройкаСтратегии;
		
		НовоеЗадание = ТаблицаБектестов.Добавить();
		НовоеЗадание.Биржа 						= Биржа;
		НовоеЗадание.ИнструментИД 				= Выборка.ИнструментИД;
		НовоеЗадание.Бар 						= Выборка.Бар;
		НовоеЗадание.КлючНастроек 				= Выборка.НастройкаСтратегии;
		НовоеЗадание.ТочкаОтсчетаТС 			= Выборка.ТочкаОтсчетаТС;
		НовоеЗадание.ТочкаОтсчета				= Выборка.ТочкаДатой;
		НовоеЗадание.КоличествоИтераций 		= КоличествоИтераций;
		НовоеЗадание.НаименованиеЗадания 		= НаименованиеЗадания; 
		
		// коды состояний:
		// 0 - ожидает
		// 1 - запущено
		// 2 - выполнено
		НовоеЗадание.Состояние = 0;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПеределатьБектестыНаСервере(ТСТочкиЗавершения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	биг_ДаблИмпактВременныеТочки.Биржа КАК Биржа,
	|	биг_ДаблИмпактВременныеТочки.ИнструментИД КАК ИнструментИД,
	|	биг_ДаблИмпактВременныеТочки.Бар КАК Бар,
	|	биг_ДаблИмпактВременныеТочки.НастройкаСтратегии КАК НастройкаСтратегии,
	|	биг_ДаблИмпактВременныеТочки.ТочкаНаЛинииВремени КАК ТочкаОтсчетаТС,
	|	биг_ДаблИмпактВременныеТочки.Бар.SecondsAmount КАК ВеличинаБара,
	|	биг_ДаблИмпактВременныеТочки.ТочкаДатой КАК ТочкаДатой
	|ИЗ
	|	РегистрСведений.биг_ДаблИмпактВременныеТочки КАК биг_ДаблИмпактВременныеТочки
	|ГДЕ
	|	биг_ДаблИмпактВременныеТочки.ТочкаНаЛинииВремени < &ДатаЗавершения
	|	И биг_ДаблИмпактВременныеТочки.НастройкаСтратегии.Владелец = &Стратегия";
	
	Запрос.УстановитьПараметр("ДатаЗавершения", ТСТочкиЗавершения);
	Запрос.УстановитьПараметр("Стратегия", Стратегия);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТаблицаБектестов.Очистить();
	ТекущаяДатаТС  		= ТСТочкиЗавершения;
	
	Пока Выборка.Следующий() Цикл
		
		ТочкаНачалаТС		= биг_ОбщегоНазначенияКлиентСервер.ДатуВTimestampЧисло(Дата(2024,1,1));
		Разница 			= ТекущаяДатаТС - ТочкаНачалаТС;
		КоличествоИтераций 	= Цел(Разница / Выборка.ВеличинаБара);
		
		НаименованиеЗадания = "Бектест: " + Стратегия + ", " + Выборка.ИнструментИД + ", " + Выборка.НастройкаСтратегии;
		
		НовоеЗадание = ТаблицаБектестов.Добавить();
		НовоеЗадание.Биржа 						= Биржа;
		НовоеЗадание.ИнструментИД 				= Выборка.ИнструментИД;
		НовоеЗадание.Бар 						= Выборка.Бар;
		НовоеЗадание.КлючНастроек 				= Выборка.НастройкаСтратегии;
		НовоеЗадание.ТочкаОтсчетаТС 			= ТочкаНачалаТС;
		НовоеЗадание.ТочкаОтсчета				= Дата(2024,1,1);
		НовоеЗадание.КоличествоИтераций 		= КоличествоИтераций;
		НовоеЗадание.НаименованиеЗадания 		= НаименованиеЗадания; 
		
		// коды состояний:
		// 0 - ожидает
		// 1 - запущено
		// 2 - выполнено
		НовоеЗадание.Состояние = 0;
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ДоделатьБектесты(Команда)

	ИндикаторПрогрессаБектестаОбщий = 0;
	ДатаЗавершения 		= ТекущаяДата();
	ОписаниеОповещения 	= Новый ОписаниеОповещения("ДоделатьБектестыЗавершениеВводаДаты", ЭтаФорма);
	ПоказатьВводДаты(ОписаниеОповещения, ДатаЗавершения, "Дата до которой нужно доделать бектесты");
	 
КонецПроцедуры

&НаКлиенте
Процедура ДоделатьБектестыЗавершениеВводаДаты(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		ТСТочкиЗавершения = биг_ОбщегоНазначенияКлиентСервер.ДатуВTimestampЧисло(Результат);
		ДоделатьБектестыНаСервере(ТСТочкиЗавершения);	
	КонецЕсли;		
	
	ДатаНачалаБектеста = ТекущаяДата();
	ПодключитьОбработчикиОжиданий();
	
КонецПроцедуры

&НаКлиенте
Процедура ПеределатьБектесты(Команда)
	
	ИндикаторПрогрессаБектестаОбщий = 0;
	ДатаЗавершения 		= ТекущаяДата();
	ОписаниеОповещения 	= Новый ОписаниеОповещения("ПеределатьБектестыЗавершениеВводаДаты", ЭтаФорма);
	ПоказатьВводДаты(ОписаниеОповещения, ДатаЗавершения, "Дата до которой нужно доделать бектесты");
	
КонецПроцедуры

&НаКлиенте
Процедура ПеределатьБектестыЗавершениеВводаДаты(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		ТСТочкиЗавершения = биг_ОбщегоНазначенияКлиентСервер.ДатуВTimestampЧисло(Результат);
		ПеределатьБектестыНаСервере(ТСТочкиЗавершения);	
	КонецЕсли;		
	
	ДатаНачалаБектеста = ТекущаяДата();
	ПодключитьОбработчикиОжиданий();
	
КонецПроцедуры

#КонецОбласти //Бектест


#Область РаботаСДиаграммами

&НаСервере
Процедура ОбновитьДанныеДиаграммФормы()
	              
    ГрафикСвечи.Обновление 		= Ложь;
    ГрафикСвечи.Очистить(); 
	
	ГрафикОбъем.Обновление 		= Ложь;
    ГрафикОбъем.Очистить();
	
	ГрафикРСИ.Обновление 		= Ложь;
    ГрафикРСИ.Очистить(); 
	
	ГрафикЧайкина.Обновление	= Ложь;
	ГрафикЧайкина.Очистить();
	
	ГрафикАТР.Обновление		= Ложь;
	ГрафикАТР.Очистить();
	
	ГрафикЦенаЗакрытия.Обновление = Ложь;
	ГрафикЦенаЗакрытия.Очистить();
	    
	КурсМин 	= 9999999999;
	КурсМакс	= 0;
	
	RSIМин		= 0;
	RSIMax 		= 100;
	
	ЧайкинМакс	= 0;
	ЧайкинМин	= 9999999999;
	
	АТРМакс		= 0;
	АТРМин		= 9999999999;

	ЦенаМакс	= 0;
	ЦенаМин		= 9999999999;	
	
	ЗаполнениеТочекДиаграмм(КурсМин, КурсМакс, ЧайкинМакс, ЧайкинМин, АТРМакс, АТРМин, ЦенаМакс, ЦенаМин);	        
	ОбщиеНастройкиОформленияГрафиков(КурсМин, КурсМакс, ЧайкинМакс, ЧайкинМин, АТРМакс, АТРМин, RSIMax, RSIМин, ЦенаМакс, ЦенаМин);
	         	
	ГрафикСвечи.Обновление 			= Истина;
	ГрафикОбъем.Обновление 			= Истина;	
	ГрафикЧайкина.Обновление 		= Истина;
	ГрафикРСИ.Обновление 			= Истина;	
	ГрафикАТР.Обновление 			= Истина;
	ГрафикЦенаЗакрытия.Обновление	= Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнениеТочекДиаграмм(КурсМин, КурсМакс, ЧайкинМакс, ЧайкинМин, АТРМакс, АТРМин, ЦенаМакс, ЦенаМин)
	                     	
    СерияСвечи 				= ГрафикСвечи.Серии.Добавить(ИнструментИД);
	СерияЦена				= ГрафикЦенаЗакрытия.Серии.Добавить("Цена");
	СерияЦенаКороткий		= ГрафикЦенаЗакрытия.Серии.Добавить("ЦенаМА_Короткий");
	СерияЦенаДлинный		= ГрафикЦенаЗакрытия.Серии.Добавить("ЦенаМА_Длинный");
	СерияОбъем 				= ГрафикОбъем.Серии.Добавить("Объем");
	СерияЧайкин             = ГрафикЧайкина.Серии.Добавить("Чайкин");
	СерияЧайкин_СМА         = ГрафикЧайкина.Серии.Добавить("Чайкин_СМА");
	СерияЧайкин_МА   		= ГрафикЧайкина.Серии.Добавить("Чайкин_МА");
	
	СерияЧайкин_ТВМакс 		= ГрафикЧайкина.Серии.Добавить("Чайкин_ТВМакс");
	СерияЧайкин_ТВМин  		= ГрафикЧайкина.Серии.Добавить("Чайкин_ТВМин");
	
	СерияРСИ          		= ГрафикРСИ.Серии.Добавить("РСИ");
	СерияРСИ_СМА            = ГрафикРСИ.Серии.Добавить("РСИ_СМА");
	СерияАТР                = ГрафикАТР.Серии.Добавить("АТР");
		
	ТаблицаСвечей = ПолучитьТаблицуСвечей();
	Если ТаблицаСвечей = Неопределено Тогда
		Возврат;
	КонецЕсли;  
	
	ОбщийОбъемПоГрафику = 0;
	КоличествоСвечей	= 0;
	
	СвечиНачалоПериода 		= Дата(3099, 1, 1);
	СвечиЗавершениеПериода	= Дата(1,1,1);
		
	Для каждого ВыборкаДанныхСвечей Из ТаблицаСвечей Цикл
		 		
		ЭтоКрасная				= биг_ОбщегоНазначения.ЭтоКраснаяСвеча(ВыборкаДанныхСвечей);		     	
		ФорматнаяСтрока 		= ПолучитьФорматнуюСтрокуГрафика(); 
		ДатаСвечи 				= биг_ОбщегоНазначенияКлиентСервер.TimestampВДату(ВыборкаДанныхСвечей.TimeStamp10);
		ИмяСвечи				= Формат(ДатаСвечи, ФорматнаяСтрока);
		
		ОбщийОбъемПоГрафику		= ОбщийОбъемПоГрафику + ВыборкаДанныхСвечей.volCcy;
		КоличествоСвечей		= КоличествоСвечей + 1;
		
		СвечиНачалоПериода		= Мин(СвечиНачалоПериода, ДатаСвечи);
		СвечиЗавершениеПериода	= Макс(СвечиЗавершениеПериода, ДатаСвечи);
				
		ТочкаОткрытия 			= ГрафикСвечи.УстановитьТочку(ИмяСвечи);
		Если ЭтоКрасная Тогда
			ТочкаОткрытия.ПриоритетЦвета	= Истина;
			ТочкаОткрытия.Цвет	= биг_ОбщегоНазначенияКлиентСервер.ЦветКрасныйТрейдингВью();
		КонецЕсли;
		
		ГрафикСвечи.УстановитьЗначение(ТочкаОткрытия, СерияСвечи, ВыборкаДанныхСвечей.ЦенаОткрытия);
		                                                            		
		ТочкаМакс 				= ГрафикСвечи.УстановитьТочку(ИмяСвечи + "_High");		
		ГрафикСвечи.УстановитьЗначение(ТочкаМакс, СерияСвечи, ВыборкаДанныхСвечей.ЦенаМаксимум);
		
		ТочкаМин 				= ГрафикСвечи.УстановитьТочку(ИмяСвечи + "_Low");		
		ГрафикСвечи.УстановитьЗначение(ТочкаМин, СерияСвечи, ВыборкаДанныхСвечей.ЦенаМинимум);
		
		ТочкаЗакрытия 			= ГрафикСвечи.УстановитьТочку(ИмяСвечи + "_Close");		
		ГрафикСвечи.УстановитьЗначение(ТочкаЗакрытия, СерияСвечи, ВыборкаДанныхСвечей.ЦенаЗакрытия);
				
		КурсМин 				= Мин(КурсМин, ВыборкаДанныхСвечей.ЦенаМинимум);
		КурсМакс				= Макс(КурсМакс, ВыборкаДанныхСвечей.ЦенаМаксимум);
		
		
		// ГРАФИК ЦЕНА
		ТочкаЦены = ГрафикЦенаЗакрытия.УстановитьТочку(ИмяСвечи);
		ГрафикЦенаЗакрытия.УстановитьЗначение(ТочкаЦены, СерияЦена, ВыборкаДанныхСвечей.ЦенаЗакрытия);
		ГрафикЦенаЗакрытия.УстановитьЗначение(ТочкаЦены, СерияЦенаКороткий, ВыборкаДанныхСвечей.Цена_МА_Короткий);
		ГрафикЦенаЗакрытия.УстановитьЗначение(ТочкаЦены, СерияЦенаДлинный, ВыборкаДанныхСвечей.Цена_МА_Длинный);
		ЦенаМакс = Макс(ЦенаМакс, ВыборкаДанныхСвечей.ЦенаЗакрытия, ВыборкаДанныхСвечей.Цена_МА_Короткий, ВыборкаДанныхСвечей.Цена_МА_Длинный);
		ЦенаМин	 = Мин(ЦенаМин, ВыборкаДанныхСвечей.ЦенаЗакрытия, ВыборкаДанныхСвечей.Цена_МА_Короткий, ВыборкаДанныхСвечей.Цена_МА_Длинный);
		
		
		// ГРАФИК ОБЪЕМ
		ТочкаОбъема = ГрафикОбъем.УстановитьТочку(ИмяСвечи);
		ГрафикОбъем.УстановитьЗначение(ТочкаОбъема, СерияОбъем, 	ВыборкаДанныхСвечей.volCcy);
				
		Если ЭтоКрасная Тогда
			ТочкаОбъема.Цвет = биг_ОбщегоНазначенияКлиентСервер.ЦветКрасныйТрейдингВью(); 
			ТочкаОбъема.ПриоритетЦвета = Истина;
		КонецЕсли;
		
		
		// Чайкин
		ТочкаЧайкин = ГрафикЧайкина.УстановитьТочку(ИмяСвечи);
		ГрафикЧайкина.УстановитьЗначение(ТочкаЧайкин, СерияЧайкин, 			ВыборкаДанныхСвечей.Чайкин);
		ГрафикЧайкина.УстановитьЗначение(ТочкаЧайкин, СерияЧайкин_СМА, 		ВыборкаДанныхСвечей.Чайкин_СМА);
		ГрафикЧайкина.УстановитьЗначение(ТочкаЧайкин, СерияЧайкин_МА, 		ВыборкаДанныхСвечей.Чайкин_МА);		
		ГрафикЧайкина.УстановитьЗначение(ТочкаЧайкин, СерияЧайкин_ТВМакс, 	ВыборкаДанныхСвечей.Чайкин_ТВМакс);
		ГрафикЧайкина.УстановитьЗначение(ТочкаЧайкин, СерияЧайкин_ТВМин, 	ВыборкаДанныхСвечей.Чайкин_ТВМин);
		
		ЧайкинМакс  = Макс(ЧайкинМакс, ВыборкаДанныхСвечей.Чайкин, ВыборкаДанныхСвечей.Чайкин_СМА, ВыборкаДанныхСвечей.Чайкин_МА, ВыборкаДанныхСвечей.Чайкин_ТВМакс); 
		ЧайкинМин	= Мин(ЧайкинМин, ВыборкаДанныхСвечей.Чайкин, ВыборкаДанныхСвечей.Чайкин_СМА, ВыборкаДанныхСвечей.Чайкин_МА, ВыборкаДанныхСвечей.Чайкин_ТВМин); 
				
		// RSI 
		ТочкаРСИ 				= ГрафикРСИ.УстановитьТочку(ИмяСвечи);
		ТочкаРСИ.Цвет 			= биг_ОбщегоНазначенияКлиентСервер.ЦветСинийТрейдингВью();
		ТочкаРСИ.ПриоритетЦвета = Истина;
		ГрафикРСИ.УстановитьЗначение(ТочкаРСИ, СерияРСИ, ВыборкаДанныхСвечей.РСИ);
		ГрафикРСИ.УстановитьЗначение(ТочкаРСИ, СерияРСИ_СМА, ВыборкаДанныхСвечей.РСИ_СМА);
		
		
		// АТР
		ТочкаАТР = ГрафикАТР.УстановитьТочку(ИмяСвечи);
		ГрафикАТР.УстановитьЗначение(ТочкаАТР, СерияАТР, ВыборкаДанныхСвечей.АТР); 
		
		АТРМакс = Макс(АТРМакс, ВыборкаДанныхСвечей.АТР);
		АТРМин	= Мин(АТРМин, ВыборкаДанныхСвечей.АТР); 
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТаблицуСвечей()
	
	ПараметрыЗапроса 	= биг_ОбщегоНазначения.ПолучитьСтруктуруПараметровЗапросаДанныхПоСвечам();
	ПараметрыЗапроса.Биржа 			= Биржа;
	ПараметрыЗапроса.ИнструментИД	= ИнструментИД;
	ПараметрыЗапроса.Бар			= Бар;
	
	ПараметрыЗапроса.ТочкаВремениТС_НачалоПериода       = биг_ОбщегоНазначенияКлиентСервер.ДатуВTimestampЧисло(ТочкаНачала);
	ПараметрыЗапроса.ТочкаВремениТС_ЗавершениеПериода 	= биг_ОбщегоНазначенияКлиентСервер.ДатуВTimestampЧисло(ТочкаЗавершения);
	
	Если НЕ ЗначениеЗаполнено(КлючНастроек) Тогда
		КлючДляИндикаторов = биг_СтратегииСервер.ПолучитьКлючСтратегииПоУмолчанию(Стратегия);
	Иначе
		КлючДляИндикаторов = КлючНастроек;
	КонецЕсли;
	
	ЗадачиРасчета = биг_УправлениеИндикаторамиСервер.ЗадачиРасчетаДляАлгоИмпакт(КлючДляИндикаторов);
	Возврат биг_ОбщегоНазначения.ПолучитьДанныеСвечейПоТочкеСИндикаторами(ПараметрыЗапроса, ЗадачиРасчета, Истина);	
	
КонецФункции

&НаСервере
Процедура ОбщиеНастройкиОформленияГрафиков(КурсМин, КурсМакс, ЧайкинМакс, ЧайкинМин, АТРМакс, АТРМин, RSIMax, RSIМин, ЦенаМакс, ЦенаМин)
	
	// ГРАФИК СВЕЧИ 
	ШаговГрафика  	= 8;
	ДиапазонЦен		= КурсМакс - КурсМин;
	ЗначениеШага	= ОкруглитьГраницу(ДиапазонЦен / ШаговГрафика);
	
	// рассчитаем верх. планку
	ГраницаВерх = КурсМакс + ЗначениеШага;
	ГраницаНиз	= КурсМин - ЗначениеШага;
	
	Свечи_ОсьY 											= ГрафикСвечи.ОсьЗначений;
	Свечи_ОсьY.МинимальноеЗначение 						= ГраницаНиз;
	Свечи_ОсьY.СпособОпределенияМинимальногоЗначения 	= СпособОпределенияОграничивающегоЗначенияДиаграммы.ИспользоватьЗначение;
	Свечи_ОсьY.МаксимальноеЗначение 					= ГраницаВерх;
	Свечи_ОсьY.СпособОпределенияМинимальногоЗначения 	= СпособОпределенияОграничивающегоЗначенияДиаграммы.ИспользоватьЗначение;
		
	// ГРАФИК ЦЕНА
	ДиапазонЦен											= ЦенаМакс - ЦенаМин;
	ЗначениеШага										= ОкруглитьГраницу(ДиапазонЦен / ШаговГрафика);
	ГраницаВерх 										= ЦенаМакс + ЗначениеШага;
	ГраницаНиз											= ЦенаМин - ЗначениеШага;
	
	Цена_ОсьY 											= ГрафикЦенаЗакрытия.ОсьЗначений;
	Цена_ОсьY.МинимальноеЗначение 						= ГраницаНиз;
	Цена_ОсьY.СпособОпределенияМинимальногоЗначения 	= СпособОпределенияОграничивающегоЗначенияДиаграммы.ИспользоватьЗначение;	
	Цена_ОсьY.МаксимальноеЗначение 						= ГраницаВерх;
	Цена_ОсьY.СпособОпределенияМаксимальногоЗначения 	= СпособОпределенияОграничивающегоЗначенияДиаграммы.ИспользоватьЗначение;

	Для каждого Серия Из ГрафикЦенаЗакрытия.Серии Цикл
		Если Серия.Текст = "Цена" Тогда 		
			Серия.Цвет 							= биг_ОбщегоНазначенияКлиентСервер.ЦветКрасныйТрейдингВью();			
		ИначеЕсли Серия.Текст = "ЦенаМА_Короткий" Тогда		
			Серия.Цвет 							= биг_ОбщегоНазначенияКлиентСервер.ЦветСинийТрейдингВью();			
		ИначеЕсли Серия.Текст = "ЦенаМА_Длинный" Тогда			
			Серия.Цвет 							= биг_ОбщегоНазначенияКлиентСервер.ЦветОранжевыйВизуалСтудио();				
		КонецЕсли;
		
		Серия.Маркер						= ТипМаркераДиаграммы.Нет;
		Серия.ТипГрафическогоПредставления	= ТипГрафическогоПредставленияСерииДиаграммы.График;
		Серия.Линия							= Новый Линия(ТипЛинииДиаграммы.Сплошная, 1);
	КонецЦикла;
		
	
	// ГРАФИК RSI	
	РСИ_ОсьY 											= ГрафикРСИ.ОсьЗначений;
	РСИ_ОсьY.МинимальноеЗначение 						= RSIМин;
	РСИ_ОсьY.СпособОпределенияМинимальногоЗначения 		= СпособОпределенияОграничивающегоЗначенияДиаграммы.ИспользоватьЗначение;	
	РСИ_ОсьY.МаксимальноеЗначение 						= RSIMax;
	РСИ_ОсьY.СпособОпределенияМаксимальногоЗначения 	= СпособОпределенияОграничивающегоЗначенияДиаграммы.ИспользоватьЗначение;
	
	Для каждого Серия Из ГрафикРСИ.Серии Цикл
		Если Серия.Текст = "РСИ" Тогда
			Серия.Цвет = биг_ОбщегоНазначенияКлиентСервер.ЦветКрасныйТрейдингВью();			
		ИначеЕсли Серия.Текст = "РСИ_СМА" Тогда			
			Серия.Цвет = биг_ОбщегоНазначенияКлиентСервер.ЦветСинийТрейдингВью();
		КонецЕсли;		
		Серия.Маркер	= ТипМаркераДиаграммы.Нет;
		//Серия.Линия		= Новый Линия(ТипЛинииДиаграммы.Сплошная, 1);
	КонецЦикла;
	
	
	// ГРАФИК ЧАЙКИНА
	Для каждого Серия Из ГрафикЧайкина.Серии Цикл
		Если Серия.Текст = "Чайкин" Тогда
			Серия.Цвет = биг_ОбщегоНазначенияКлиентСервер.ЦветКрасныйТрейдингВью();			
		ИначеЕсли Серия.Текст = "Чайкин_СМА" Тогда			
			Серия.Цвет = биг_ОбщегоНазначенияКлиентСервер.ЦветСинийТрейдингВью();
		ИначеЕсли Серия.Текст = "Чайкин_МА" Тогда			
			Серия.Цвет = биг_ОбщегоНазначенияКлиентСервер.ЦветОранжевыйВизуалСтудио();			
		ИначеЕсли Серия.Текст = "Чайкин_ТВМакс" Тогда			
			Серия.Цвет = биг_ОбщегоНазначенияКлиентСервер.ЦветГолубойВизуалСтудио();
		ИначеЕсли Серия.Текст = "Чайкин_ТВМин" Тогда			
			Серия.Цвет = биг_ОбщегоНазначенияКлиентСервер.ЦветГолубойВизуалСтудио();	
		КонецЕсли;
		
		Серия.Маркер	= ТипМаркераДиаграммы.Нет;
		//Серия.Линия		= Новый Линия(ТипЛинииДиаграммы.Сплошная, 1);
	КонецЦикла;
	
	// ГРАФИК АТР
	ДиапазонЦен											= АТРМакс - АТРМин;
	ЗначениеШага										= ОкруглитьГраницу(ДиапазонЦен / ШаговГрафика);
	ГраницаВерх 										= ОкруглитьГраницу(АТРМакс + ЗначениеШага);
	ГраницаНиз											= ОкруглитьГраницу(АТРМин - ЗначениеШага);
	
	АТР_ОсьY 											= ГрафикАТР.ОсьЗначений;
	АТР_ОсьY.МинимальноеЗначение 						= ГраницаНиз;
	АТР_ОсьY.СпособОпределенияМинимальногоЗначения 		= СпособОпределенияОграничивающегоЗначенияДиаграммы.ИспользоватьЗначение;	
	АТР_ОсьY.МаксимальноеЗначение 						= ГраницаВерх;
	АТР_ОсьY.СпособОпределенияМаксимальногоЗначения 	= СпособОпределенияОграничивающегоЗначенияДиаграммы.ИспользоватьЗначение;
	
	//ГрафикАТР.Серии[0].Линия							= Новый Линия(ТипЛинииДиаграммы.Сплошная, 1);
	
	// выравнивание левой границы графиков "в линию"
	ГрафикСвечи.ОбластьПостроения.Лево 			= 0.011;
	ГрафикОбъем.ОбластьПостроения.Лево 			= 0.014;
	ГрафикРСИ.ОбластьПостроения.Лево 			= 0.028;	
	ГрафикЧайкина.ОбластьПостроения.Лево		= 0.028;
	ГрафикАТР.ОбластьПостроения.Лево			= 0.028;
	ГрафикЦенаЗакрытия.ОбластьПостроения.Лево	= 0.028;
	
КонецПроцедуры

&НаСервере
Процедура ОформлениеИнтерваловГрафикаRSI()
	
	Если ГрафикРСИ.ИнформационныеИнтервалыЗначений.Количество() = 0 Тогда
		Интервал = ГрафикРСИ.ИнформационныеИнтервалыЗначений.Добавить();
		Интервал.Начало = 40;
		Интервал.Конец 	= 60;
		Интервал.Цвет 	= биг_ОбщегоНазначенияКлиентСервер.ЦветСинийТрейдингВью();
		Интервал.ПроцентПолупрозрачности = 90;
		Интервал.ТекстПодписи = "";

		ЛинияГраницы 			= Новый Линия(ТипЛинииДиаграммы.Пунктир, 2);
		Интервал.Граница		= ЛинияГраницы;
		Интервал.ЦветГраницы	= биг_ОбщегоНазначенияКлиентСервер.ЦветБелый();	
	КонецЕсли;

	Если ГрафикРСИ.ИнформационныеЛинииЗначений.Количество() = 0 Тогда
		ЛинияТочки 			= ГрафикРСИ.ИнформационныеЛинииЗначений.Добавить();
		ЛинияТочки.Значение = 50;
		ЛинияТочки.Линия	= Новый Линия(ТипЛинииДиаграммы.Пунктир, 2);	
		ЛинияТочки.Цвет		= биг_ОбщегоНазначенияКлиентСервер.ЦветБелый();	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиВспомогательныеПометкиНаДиаграмму()

	ОчиститьКоллекциюИнформационныхЛиний(ГрафикСвечи.ИнформационныеЛинииТочек);
	ОчиститьКоллекциюИнформационныхЛиний(ГрафикСвечи.ИнформационныеЛинииЗначений);
		
	Если ДетализацияСигнала.Количество() > 0 Тогда
				
		Если ЗначениеЗаполнено(Сигнал) Тогда
			
			ВывестиВспомогательныеПометкиНаДиаграммуПоСигналу(Сигнал);
		Иначе
			
			Для каждого Строка Из Элементы.Сигнал.СписокВыбора Цикл
				ВывестиВспомогательныеПометкиНаДиаграммуПоСигналу(Строка.Значение, Ложь);	
			КонецЦикла;
		КонецЕсли;			
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиВспомогательныеПометкиНаДиаграммуПоСигналу(ВыбранныйСигнал, ВыводитьПозиции = Истина)
	
	КоллекцияЛинийТочек 	= ГрафикСвечи.ИнформационныеЛинииТочек;
	КоллекцияЛинийЗначений	= ГрафикСвечи.ИнформационныеЛинииЗначений;
		
	ФорматнаяСтрока 		= ПолучитьФорматнуюСтрокуГрафика();
	Поиск 					= Новый Структура("Сигнал, Точка", ВыбранныйСигнал, Неопределено);
	ТаблицаДеталей 			= ДетализацияСигнала.Выгрузить();
	
	Точка 					= НайтиЗначениеТочки(ТаблицаДеталей, Поиск, "ТочкаНачалаПадения");
	Если ЗначениеЗаполнено(Точка) И ТочкаВПериодеГрафика(Точка) Тогда           		         
		Значение 			= Формат(Точка, ФорматнаяСтрока);			
		ТекстЛинии			= биг_ОбщегоНазначенияКлиентСервер.TimestampВДату(ВыбранныйСигнал); //"НАЧАЛО ПАДЕНИЯ";                                          
		ЦветЛинии			= биг_ОбщегоНазначенияКлиентСервер.ЦветОранжевыйВизуалСтудио();
		ТипЛинии 			= ТипЛинииДиаграммы.Пунктир;
		ДобавитьИнформационнуюЛинию(КоллекцияЛинийТочек, Значение, ТекстЛинии, ЦветЛинии, ТипЛинии, 1);
	КонецЕсли;
	
	Точка 					= НайтиЗначениеТочки(ТаблицаДеталей, Поиск, "ТочкаРазворота");
	Если ЗначениеЗаполнено(Точка) И ТочкаВПериодеГрафика(Точка) Тогда
		Значение 			= Формат(Точка, ФорматнаяСтрока);         
		ТекстЛинии			= биг_ОбщегоНазначенияКлиентСервер.TimestampВДату(ВыбранныйСигнал); //"РАЗВОРОТ";                                          
		ЦветЛинии			= биг_ОбщегоНазначенияКлиентСервер.ЦветБелый();
		ТипЛинии 			= ТипЛинииДиаграммы.Пунктир;
		ДобавитьИнформационнуюЛинию(КоллекцияЛинийТочек, Значение, ТекстЛинии, ЦветЛинии, ТипЛинии, 1);
	КонецЕсли;
	
	//ДАЛЬШЕ нужно отрисовывать позицию, как это выглядит на бирже (уровень входа, уровни SL & TP)
	Если ВыводитьПозиции Тогда
		ВывестиИнформациюПоСостояниюОрдеровСигнала(КоллекцияЛинийЗначений, Поиск);		
	КонецЕсли;		
	
	ТочкаПричинаОтмены 			= НайтиЗначениеТочки(ТаблицаДеталей, Поиск, "ПричинаОтмены");
	ТочкаЗавершенПоложительно 	= НайтиЗначениеТочки(ТаблицаДеталей, Поиск, "ЗавершеноПоложительно");
	ТочкаЗавершен 				= НайтиЗначениеТочки(ТаблицаДеталей, Поиск, "ТочкаСигналЗавершен");
	
	Если ЗначениеЗаполнено(ТочкаЗавершен) И ТочкаВПериодеГрафика(ТочкаЗавершен) Тогда
		Значение 		= Формат(ТочкаЗавершен, ФорматнаяСтрока);         
		ТекстЛинии		= "ЗАВЕРШЕН " + биг_ОбщегоНазначенияКлиентСервер.TimestampВДату(ВыбранныйСигнал);  
		
		Если ТочкаЗавершенПоложительно Тогда
			ЦветЛинии 	= биг_ОбщегоНазначенияКлиентСервер.ЦветЗеленыйТрейдингВью();
			Подсказка	= "";
		Иначе
			ЦветЛинии	= биг_ОбщегоНазначенияКлиентСервер.ЦветКрасныйТрейдингВью();
			Подсказка	= ТочкаПричинаОтмены; 
		КонецЕсли;
			
		ТипЛинии 		= ТипЛинииДиаграммы.Точечная;
		ДобавитьИнформационнуюЛинию(КоллекцияЛинийТочек, Значение, ТекстЛинии, ЦветЛинии, ТипЛинии, 2, Подсказка);
	КонецЕсли;
	
	// текущая цена
	// пунктир
	// красный
	ТаймСтамп 	= биг_ОбщегоНазначенияКлиентСервер.ДатуВTimestampЧисло(ТочкаЗавершения);
	Структура 	= Новый Структура("ИнструментИД", ИнструментИД);
	ТекущаяЦена = биг_АлгоИмпакт.ПолучитьЦенуПоИсторическимДанным(Структура, Неопределено, ТаймСтамп);
	
	ТекстЛинии			= "";
	ЦветЛинии			= биг_ОбщегоНазначенияКлиентСервер.ЦветКрасныйТрейдингВью();
	ТипЛинии 			= ТипЛинииДиаграммы.Пунктир;	
	ДобавитьИнформационнуюЛинию(КоллекцияЛинийЗначений, ТекущаяЦена, ТекстЛинии, ЦветЛинии, ТипЛинии, 1);
	
КонецПроцедуры

&НаСервере
Функция НайтиЗначениеТочки(ТаблицаДеталей, Поиск, НазваниеТочки)
		
	Поиск.Точка = НазваниеТочки;
	МассивСтрок = ТаблицаДеталей.НайтиСтроки(Поиск);
	
	Если МассивСтрок.Количество() = 0 Тогда
		Возврат Неопределено;
	Иначе
		Возврат МассивСтрок[0].Значение;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ВывестиИнформациюПоСостояниюОрдеровСигнала(КоллекцияЛинийЗначений, Поиск)
	
	// точка = уровень цены
	
	// точка входа один и два
	// сумма BTC, Fee
	// зеленый
	ИнформацияОТочкеВходаОдин = ПолучитьИнформациюПоСостояниюОперации(Перечисления.биг_ДаблИмпактEvents.ПоискТочкиВходаОдин, Поиск);
	ВывестиИнформациюОТочкеВхода(КоллекцияЛинийЗначений, ИнформацияОТочкеВходаОдин);
		
	ИнформацияОТочкеВходаДва = ПолучитьИнформациюПоСостояниюОперации(Перечисления.биг_ДаблИмпактEvents.ПоискТочкиВходаДва, Поиск);
	ВывестиИнформациюОТочкеВхода(КоллекцияЛинийЗначений, ИнформацияОТочкеВходаДва);
	
	// стоп-лосс
	// объем BTC, PnL
	// красный
	ИнформацияОТочкеВыхода = ПолучитьИнформациюПоСостояниюОперации(Перечисления.биг_ДаблИмпактEvents.ВыполнениеСтопЛосс, Поиск);
	Если ИнформацияОТочкеВыхода <> Неопределено И ИнформацияОТочкеВыхода.Дата <= ТочкаЗавершения Тогда
		ВывестиИнформациюОТочкеВыхода(КоллекцияЛинийЗначений, ИнформацияОТочкеВыхода);
	Иначе
		
		ИнформацияОСтопЛосс = ПолучитьИнформациюПоСостояниюСтопЛоссСигнала(Поиск);
		ВывестиИнформациюОСтопЛосс(КоллекцияЛинийЗначений, ИнформацияОСтопЛосс, ИнформацияОТочкеВходаОдин, ИнформацияОТочкеВходаДва);	
	КонецЕсли;
	          
КонецПроцедуры

&НаСервере
Процедура ВывестиИнформациюОТочкеВхода(КоллекцияЛинийЗначений, ИнформацияОТочкеВхода)
	
	Если ИнформацияОТочкеВхода <> Неопределено И ИнформацияОТочкеВхода.Дата <= ТочкаЗавершения Тогда
	//Если ИнформацияОТочкеВхода <> Неопределено И ТочкаВПериодеГрафика(ИнформацияОТочкеВхода.Дата) Тогда
	
		Инструмент			= Справочники.big_Instruments.НайтиПоРеквизиту("instId", ИнформацияОТочкеВхода.Операция.instId);
		Значение 			= ИнформацияОТочкеВхода.Уровень;         
		
		// | BTC 2.0931 | Fee -67.15 USD |
		ШаблонНадписи		= " | = %1 = | %2 %3 | Fee %4 %5 |";
		ТекстЛинии			= СтрШаблон(ШаблонНадписи, ?(ИнформацияОТочкеВхода.Направление = Перечисления.big_OKX_OrderSides.buy, "LONG", "SHORT"), 
														ИнформацияОТочкеВхода.Монета, 
														ИнформацияОТочкеВхода.Размер * Инструмент.ctVal, 
														Окр(ИнформацияОТочкеВхода.Комиссия, 2), 
														ИнформацияОТочкеВхода.МонетаКомиссии);                                                                            

		ЦветЛинии			= биг_ОбщегоНазначенияКлиентСервер.ЦветЗеленыйТрейдингВью();
		ТипЛинии 			= ТипЛинииДиаграммы.Сплошная;
		
		ДобавитьИнформационнуюЛинию(КоллекцияЛинийЗначений, Значение, ТекстЛинии, ЦветЛинии, ТипЛинии, 2);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиИнформациюОТочкеВыхода(КоллекцияЛинийЗначений, ИнформацияОТочкеВыхода)
		
	Значение 			= ИнформацияОТочкеВыхода.Уровень;
	Инструмент			= Справочники.big_Instruments.НайтиПоРеквизиту("instId", ИнформацияОТочкеВыхода.Операция.instId);
	
	// | BTC 2.0931 | Fee -67.15 USD | PnL 2001.31 USD |
	ШаблонНадписи		= " | = SELL = |  %1 %2  |  Fee %3 %4  |  PnL %5 USD  |";
	ТекстЛинии			= СтрШаблон(ШаблонНадписи, ИнформацияОТочкеВыхода.Монета, ИнформацияОТочкеВыхода.Размер * Инструмент.ctVal, Окр(ИнформацияОТочкеВыхода.Комиссия, 2), ИнформацияОТочкеВыхода.МонетаКомиссии, Окр(ИнформацияОТочкеВыхода.ПрофитУбыток, 2));                                          
	ЦветЛинии			= ?(ИнформацияОТочкеВыхода.ПрофитУбыток > 0, биг_ОбщегоНазначенияКлиентСервер.ЦветЗеленыйТрейдингВью(), биг_ОбщегоНазначенияКлиентСервер.ЦветКрасныйТрейдингВью()); 
	ТипЛинии 			= ТипЛинииДиаграммы.Сплошная;
	
	ДобавитьИнформационнуюЛинию(КоллекцияЛинийЗначений, Значение, ТекстЛинии, ЦветЛинии, ТипЛинии, 3);
	
КонецПроцедуры 

&НаСервере
Процедура ВывестиИнформациюОСтопЛосс(КоллекцияЛинийЗначений, ИнформацияОСтопЛосс, ИнформацияОТочкеВходаОдин, ИнформацияОТочкеВходаДва)

	Если ИнформацияОСтопЛосс <> Неопределено И ИнформацияОСтопЛосс.Дата <= ТочкаЗавершения Тогда
	//Если ИнформацияОСтопЛосс <> Неопределено И ТочкаВПериодеГрафика(ИнформацияОСтопЛосс.Дата) Тогда
		
		ОбщийОбъем 			= ИнформацияОТочкеВходаОдин.Размер + ?(ИнформацияОТочкеВходаДва = Неопределено, 0, ИнформацияОТочкеВходаДва.Размер);
		ТекущиеЗатраты 		= биг_ОКХ_Сервер.ВычислитьПрофитУбытокСигналаПоордеруСигнала(ИнформацияОТочкеВходаОдин.Операция, Истина);	
		
		Инструмент			= Справочники.big_Instruments.НайтиПоРеквизиту("instId", ИнформацияОСтопЛосс.Операция.instId);
		СуммаПродажи 		= ОбщийОбъем * ИнформацияОСтопЛосс.Уровень * Инструмент.ctVal;				                             
		КомиссияСПродажи 	= Окр(СуммаПродажи / 100 * 0.005 *-1, 2);
		
		Если ИнформацияОСтопЛосс.posSide = Перечисления.big_OKX_PositionSides.long Тогда
			СуммаПродажи 	= СуммаПродажи *-1;			
		КонецЕсли;
		
		ПрофитУбыток		= Окр(СуммаПродажи + ТекущиеЗатраты + КомиссияСПродажи, 2);
		Значение 			= ИнформацияОСтопЛосс.Уровень;         
			
		// | BTC 2.0931 | Fee -67.15 USD | PnL 2001.31 USD | 
		
		//ШаблонНадписи		= " | = SL = | %1 %2  |  Fee %3 %4  |  PnL %5 USD  |";
		//ТекстЛинии			= СтрШаблон(ШаблонНадписи, ИнформацияОТочкеВходаОдин.Монета, ОбщийОбъем, КомиссияСПродажи, ИнформацияОТочкеВходаОдин.МонетаКомиссии, ПрофитУбыток); 
		
		ШаблонНадписи		= " | SL | %1 %2  |  PnL %3 USD  |";
		ТекстЛинии			= СтрШаблон(ШаблонНадписи, ИнформацияОТочкеВходаОдин.Монета, ОбщийОбъем * Инструмент.ctVal, ПрофитУбыток);
		
		//ЦветЛинии			= ?(ПрофитУбыток > 0, биг_ОбщегоНазначенияКлиентСервер.ЦветЗеленыйТрейдингВью(), биг_ОбщегоНазначенияКлиентСервер.ЦветКрасныйТрейдингВью());
		ЦветЛинии			= биг_ОбщегоНазначенияКлиентСервер.ЦветКрасныйТрейдингВью();
		ТипЛинии 			= ТипЛинииДиаграммы.Сплошная;
		
		ДобавитьИнформационнуюЛинию(КоллекцияЛинийЗначений, Значение, ТекстЛинии, ЦветЛинии, ТипЛинии, 2);
	КонецЕсли;
	
КонецПроцедуры
          
&НаСервере
Функция ПолучитьИнформациюПоСостояниюОперации(Событие, Поиск)
	
	// TODO - это тоже нужно делать через модуль "МаркетАпи", что бы было универсально
	// т.е. модуль определяет по запросу какая биржа (по аккаунту) и соответствующий модуль вызывает
	// сама конечная функция должна быть в модуле биржи, т.к. у каждой биржи свои доки и их структура
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	биг_ДаблИмпактОперации.Операция КАК Операция,
	|	биг_ДаблИмпактОперации.Операция.fillSz КАК Размер,
	|	биг_ДаблИмпактОперации.Операция.fillPx КАК Уровень,
	|	"""" КАК Монета,
	|	биг_ДаблИмпактОперации.Операция.fee КАК Комиссия,
	|	биг_ДаблИмпактОперации.Операция.feeCcy КАК МонетаКомиссии,
	|	биг_ДаблИмпактОперации.Операция.Дата КАК Дата,
	|	биг_ДаблИмпактОперации.Операция.pnl КАК ПрофитУбыток,
	|	биг_ДаблИмпактОперации.Операция.side КАК Направление
	|ИЗ
	|	РегистрСведений.биг_ДаблИмпактОперации КАК биг_ДаблИмпактОперации
	|ГДЕ
	|	биг_ДаблИмпактОперации.Биржа = &Биржа
	|	И биг_ДаблИмпактОперации.ИнструментИД = &ИнструментИД
	|	И биг_ДаблИмпактОперации.ТочкаНачалаПадения = &ТочкаНачалаПадения
	|	И биг_ДаблИмпактОперации.Аккаунт = &Аккаунт
	|	И биг_ДаблИмпактОперации.Событие = &Событие
	|	И (ВЫРАЗИТЬ(биг_ДаблИмпактОперации.Операция КАК Документ.big_Order_OKX)) <> ЗНАЧЕНИЕ(Документ.big_Order_OKX.ПустаяСсылка)
	|	И биг_ДаблИмпактОперации.НастройкаСтратегии = &КлючНастройки";
	
	Запрос.УстановитьПараметр("Биржа", 				Биржа);
	Запрос.УстановитьПараметр("ИнструментИД", 		ИнструментИД);
	Запрос.УстановитьПараметр("ТочкаНачалаПадения", Поиск.Сигнал);
	Запрос.УстановитьПараметр("Аккаунт", 			Аккаунт);
	Запрос.УстановитьПараметр("Событие", 			Событие);
	Запрос.УстановитьПараметр("КлючНастройки", 		КлючНастроек);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		Возврат Выборка;
	КонецЕсли;
	                    
КонецФункции

&НаСервере
Функция ПолучитьИнформациюПоСостояниюСтопЛоссСигнала(Поиск)
	
	// TODO - это тоже нужно делать через модуль "МаркетАпи", что бы было универсально
	// т.е. модуль определяет по запросу какая биржа (по аккаунту) и соответствующий модуль вызывает
	// сама конечная функция должна быть в модуле биржи, т.к. у каждой биржи свои доки и их структура
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	биг_ДаблИмпактОперации.Операция КАК Операция,
	|	биг_ОКХ_ИсторияАлгоОрдеровСрезПоследних.Период КАК Дата,
	|	биг_ОКХ_ИсторияАлгоОрдеровСрезПоследних.tpTriggerPx КАК tpTriggerPx,
	|	биг_ОКХ_ИсторияАлгоОрдеровСрезПоследних.tpOrdPx КАК tpOrdPx,
	|	биг_ОКХ_ИсторияАлгоОрдеровСрезПоследних.slTriggerPx КАК Уровень,
	|	биг_ОКХ_ИсторияАлгоОрдеровСрезПоследних.slOrdPx КАК slOrdPx,
	|	биг_ОКХ_ИсторияАлгоОрдеровСрезПоследних.sz КАК sz,
	|	биг_ОКХ_ИсторияАлгоОрдеровСрезПоследних.Документ.posSide КАК posSide
	|ИЗ
	|	РегистрСведений.биг_ДаблИмпактОперации КАК биг_ДаблИмпактОперации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.биг_ОКХ_ИсторияАлгоОрдеров.СрезПоследних(&ТочкаОтсчета, ) КАК биг_ОКХ_ИсторияАлгоОрдеровСрезПоследних
	|		ПО биг_ДаблИмпактОперации.Операция = биг_ОКХ_ИсторияАлгоОрдеровСрезПоследних.Документ
	|ГДЕ
	|	биг_ДаблИмпактОперации.Биржа = &Биржа
	|	И биг_ДаблИмпактОперации.ИнструментИД = &ИнструментИД
	|	И биг_ДаблИмпактОперации.ТочкаНачалаПадения = &ТочкаНачалаПадения
	|	И биг_ДаблИмпактОперации.Аккаунт = &Аккаунт
	|	И биг_ДаблИмпактОперации.Событие = &Событие
	|	И (ВЫРАЗИТЬ(биг_ДаблИмпактОперации.Операция КАК Документ.big_AlgoOrders_OKX)) <> ЗНАЧЕНИЕ(Документ.big_AlgoOrders_OKX.ПустаяСсылка)
	|	И биг_ДаблИмпактОперации.НастройкаСтратегии = &КлючНастройки";
	
	Запрос.УстановитьПараметр("Биржа", 				Биржа);
	Запрос.УстановитьПараметр("ТочкаОтсчета", 		ТочкаЗавершения);
	Запрос.УстановитьПараметр("ИнструментИД", 		ИнструментИД);
	Запрос.УстановитьПараметр("ТочкаНачалаПадения", Поиск.Сигнал);
	Запрос.УстановитьПараметр("Аккаунт", 			Аккаунт);
	Запрос.УстановитьПараметр("Событие", 			Перечисления.биг_ДаблИмпактEvents.ПоискТочкиВходаОдин);
	Запрос.УстановитьПараметр("КлючНастройки", 		КлючНастроек);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		Возврат Выборка;
	КонецЕсли;
	                    
КонецФункции

&НаСервере
Функция ТочкаВПериодеГрафика(ДатаТочки)
	
	Возврат СвечиНачалоПериода <= ДатаТочки И ДатаТочки <= СвечиЗавершениеПериода;
	
КонецФункции

&НаСервере
Процедура ДобавитьИнформационнуюЛинию(КоллекцияЛиний, ЗначениеТочки, ТекстЛинии, ЦветЛинии, ТипЛинии, ТолщинаЛинии = 5, Подсказка = "")
	
	ЛинияТочки = КоллекцияЛиний.Добавить();
	
	Если ТипЗнч(ЗначениеТочки) = Тип("Строка") Тогда
		ТочкаДиаграммы = ГрафикСвечи.УстановитьТочку(ЗначениеТочки);
		ЛинияТочки.Значение = ТочкаДиаграммы;
		ЛинияТочки.ОбластьПодписи.Ориентация 	= ОриентацияПодписейДиаграммы.Вертикально;
	Иначе
		Если ЗначениеЗаполнено(ЗначениеТочки) Тогда
			ЛинияТочки.Значение = ЗначениеТочки;
			ЛинияТочки.ОбластьПодписи.Ориентация 	= ОриентацияПодписейДиаграммы.Горизонтально;
		КонецЕсли;
			
	КонецЕсли;
	
	//ЛинияТочки = ГрафикСвечи.ИнформационныеЛинииТочек.Добавить();
	  
	ЛинияТочки.Подсказка					= Подсказка;
	ЛинияТочки.ТекстПодписи 				= ТекстЛинии;
	
	ЛинияТочки.Линия						= Новый Линия(ТипЛинии, ТолщинаЛинии);
	
	ЛинияТочки.Цвет							= ЦветЛинии;
	ЛинияТочки.ОбластьПодписи.ЦветТекста 	= ЦветЛинии; 
	
	ЛинияТочки.Положение					= ПоложениеИнформационнойЛинииДиаграммы.ВЗначении;
	ЛинияТочки.ПроцентПолупрозрачности		= 0;
	                                       
КонецПроцедуры

&НаСервере
Процедура ОформлениеИнтерваловГрафикаОбъема()

	// удалить
	ОчиститьКоллекциюИнформационныхЛиний(ГрафикОбъем.ИнформационныеЛинииЗначений);
	
	//ТаблицаДетализацияСигнала = ДетализацияСигнала.Выгрузить();
	//СтрокаНачалаПадения = ТаблицаДетализацияСигнала.Найти("ТочкаНачалаПадения", "Точка");
	//
	//СтрокаОбъема = ТаблицаДетализацияСигнала.Найти("СреднийОбъем", "Точка");
	//
	//СреднийОбъемПоГрафику = 0;
	//
	//Если ЗначениеЗаполнено(СтрокаОбъема) Тогда 
	//	
	//	СреднийОбъемПоГрафику = СтрокаОбъема.Значение;		
	//Иначе
	//	
	//	Если КоличествоСвечей > 0 Тогда
	//		СреднийОбъемПоГрафику = ОбщийОбъемПоГрафику / КоличествоСвечей;	
	//	КонецЕсли; 	 
	//КонецЕсли;	
	//
	//Если СреднийОбъемПоГрафику > 0 Тогда
	//	Линия = ГрафикОбъем.ИнформационныеЛинииЗначений.Добавить();
	//	Линия.Значение 					= СреднийОбъемПоГрафику;
	//	Линия.ТекстПодписи 				= "Средний объем";
	//	Линия.Цвет 						= биг_ОбщегоНазначенияКлиентСервер.ЦветСинийТрейдингВью();
	//	Линия.ОбластьПодписи.ЦветТекста = Линия.Цвет;
	//	Линия.Линия			 			= Новый Линия(ТипЛинииДиаграммы.Сплошная, 3);
	//	Линия.Подсказка					= "" + Линия.Значение + " - Средний объем за 72 свечи";
	//	Линия.ПроцентПолупрозрачности	= 0;	
	//КонецЕсли;      
		   	
КонецПроцедуры

&НаСервере
Процедура ОформлениеГрафикаЧайкина()
	
	ОчиститьКоллекциюИнформационныхЛиний(ГрафикЧайкина.ИнформационныеЛинииЗначений);
	ОчиститьКоллекциюИнформационныхЛиний(ГрафикЧайкина.ИнформационныеИнтервалыЗначений);

	ЛинияТочки 			= ГрафикЧайкина.ИнформационныеЛинииЗначений.Добавить();
	ЛинияТочки.Значение = 0;
	ЛинияТочки.Линия	= Новый Линия(ТипЛинииДиаграммы.Пунктир, 2);	
	ЛинияТочки.Цвет		= биг_ОбщегоНазначенияКлиентСервер.ЦветБелый();
	
КонецПроцедуры


Процедура ОчиститьКоллекциюИнформационныхЛиний(ИнформационныеЛинии)
	
	Количество = ИнформационныеЛинии.Количество();
	
	Для Сч=0 По Количество-1 Цикл               
		
		Индекс = Количество - 1 - Сч;
		ИнформационныеЛинии.Удалить(Индекс);	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьИсториюЗначенийДокумента(Операция, ТочкаВозвратаТС)
	
	ТочкаПроверки = биг_ОбщегоНазначенияКлиентСервер.TimestampВДату(ТочкаВозвратаТС);
	Если ТипЗнч(Операция) = Тип("ДокументСсылка.big_AlgoOrders_OKX") Тогда
		
		Набор = РегистрыСведений.биг_ОКХ_ИсторияАлгоОрдеров.СоздатьНаборЗаписей();
		Набор.Отбор.Документ.Установить(Операция);
		Набор.Прочитать();
		
		МассивУдалить = Новый Массив;
		
		Для каждого Строка Из Набор Цикл
			Если Строка.Период > ТочкаПроверки Тогда
				МассивУдалить.Добавить(Строка);	
			КонецЕсли;
		КонецЦикла;                            
		
		Для каждого Строка Из МассивУдалить Цикл
			Набор.Удалить(Строка);
		КонецЦикла;
		
		Набор.Записать(Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОкруглитьГраницу(Значение)
		
	ПредставлениеЗначения = Формат(Значение, "ЧРД=.; ЧГ=0");
	Подстроки = СтрРазделить(ПредставлениеЗначения, ".");
		
	Если Подстроки.Количество() = 2 Тогда
		ЕстьДробнаяЧасть = Истина;
	Иначе		
		ЕстьДробнаяЧасть = Ложь;	
	КонецЕсли;

	ДлинаЦелого 	= СтрДлина(Подстроки[0]);
	ДлинаДробной 	= ?(ЕстьДробнаяЧасть, СтрДлина(Подстроки[1]), 0);
	
	Если Значение < 1 Тогда
		
		Шаг = Окр(Значение, ДлинаДробной - 1);	
	Иначе
		
		Шаг = Окр(Значение, -1 * (ДлинаЦелого - 1));	
	КонецЕсли;
	
	Возврат Шаг;
	
КонецФункции

#КонецОбласти //РаботаСДиаграммами


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗаполнитьСписокВыбораИнструментов()

	СписокВыбора = Элементы.ИнструментИД.СписокВыбора;	
	СписокВыбора.Очистить();
	
	МассивВыбора = ПолучитьИнструментыСтратегии(Биржа, Стратегия);
	
	Для каждого Инструмент Из МассивВыбора Цикл
		СписокВыбора.Добавить(Инструмент, Инструмент);
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИнструментыСтратегии(Биржа, Стратегия)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	биг_ИнструментыСтратегийСрезПоследних.ИнструментИД КАК ИнструментИД
	|ИЗ
	|	РегистрСведений.биг_ИнструментыСтратегий.СрезПоследних(
	|			,
	|			Биржа = &Биржа
	|				И КлючНастройки.Владелец = &Стратегия) КАК биг_ИнструментыСтратегийСрезПоследних
	|ГДЕ
	|	биг_ИнструментыСтратегийСрезПоследних.Участие";
	Запрос.УстановитьПараметр("Биржа", 	Биржа);
	Запрос.УстановитьПараметр("Стратегия", Стратегия);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Массив = Новый Массив;
	Пока Выборка.Следующий() Цикл
		Массив.Добавить(Выборка.ИнструментИД);
	КонецЦикла;                               
	
	Возврат Массив;	
	
КонецФункции



&НаСервереБезКонтекста
Функция ПолучитьВеличинуБараНаСервере(Бар)
	
	Возврат Бар.SecondsAmount;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьФорму()
	
	СостояниеТеста 	= ПолучитьДанныеТеста();
	ТочкаОтсчета 	= биг_ОбщегоНазначенияКлиентСервер.TimestampВДату(СостояниеТеста.ТочкаНаЛинииВремени); 
	
	// Костыль для бектестов, исходя из текущего периода теста
	// TODO: продумать как определять точку "старта" для комбинаций, по которым еще не проводились тесты
	Если ТочкаОтсчета < Дата(2024,1,1) Тогда
		ТочкаОтсчета = Дата(2025,10,1);	
	КонецЕсли;
	
	ОбновитьДанныеМонитора();
	ЗагрузитьНастройкиСтратегии();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеМонитора()
	
	Если ЗначениеЗаполнено(Стратегия) 
			И ЗначениеЗаполнено(ИнструментИД) 
			И ЗначениеЗаполнено(Бар) Тогда

		ОпределениеПериодаГрафика();
		ЗаполнитьМонитор();	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьЗависимыеТочкиОбновитьМонитор()

	ТочкаНачала				= биг_ОбщегоНазначенияКлиентСервер.TimestampВДату(ТаймСтампЛеваяСвеча);
	ТочкаЗавершения			= биг_ОбщегоНазначенияКлиентСервер.TimestampВДату(ТаймСтампПраваяСвеча);
	
	ЗаполнитьМонитор();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьМонитор()

	ОбновитьДанныеДиаграммФормы();	
	ЗаполнитьСписокВыбораСигналов();
	
	ОформлениеИнтерваловГрафикаRSI(); 
	ОформлениеИнтерваловГрафикаОбъема();
	ОформлениеГрафикаЧайкина();
	
	ВывестиИнформациюПоВыбранномуСигналу();
	
КонецПроцедуры

&НаСервере
Процедура ВывестиИнформациюПоВыбранномуСигналу()
	
	Если Элементы.Сигнал.СписокВыбора.Количество() = 1 И Сигнал = 0 Тогда	
		 
		Сигнал = Элементы.Сигнал.СписокВыбора[0].Значение;				
	КонецЕсли;                               
	
	ЗаполнитьИнформациюПоСигналу();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИнформациюПоСигналу()
	
	ДанныеСигнала = биг_АлгоИмпакт.ПолучитьДетальнуюИнформациюПоСигналу(Биржа, ИнструментИД, Бар, КлючНастроек, Сигнал);
	
	ЗаполнитьСписокОпераций();		
	ЗаполнитьТаблицуДетализацияСигнала(ДанныеСигнала);
	ЗаполнитьТаблицуОпераций(ДанныеСигнала);
	ВывестиВспомогательныеПометкиНаДиаграмму();
	
КонецПроцедуры

&НаКлиенте
Процедура СигналПриИзменении(Элемент)
	
	ВывестиИнформациюПоВыбранномуСигналу();
	
КонецПроцедуры
           
&НаСервере
Процедура ЗаполнениеФормыПоУмолчанию()
	
	Биржа 			= РегистрыСведений.биг_ПредопределенныеЭлементы.ПолучитьЗначениеПоИмени("OKX");
    ИнструментИД 	= "ZRX-USDT-SWAP";
	//КлючНастроек	= Справочники.биг_КлючиНастроекСтратегии.НайтиПоКоду("000011016");  // рабочая
	КлючНастроек	= Справочники.биг_КлючиНастроекСтратегии.НайтиПоКоду("000016686");  // тест
	ТолькоАктуальные = Истина;
	
	Бар				= Справочники.big_BarTypes.H1;
    //Бар			= Справочники.big_BarTypes.M1;
	ВеличинаБара 	= ПолучитьВеличинуБараНаСервере(Бар);
		
	СостояниеТеста 	= ПолучитьДанныеТеста();
	ТочкаОтсчета 	= биг_ОбщегоНазначенияКлиентСервер.TimestampВДату(СостояниеТеста.ТочкаНаЛинииВремени);
	
	// реквизиты для отладки
	Отладка_Аккаунт	= Справочники.big_MarketAccounts.НайтиПоНаименованию("Акимов Владимир / DemoTrade", Истина,, Биржа);
	Аккаунт 		= Справочники.big_MarketAccounts.НайтиПоКоду("000000001");
	//Отладка_СуммаОперации	= 1000;
	//Отладка_УровеньСтопЛосс	= 65700;
	//МассТест_СписокИнструментИД.Добавить("APT-USDT-SWAP", "APT-USDT-SWAP");
	//МассТест_СписокИнструментИД.Добавить("AVAX-USDT-SWAP", "AVAX-USDT-SWAP");
	//МассТест_СписокИнструментИД.Добавить("NEAR-USDT-SWAP", "NEAR-USDT-SWAP");
	//МассТест_СписокИнструментИД.Добавить("SUI-USDT-SWAP", "SUI-USDT-SWAP");
	//МассТест_СписокИнструментИД.Добавить("TON-USDT-SWAP", "TON-USDT-SWAP");
	//МассТест_СписокИнструментИД.Добавить("ZRX-USDT-SWAP", "ZRX-USDT-SWAP");
	//
	//МассТест_СписокИнструментИД.Добавить("BNB-USDT-SWAP", "BNB-USDT-SWAP");
	//МассТест_СписокИнструментИД.Добавить("LINK-USDT-SWAP", "LINK-USDT-SWAP");
	//МассТест_СписокИнструментИД.Добавить("ETC-USDT-SWAP", "ETC-USDT-SWAP");
	//МассТест_СписокИнструментИД.Добавить("BCH-USDT-SWAP", "BCH-USDT-SWAP");
	//МассТест_СписокИнструментИД.Добавить("LTC-USDT-SWAP", "LTC-USDT-SWAP");
	//МассТест_СписокИнструментИД.Добавить("XLM-USDT-SWAP", "XLM-USDT-SWAP");
	//МассТест_СписокИнструментИД.Добавить("DOGE-USDT-SWAP", "DOGE-USDT-SWAP");
	//МассТест_СписокИнструментИД.Добавить("ADA-USDT-SWAP", "ADA-USDT-SWAP");
	//МассТест_СписокИнструментИД.Добавить("SHIB-USDT-SWAP", "SHIB-USDT-SWAP");
	//МассТест_СписокИнструментИД.Добавить("DOT-USDT-SWAP", "DOT-USDT-SWAP");
	//МассТест_СписокИнструментИД.Добавить("HBAR-USDT-SWAP", "HBAR-USDT-SWAP");
	//МассТест_СписокИнструментИД.Добавить("UNI-USDT-SWAP", "UNI-USDT-SWAP");
	//МассТест_СписокИнструментИД.Добавить("ICP-USDT-SWAP", "ICP-USDT-SWAP");
	//МассТест_СписокИнструментИД.Добавить("AAVE-USDT-SWAP", "AAVE-USDT-SWAP");
	//МассТест_СписокИнструментИД.Добавить("CRO-USDT-SWAP", "CRO-USDT-SWAP");

	//МассТест_СписокИнструментИД.Добавить("ETH-USDT-SWAP", "ETH-USDT-SWAP");
	//МассТест_СписокИнструментИД.Добавить("SOL-USDT-SWAP", "SOL-USDT-SWAP");
	//МассТест_СписокИнструментИД.Добавить("XRP-USDT-SWAP", "XRP-USDT-SWAP");
	//МассТест_СписокИнструментИД.Добавить("TRX-USDT-SWAP", "TRX-USDT-SWAP");
	//МассТест_СписокИнструментИД.Добавить("BTC-USDT-SWAP", "BTC-USDT-SWAP");
	
	Стратегия = биг_АлгоИмпакт.ЭтаСтратегия();
	ИсключаяВыполненныеТесты = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ОпределениеПериодаГрафика()

	// сигнал активен?
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	биг_ДаблИмпактСигналы.ТочкаНачалаПадения КАК ТочкаНачалаПадения,
	|	биг_ДаблИмпактСигналы.СигналЗавершен КАК СигналЗавершен
	|ИЗ
	|	РегистрСведений.биг_ДаблИмпактСигналы КАК биг_ДаблИмпактСигналы
	|ГДЕ
	|	биг_ДаблИмпактСигналы.Биржа = &Биржа
	|	И биг_ДаблИмпактСигналы.ИнструментИД = &ИнструментИД
	|	И биг_ДаблИмпактСигналы.Бар = &Бар
	|	И биг_ДаблИмпактСигналы.ТочкаНачалаПадения <= &ТочкаОтсчета
	|	И биг_ДаблИмпактСигналы.КлючНастроек = &КлючНастроек
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТочкаНачалаПадения УБЫВ";
	
	Если Не ЗначениеЗаполнено(ТочкаОтсчета) Тогда
		ТочкаОтсчета = ТекущаяДатаСеанса() - 10800;	
	КонецЕсли;
	ТочкаОтсчетаТС = биг_ОбщегоНазначенияКлиентСервер.ДатуВTimestampЧисло(ТочкаОтсчета);
	
	Запрос.УстановитьПараметр("Биржа", 			Биржа);
	Запрос.УстановитьПараметр("ИнструментИД", 	ИнструментИД);
	Запрос.УстановитьПараметр("Бар", 			Бар);
	Запрос.УстановитьПараметр("ТочкаОтсчета", 	ТочкаОтсчетаТС);
	Запрос.УстановитьПараметр("КлючНастроек", 	КлючНастроек);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		//Сигнал = Выборка.ТочкаНачалаПадения;	
		
		Если ЗначениеЗаполнено(Выборка.ТочкаНачалаПадения) И НЕ Выборка.СигналЗавершен Тогда      
			
			// сигнал активен - от точки сигнала влево 72 свечи, в право до текущего момента			
			ТаймСтампЛеваяСвеча 	= Выборка.ТочкаНачалаПадения - (Бар.SecondsAmount * 72);
			ТаймСтампПраваяСвеча	= ТочкаОтсчетаТС;
			
		Иначе
			
			// сигнал не активен, тогда 73 свечи включая последнюю	
			ТаймСтампПраваяСвеча	= ТочкаОтсчетаТС;
			ТаймСтампЛеваяСвеча		= биг_ОбщегоНазначения.НачалоПериодаПоБару(ТаймСтампПраваяСвеча, Бар) - (Бар.SecondsAmount * 73);
		КонецЕсли;
		
	Иначе
		
		ТаймСтампПраваяСвеча	= ТочкаОтсчетаТС;
		ТаймСтампЛеваяСвеча		= биг_ОбщегоНазначения.НачалоПериодаПоБару(ТаймСтампПраваяСвеча, Бар) - (Бар.SecondsAmount * 73);	
	КонецЕсли;
	      	     
	ТочкаНачала		= биг_ОбщегоНазначенияКлиентСервер.TimestampВДату(ТаймСтампЛеваяСвеча);
	ТочкаЗавершения	= биг_ОбщегоНазначенияКлиентСервер.TimestampВДату(ТаймСтампПраваяСвеча);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораСигналов()
	
	Если ЗначениеЗаполнено(ТочкаЗавершения) Тогда
		
		ТаймСтамп = биг_ОбщегоНазначенияКлиентСервер.ДатуВTimestampЧисло(ТочкаЗавершения);
		
		// получить детали сигнала                    
		ПараметрыИнструмента = Новый Структура("Биржа, ИнструментИД, Бар, КлючНастроек", Биржа, ИнструментИД, Бар, КлючНастроек); 		
		МассивСигналов = биг_АлгоИмпакт.ПолучитьМассивАктивныхСигналов(ПараметрыИнструмента, ТаймСтамп, ТолькоАктуальные);
		
		СписокВыбора = Элементы.Сигнал.СписокВыбора;
		СписокВыбора.Очистить();
		
		ДетализацияСигнала.Очистить();
		Для каждого АктивныйСигнал Из МассивСигналов Цикл
			
			// это технический сигнал, его проустить
			Если НЕ ЗначениеЗаполнено(АктивныйСигнал.ТочкаНачалаПадения) Тогда
				Продолжить;	
			КонецЕсли;
			
			Если (НЕ АктивныйСигнал.СигналЗавершен) И АктивныйСигнал.ТочкаНачалаПадения <= ТаймСтампПраваяСвеча Тогда
				
				ДобавитьСигналВТаблицу(СписокВыбора, АктивныйСигнал);
			Иначе
				
				Если АктивныйСигнал.ТочкаНачалаПадения <= ТаймСтампПраваяСвеча И АктивныйСигнал.ТочкаСигналЗавершен >= ТаймСтампЛеваяСвеча Тогда
						
					ДобавитьСигналВТаблицу(СписокВыбора, АктивныйСигнал);					
				КонецЕсли;	
			КонецЕсли;						
		КонецЦикла;
		
		// если несколько сигналов, то будет выводиться информация обо всех сразу
		// пока ручками не будет выбран один из сигналов (но потестив, кажется это лютая дрочь)
		ВсегоСигналов = СписокВыбора.Количество();
		
		//Если ВсегоСигналов > 1 Тогда
		//	Сигнал = 0;
		//КонецЕсли;
		
		Если ВсегоСигналов = 1 Тогда
			Сигнал = СписокВыбора[0].Значение;
		КонецЕсли;
			
	КонецЕсли;                           
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьСигналВТаблицу(СписокВыбора, АктивныйСигнал)

	СписокВыбора.Добавить(АктивныйСигнал.ТочкаНачалаПадения, биг_ОбщегоНазначенияКлиентСервер.TimestampВДату(АктивныйСигнал.ТочкаНачалаПадения));
	ЗаполнитьТаблицуДетализацияСигнала(АктивныйСигнал);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокОпераций()

	ТаблицаОпераций.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	биг_ДаблИмпактОперации.Аккаунт КАК Аккаунт,
	|	биг_ДаблИмпактОперации.Событие КАК Событие,
	|	биг_ДаблИмпактОперации.Операция КАК Операция
	|ИЗ
	|	РегистрСведений.биг_ДаблИмпактОперации КАК биг_ДаблИмпактОперации
	|ГДЕ
	|	биг_ДаблИмпактОперации.Биржа = &Биржа
	|	И биг_ДаблИмпактОперации.ИнструментИД = &ИнструментИД
	|	И биг_ДаблИмпактОперации.ТочкаНачалаПадения = &ТочкаНачалаПадения
	|	И биг_ДаблИмпактОперации.Операция.НастройкаСтратегии = &КлючНастроек";
	Запрос.УстановитьПараметр("Биржа", 				Биржа);
	Запрос.УстановитьПараметр("ИнструментИД", 		ИнструментИД);
	Запрос.УстановитьПараметр("ТочкаНачалаПадения", Сигнал);
	Запрос.УстановитьПараметр("КлючНастроек", 		КлючНастроек);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НС = ТаблицаОпераций.Добавить();
		ЗаполнитьЗначенияСвойств(НС, Выборка);
	КонецЦикла;
	          
КонецПроцедуры

&НаСервере
Процедура ОбновитьСтатистикуПоСтратегии()
	
	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуДетализацияСигнала(ДанныеСигнала)
			
	Если ЗначениеЗаполнено(ДанныеСигнала.ТочкаНачалаПадения) Тогда
		НС 					= ДетализацияСигнала.Добавить();
		НС.Точка 			= "ТочкаНачалаПадения"; // точка экстремума
		НС.Значение 		= биг_ОбщегоНазначенияКлиентСервер.TimestampВДату(ДанныеСигнала.ТочкаНачалаПадения);
		НС.Сигнал			= ДанныеСигнала.ТочкаНачалаПадения;
	КонецЕсли;		
				
	Если ЗначениеЗаполнено(ДанныеСигнала.ТочкаРазворота) И ДанныеСигнала.ТочкаРазворота Тогда
		НС 					= ДетализацияСигнала.Добавить();
		НС.Точка 			= "ТочкаРазворота";
		НС.Значение 		= биг_ОбщегоНазначенияКлиентСервер.TimestampВДату(ДанныеСигнала.ТочкаРазворота);
		НС.Сигнал			= ДанныеСигнала.ТочкаНачалаПадения;
	КонецЕсли;	
		
	Если ЗначениеЗаполнено(ДанныеСигнала.ТочкаВхода1) Тогда
		НС 					= ДетализацияСигнала.Добавить();
		НС.Точка 			= "ТочкаВхода1";
		НС.Значение 		= биг_ОбщегоНазначенияКлиентСервер.TimestampВДату(ДанныеСигнала.ТочкаВхода1);
		НС.Сигнал			= ДанныеСигнала.ТочкаНачалаПадения;
	КонецЕсли;	
		
	Если ЗначениеЗаполнено(ДанныеСигнала.ТочкаВхода2) Тогда
		НС 					= ДетализацияСигнала.Добавить();
		НС.Точка 			= "ТочкаВхода2";
		НС.Значение 		= биг_ОбщегоНазначенияКлиентСервер.TimestampВДату(ДанныеСигнала.ТочкаВхода2);
		НС.Сигнал			= ДанныеСигнала.ТочкаНачалаПадения;
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(ДанныеСигнала.ТочкаСигналЗавершен) Тогда
		НС 					= ДетализацияСигнала.Добавить();
		НС.Точка 			= "ТочкаСигналЗавершен";
		НС.Значение 		= биг_ОбщегоНазначенияКлиентСервер.TimestampВДату(ДанныеСигнала.ТочкаСигналЗавершен);
		НС.Сигнал			= ДанныеСигнала.ТочкаНачалаПадения;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеСигнала.ПричинаОтмены) Тогда
		НС 					= ДетализацияСигнала.Добавить();
		НС.Точка 			= "ПричинаОтмены";
		НС.Значение 		= ДанныеСигнала.ПричинаОтмены;
		НС.Сигнал			= ДанныеСигнала.ТочкаНачалаПадения;
	КонецЕсли;		
	
	НС = ДетализацияСигнала.Добавить();
	НС.Точка 	= "СигналЗавершен";
	НС.Значение = ДанныеСигнала.СигналЗавершен;
	НС.Сигнал	= ДанныеСигнала.ТочкаНачалаПадения;
	
	НС = ДетализацияСигнала.Добавить();
	НС.Точка 	= "ЗавершеноПоложительно";
	НС.Значение = ДанныеСигнала.ЗавершеноПоложительно;
	НС.Сигнал	= ДанныеСигнала.ТочкаНачалаПадения;
     		
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеПоОперациям(ДанныеСигнала)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	биг_ДаблИмпактОперации.Аккаунт КАК Аккаунт,
	|	биг_ДаблИмпактОперации.Событие КАК Событие,
	|	биг_ДаблИмпактОперации.Операция КАК Операция
	|ИЗ
	|	РегистрСведений.биг_ДаблИмпактОперации КАК биг_ДаблИмпактОперации
	|ГДЕ
	|	биг_ДаблИмпактОперации.Биржа = &Биржа
	|	И биг_ДаблИмпактОперации.ИнструментИД = &ИнструментИД
	|	И биг_ДаблИмпактОперации.ТочкаНачалаПадения = &ТочкаНачалаПадения";
	
	Запрос.УстановитьПараметр("Биржа", 				ДанныеСигнала.Биржа);
	Запрос.УстановитьПараметр("ИнструментИД", 		ДанныеСигнала.ИнструментИД);
	Запрос.УстановитьПараметр("ТочкаНачалаПадения", ДанныеСигнала.ТочкаНачалаПадения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат Выборка;	
	
КонецФункции

&НаСервере
Процедура ЗаполнитьТаблицуОпераций(ДанныеСигнала)
	
	СостояниеСтратегии.Очистить();
	
	ВыборкаПоОперациям = ПолучитьДанныеПоОперациям(ДанныеСигнала);
	
	Пока ВыборкаПоОперациям.Следующий() Цикл
		
		НС = СостояниеСтратегии.Добавить();
		ЗаполнитьЗначенияСвойств(НС, ВыборкаПоОперациям);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЭмуляцияВыполнитьТекущийШагНаСервере()
	
	биг_АлгоИмпакт.ИсполнениеСтратегииDoubleImpact(ТочкаОтсчета);
	
КонецПроцедуры

&НаКлиенте
Процедура ЭмуляцияВыполнитьТекущийШаг(Команда)
	ЭмуляцияВыполнитьТекущийШагНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВернутьЭмуляциюКТочкеЗавершение(Результат, ПараметрыОповещения) Экспорт

	Если Результат <> Неопределено Тогда
		
		ВернутьЭмуляциюКТочкеЗавершениеНаСервере(Результат);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВернутьЭмуляциюКТочкеЗавершениеНаСервере(Результат)

	ТочкаВозвратаДата = Результат;
	ТочкаВозвратаТС 	= биг_ОбщегоНазначенияКлиентСервер.ДатуВTimestampЧисло(ТочкаВозвратаДата);
	
	// TODO: процедуры перенесены в модуль биг_ДаблИмпакт
	
	//константа "момента времени" по стратегии
	//Константы.биг_ДаблИмпактTimePoint.Установить(ТочкаВозвратаТС);
	ЗаписатьТочкуНаЛинииВремени(ТочкаВозвратаТС);
	
	//удалить сигналы старше даты
	УдалитьСигналыПослеТочки(ТочкаВозвратаТС);
	
	СтеретьЗафиксированныеОперации(ТочкаВозвратаТС);
	             	
	//установить точку в форму
	ТочкаОтсчета = ТочкаВозвратаДата;
	
	//вызвать обновление формы
	ОбновитьДанныеМонитора();
	
	
КонецПроцедуры  

&НаСервере
Процедура УдалитьСигналыПослеТочки(ТочкаВозвратаТС)
	
	Набор	= РегистрыСведений.биг_ДаблИмпактСигналы.СоздатьНаборЗаписей();
	Набор.Отбор.Биржа.Установить(Биржа);
	Набор.Отбор.ИнструментИД.Установить(ИнструментИД);
	Набор.Отбор.Бар.Установить(Бар);
	Набор.Отбор.КлючНастроек.Установить(КлючНастроек);
	Набор.Прочитать();
	
	МассивУдалить = Новый Массив;
	
	Для каждого Строка Из Набор Цикл
		Если Строка.ТочкаНачалаПадения > ТочкаВозвратаТС Тогда
			МассивУдалить.Добавить(Строка);	
		КонецЕсли;
	КонецЦикла;                            
	
	Для каждого Строка Из МассивУдалить Цикл
		Набор.Удалить(Строка);
	КонецЦикла;
	
	Набор.Записать(Истина);
	
КонецПроцедуры

&НаСервере
Процедура СтеретьЗафиксированныеОперации(ТочкаВозвратаТС)
	
	Набор = РегистрыСведений.биг_ДаблИмпактОперации.СоздатьНаборЗаписей();
	Набор.Отбор.Биржа.Установить(Биржа);
	Набор.Отбор.ИнструментИД.Установить(ИнструментИД);
	Набор.Отбор.Аккаунт.Установить(Аккаунт); 
	Набор.Отбор.НастройкаСтратегии.Установить(КлючНастроек);
	
	Набор.Прочитать();
	
	МассивУдалить = Новый Массив();
	
	Для каждого Строка Из Набор Цикл
		Если Строка.ТочкаНачалаПадения > ТочкаВозвратаТС Тогда
			
			Операция = Строка.Операция;
			КлючНастройкиОперации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Операция, "НастройкаСтратегии");
			
			Если КлючНастройкиОперации = КлючНастроек Тогда
				МассивУдалить.Добавить(Строка);	
			КонецЕсли;				
		КонецЕсли;	
	КонецЦикла;                      
	
	Для каждого СтрокаНабора Из МассивУдалить Цикл
		ДокументОбъект = СтрокаНабора.Операция.ПолучитьОбъект();
		ДокументОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		
		УдалитьИсториюЗначенийДокумента(СтрокаНабора.Операция, ТочкаВозвратаТС);
		
		ДокументОбъект.Удалить();
		
		Набор.Удалить(СтрокаНабора);
	КонецЦикла;
	
	Набор.Записать(Истина);
	
КонецПроцедуры


&НаСервере
Процедура ЗаписатьТочкуНаЛинииВремени(ТочкаОтсчетаТС)
	
	Менеджер = РегистрыСведений.биг_ДаблИмпактВременныеТочки.СоздатьМенеджерЗаписи();
	Менеджер.Биржа 					= Биржа;
	Менеджер.ИнструментИД 			= ИнструментИД;
	Менеджер.Бар					= Бар;
	Менеджер.НастройкаСтратегии     = КлючНастроек;
	
	Менеджер.ТочкаНаЛинииВремени	= ТочкаОтсчетаТС;
	Менеджер.ТочкаДатой				= биг_ОбщегоНазначенияКлиентСервер.TimestampВДату(ТочкаОтсчетаТС);
	
	Менеджер.Записать(Истина);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеТеста()
	
	Менеджер = РегистрыСведений.биг_ДаблИмпактВременныеТочки.СоздатьМенеджерЗаписи();
	Менеджер.Биржа 					= Биржа;
	Менеджер.ИнструментИД 			= ИнструментИД;
	Менеджер.Бар					= Бар;
	Менеджер.НастройкаСтратегии		= КлючНастроек;
	Менеджер.Прочитать();
	
	Возврат Менеджер;	
	
КонецФункции  

// сейчас нигде не используется
&НаСервере
Функция ПолучитьТочкуОтладки()
	
	Менеджер = РегистрыСведений.биг_ДаблИмпактВременныеТочки.СоздатьМенеджерЗаписи();
	Менеджер.Биржа 					= Биржа;
	Менеджер.ИнструментИД 			= ИнструментИД;
	Менеджер.Бар					= Бар;
	Менеджер.Прочитать();
	
	Возврат Менеджер.ТочкаОтладки;
	
КонецФункции

&НаСервере
Процедура ЗагрузитьНастройкиСтратегии()

	Настройки = РегистрыСведений.биг_ЗначенияКонтрольныхУровней;

	ЗавершениеПадения_RSIMax				= Настройки.ЗначениеУровняПоИмени("ДИ_ЗавершениеПадения_RSIMax", Бар);				
	ЗавершениеПадения_МаксУрСниженияОбъема  = Настройки.ЗначениеУровняПоИмени("ДИ_ЗавершениеПадения_МаксУрСниженияОбъема", Бар);
	ЗавершениеПадения_МинУрСниженияЦены     = Настройки.ЗначениеУровняПоИмени("ДИ_ЗавершениеПадения_МинУрСниженияЦены", Бар);
	ТочкаНачалаПадения_ЦелевоеОтклонение    = Настройки.ЗначениеУровняПоИмени("ДИ_ТочкаНачалаПадения_ЦелевоеОтклонение", Бар);
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьФорматнуюСтрокуГрафика()
	
	Возврат "ДФ='HH""h"" dd.MM'";
	
КонецФункции

&НаСервереБезКонтекста
Функция НайтиКлючСтратегии(Стратегия, ИнструментИД)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	биг_ИнструментыСтратегийСрезПоследних.КлючНастройки КАК КлючНастройки
	|ИЗ
	|	РегистрСведений.биг_ИнструментыСтратегий.СрезПоследних(
	|			,
	|			Стратегия = &Стратегия
	|				И ИнструментИД = &ИнструментИД) КАК биг_ИнструментыСтратегийСрезПоследних";
	Запрос.УстановитьПараметр("Стратегия", Стратегия);
	Запрос.УстановитьПараметр("ИнструментИД", ИнструментИД);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.КлючНастройки;
	
КонецФункции

&НаКлиенте
Процедура ТекВремя(Команда)
	
	ТочкаЗавершения = ТекущаяДата();
	ТочкаНачала		= ТочкаЗавершения - 72 * 3600;
	ЗаполнитьМонитор();
	
КонецПроцедуры


#КонецОбласти //СлужебныеПроцедурыИФункции   




#Область Отладка



#КонецОбласти //Отладка
   



























  






