//@strict-types

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Параметры.Свойство("ПрерываниеРазрешено", ПрерываниеРазрешено);

	ЗаголовокДиалога = "";
	Если Параметры.Свойство("ЗаголовокДиалога", ЗаголовокДиалога) И ЗначениеЗаполнено(ЗаголовокДиалога) Тогда
		ЭтотОбъект.Заголовок = ЗаголовокДиалога;
		ЭтотОбъект.АвтоЗаголовок = Ложь;
	КонецЕсли;

	Если Не ПрерываниеРазрешено Тогда
		Элементы.ДекорацияПоясняющийТекстДлительнойОперации.Подсказка = НСтр(
			"ru = 'Операцию нельзя прервать до окончания выполнения'");
		Элементы.ДекорацияПоясняющийТекстДлительнойОперации.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)

	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;

	ОперацияПрервана = Истина;

	Отказ = Не ПрерываниеРазрешено;

КонецПроцедуры

#КонецОбласти