#Область УсловияИспользования

// Разрешается любое использование при условии сохранения содержимого области УсловияИспользования 
// Автор - https://infostart.ru/profile/211132
// Место публикации - https://infostart.ru/1c/tools/2193400 
	
#КонецОбласти

#Область ОписаниеПеременных
&НаКлиенте
Перем мСвойства; // Свойства экземпляра класса

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

&НаКлиенте
Функция Инициализировать(пИсточник, пПараметрыКонструктора = Неопределено) Экспорт
	
	мСвойства = КоллекцииСлужебныйКлиентСервер_бук.Инициализировать(пИсточник, пПараметрыКонструктора);
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Функция ШифрПараметрНеПередан() Экспорт
	
	Возврат КоллекцииСлужебныйКлиентСервер_бук.ШифрПараметрНеПередан();

КонецФункции

#КонецОбласти

#Область ПрограммныйИнтерфейс

#Область Итератор_1_0

&НаКлиенте
Процедура Сбросить() Экспорт
	
	КоллекцииСлужебныйКлиентСервер_бук.Сбросить(мСвойства);
	
КонецПроцедуры

&НаКлиенте
Функция Следующий(пШагИтератора = 1) Экспорт
	
	Результат = КоллекцииСлужебныйКлиентСервер_бук.Следующий(мСвойства);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Ключ() Экспорт
	
	Результат = КоллекцииСлужебныйКлиентСервер_бук.Ключ(мСвойства);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция Значение() Экспорт
	
	Результат = КоллекцииСлужебныйКлиентСервер_бук.Значение(мСвойства);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область Изменение_1_0

&НаКлиенте
Функция Добавить(пЗначение = "UFL_ШифрПараметрНеПередан", пКлюч = "UFL_ШифрПараметрНеПередан") Экспорт
	
	Результат = КоллекцииСлужебныйКлиентСервер_бук.Добавить(мСвойства, пЗначение, пКлюч);
	
	Возврат Результат;

КонецФункции

&НаКлиенте
Функция Вставить(пКлюч, пЗначение) Экспорт
	
	Результат = КоллекцииСлужебныйКлиентСервер_бук.Вставить(мСвойства, пЗначение, пКлюч);
	
	Возврат Результат;

КонецФункции

&НаКлиенте
Процедура Удалить(пКлюч) Экспорт
	
	КоллекцииСлужебныйКлиентСервер_бук.Удалить(мСвойства, пКлюч);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьЗначение(пЗначение, пВсеНайденные = Истина) Экспорт
	
	КоллекцииСлужебныйКлиентСервер_бук.УдалитьЗначение(мСвойства, пЗначение, пВсеНайденные);
	
КонецПроцедуры

&НаКлиенте
Процедура Очистить() Экспорт
	
	КоллекцииСлужебныйКлиентСервер_бук.Очистить(мСвойства);
	
КонецПроцедуры
	
#КонецОбласти

#Область Индексирование_1_0

&НаКлиенте
Процедура Индексировать(пПараметры = Неопределено) Экспорт
	
	КоллекцииСлужебныйКлиентСервер_бук.Индексировать(мСвойства, пПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьИндекс() Экспорт
	
	КоллекцииСлужебныйКлиентСервер_бук.УдалитьИндекс(мСвойства);
	
КонецПроцедуры

#КонецОбласти

#Область ПоискПолучениеДанных_0_85

&НаКлиенте
Функция ПолучитьЗначение(пКлюч) Экспорт
	
	Результат = КоллекцииСлужебныйКлиентСервер_бук.ПолучитьЗначение(мСвойства, пКлюч);

	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция НайтиПоЗначению(пЗначение, пПараметрыПоиска = Неопределено, пВыбратьПервые = 1) Экспорт
	
	Результат = КоллекцииСлужебныйКлиентСервер_бук.НайтиПоЗначению(мСвойства, пЗначение, пПараметрыПоиска, пВыбратьПервые);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция НайтиВсеПоЗначению(пЗначение, пПараметрыПоиска = Неопределено) Экспорт
	
	Результат = КоллекцииСлужебныйКлиентСервер_бук.НайтиВсеПоЗначению(мСвойства, пЗначение, пПараметрыПоиска);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ВыгрузитьЗначения(пОтбор = Неопределено, пТолькоУникальные = Ложь) Экспорт
	
	Результат = КоллекцииСлужебныйКлиентСервер_бук.ВыгрузитьЗначения(мСвойства, пОтбор, пТолькоУникальные);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ВыгрузитьКлючи() Экспорт
	
	Результат = КоллекцииСлужебныйКлиентСервер_бук.ВыгрузитьКлючи(мСвойства);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область КопированиеИКонвертация_0_85

&НаКлиенте
Функция Скопировать(пРекурсивно = Истина) Экспорт
	
	Результат = КоллекцииСлужебныйКлиентСервер_бук.Скопировать(мСвойства, пРекурсивно);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция СкопироватьКакЗафиксированныеДанные(пРекурсивно = Истина) Экспорт
	
	Результат = КоллекцииСлужебныйКлиентСервер_бук.СкопироватьКакЗафиксированныеДанные(мСвойства, пРекурсивно);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция СкопироватьКакДанныеБезФиксации(пРекурсивно = Истина) Экспорт
	
	Результат = КоллекцииСлужебныйКлиентСервер_бук.СкопироватьКакДанныеБезФиксации(мСвойства, пРекурсивно);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция СкопироватьВДругуюКоллекцию(пКоллекция, пПриемник)
	
	
	
КонецФункции


#КонецОбласти

#Область Свойства

&НаКлиенте
Функция Указатель() Экспорт
	
	Возврат КоллекцииСлужебныйКлиентСервер_бук.Указатель(мСвойства);
	
КонецФункции

&НаКлиенте
Функция ЭтоФиксированнаяКоллекция() Экспорт
	
	Возврат КоллекцииСлужебныйКлиентСервер_бук.ЭтоФиксированнаяКоллекция(мСвойства);
	
КонецФункции

&НаКлиенте
Функция ТипКоллекции() Экспорт
	
	Возврат КоллекцииСлужебныйКлиентСервер_бук.ТипКоллекции(мСвойства);
	
КонецФункции

&НаКлиенте
Функция Количество() Экспорт
	
	Возврат КоллекцииСлужебныйКлиентСервер_бук.Количество(мСвойства);
	
КонецФункции
	
#КонецОбласти

#КонецОбласти
 