#Область ПрограммныйИнтерфейс

#Область Общее

// Преобразование некого значения в массив
//
// Параметры:
//  
//  пЗначение  - Строка,Массив,СписокЗначений,Структура,Соответствие - Список значений в поддерживаемом формате
//                 Для строки предполагается формат строки с разделителем
//  пПоЗначению  - Булево - Признак способо получения значения 
//                 Параметр имеет смысл для структуры, соответствия и списка значений
//  пРазделитель  - Строка - Разделитель значений
//                 Параметр имеет смысл для строки с разделителем
//  пПомещатьНеобрабатываемыеВМассив  - Булево - Указание что делать с неподдерживаемыми типами
//                 Если истина, то переданный параметр будет помещен в массив и функция вернет массив с одним элементом
//  пТолькоУникальные - Булево - Если истина, то в массив попадут только уникальные значения
//
// Возвращаемое значение:
//   Массив   - Извлеченные и помещенные в массив значения
//
Функция ПреобразоватьВМассив(пЗначение, пПоЗначению = Истина, пРазделитель = ",", пПомещатьНеобрабатываемыеВМассив = Ложь, пТолькоУникальные = Ложь) Экспорт
	
	Результат = Новый Массив;
	
	ТипЗнач = ТипЗнч(пЗначение);
	Если ТипЗнач = Тип("Строка") Тогда
		Результат = СтрРазделить(пЗначение, пРазделитель, Ложь);
		ГраницаМассива = Результат.ВГраница();
		Для Сч = 0 По ГраницаМассива Цикл
			Результат[Сч] = СокрЛП(Результат[Сч]); 
		КонецЦикла;
	ИначеЕсли ТипЗнач = Тип("Структура") ИЛИ ТипЗнач = Тип("Соответствие") 
		Или ТипЗнач = Тип("ФиксированнаяСтруктура") ИЛИ ТипЗнач = Тип("ФиксированноеСоответствие")  Тогда
		Для Каждого Элем Из пЗначение Цикл
			ЗначимыйЭлемент = ?(пПоЗначению, Элем.Значение, Элем.Ключ);
			Результат.Добавить(ЗначимыйЭлемент);
		КонецЦикла;
	ИначеЕсли ТипЗнач = Тип("СписокЗначений") Тогда
		Если пПоЗначению Тогда
			Результат = пЗначение.ВыгрузитьЗначения();
		Иначе
			Для Каждого Элем Из пЗначение Цикл
				Результат.Добавить(Элем.Представление);
			КонецЦикла;
		КонецЕсли;
	ИначеЕсли ТипЗнач = Тип("ФиксированныйМассив") Тогда
		ПараметрыКонструктора = Новый Массив;
		ПараметрыКонструктора.Добавить(пЗначение);
		Результат = Новый("Массив", ПараметрыКонструктора);
	ИначеЕсли ТипЗнач = Тип("Массив") Тогда
		Результат = пЗначение;
	Иначе
		Если пПомещатьНеобрабатываемыеВМассив Тогда
			Результат.Добавить(пЗначение);
		КонецЕсли;
	КонецЕсли;
	
	Если пТолькоУникальные Тогда
		Результат = СкопироватьМассив(Результат, Истина);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Возвращает универсальную коллекцию
// Это полиморфная функция чей результат зависит от типа параметра
//
// Параметры:
//  
//  пИсточник - Строка,Тип,Массив,Структура,Соответствие,СписокЗначений,ТаблицаЗначений,ДеревоЗначений,ФиксированныйМассив,ФиксированнаяСтруктура,ФиксированноеСоответствие - описание коллекции
//                 Если передана строка, то ожидается имя универсальной коллекции
//                 В этом случае будет создана новая коллекция указанного типа
//                 В иных случаях вернётся та же самая коллекция, что передана в параметр
//  пПараметрыКонструктора - Массив,Структура,Соответствие,Неопределено - Если задано, то передаст параметры для конструктора
//                Используется для инициализации фиксированных коллекций
//
// Возвращаемое значение:
//   Массив,СписокЗначений,Структура,Соответствие,ТаблицаЗначений,ДеревоЗначений,ФиксированныйМассив,ФиксированнаяСтруктура,ФиксированноеСоответствие - универсальная коллекция
//
Функция УниверсальнаяКоллекция(пИсточник, пПараметрыКонструктора = Неопределено) Экспорт
	
	ТипИсточника = ТипЗнч(пИсточник);
	
	Если ТипИсточника = Тип("Строка") Или ТипИсточника = Тип("Тип") Тогда
		Если пПараметрыКонструктора = Неопределено Тогда
			Результат = Новый(пИсточник);
		Иначе
			Параметры = Новый Массив;
			Параметры.Добавить(пПараметрыКонструктора);
			Результат = Новый(пИсточник, Параметры);
		КонецЕсли;
	Иначе
		Результат = пИсточник;
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

// Копирование коллекцию в другую коллекцию аналогичного типа
//
// Параметры:
//  
//  пКоллекция - Массив,Структура,Соответствие,СписокЗначений,ТаблицаЗначений,ФиксированныйМассив,ФиксированнаяСтруктура,ФиксированноеСоответствие - коллекция для копирования
//  пРекурсивно - Булево - Если истина, то все коллекции содержащиеся в исходной коллекции будут так-же скопированы
//                 Иначе, наличные коллекции попадут в копию родительской коллекции как указатели на исходные
//
// Возвращаемое значение:
//   Массив,Структура,Соответствие,СписокЗначений,ТаблицаЗначений,ФиксированныйМассив,ФиксированнаяСтруктура,ФиксированноеСоответствие - копия коллекции
//
Функция Скопировать(пКоллекция, пРекурсивно = Истина) Экспорт
	
	Коллекция = ЭкземплярКлассаУниверсальнаяКоллекция(пКоллекция);
	Результат = Коллекция.Скопировать(пРекурсивно);

	Возврат Результат;
	
КонецФункции

// Формирование фиксированной копии переданной коллекции
//
// Параметры:
//  
//  пКоллекция - Массив,Структура,Соответствие - коллекция, данные которой нужно зафиксировать
//  пРекурсивно - Булево - данные коллекции по возможности будут скопированы и зафиксированы рекурсивно
//
// Возвращаемое значение:
//   ФиксированныйМассив,ФиксированнаяСтруктура,ФиксированноеСоответствие - зафиксированные данные
//
Функция Зафиксировать(пКоллекция, пРекурсивно = Истина) Экспорт 
	
	Коллекция = ЭкземплярКлассаУниверсальнаяКоллекция(пКоллекция);
	Результат = Коллекция.СкопироватьКакЗафиксированныеДанные(пРекурсивно);
	
	Возврат Результат;
	
КонецФункции

// Формирование копии фиксированной коллекции без фиксации
//
// Параметры:
//  
//  пКоллекция - ФиксированныйМассив,ФиксированнаяСтруктура,ФиксированноеСоответствие - коллекция для обработки
//  пРекурсивно - Булево - данные коллекции будут скопированы и по необходимости зафиксированы рекурсивно
//
// Возвращаемое значение:
//   Массив,Структура,Соответствие - не зафиксированные данные
//
Функция СнятьФиксацию(пКоллекция, пРекурсивно = Истина) Экспорт
	
	Коллекция = ЭкземплярКлассаУниверсальнаяКоллекция(пКоллекция);
	Результат = Коллекция.СкопироватьКакДанныеБезФиксации(пРекурсивно);
	
	Возврат Результат;
	
	
КонецФункции


#КонецОбласти

#Область Массив

// Копирование значений массив в новый экземпляр массива
//
// Параметры:
//  
//  пМассив - Массив - исходный массив, который необходимо скопировать
//  пТолькоУникальные - Булево - Если истина, то будут скопированы только уникальные значения
//                 фактически это будет группировкой массива по значению
//
// Возвращаемое значение:
//   Массив - новый массив со скопированными значениями
//
Функция СкопироватьМассив(пМассив, пТолькоУникальные = Ложь) Экспорт
	
	Результат = Новый Массив;
	ДополнитьМассив(Результат, пМассив, пТолькоУникальные);
	
	Возврат Результат;
	
КонецФункции

// Создание нового массива значения которого являются подмножеством исходного массива с исключением указанных значений 
//
// Параметры:
//  
//  пМассив - Массив - исходный массив
//  пЗначенияКУдалению  - СтрокаСРазделителями,Массив,Структура,Соответствие - Значения, которые нужно удалить
//                 Для коллекций типа Структура и Соответствие предполагается хранение имени реквизита в ключе
//
// Возвращаемое значение:
//   Массив - новый массив не содержащий указанных значений
//
Функция УдалитьЗначенияИзМассива(пМассив, пЗначенияКУдалению) Экспорт
	
	Результат = Новый Массив;
	ЗначенияКУдалению = ПреобразоватьВМассив(пЗначенияКУдалению,,, Истина);
	Для Каждого ТекЗначение Из пМассив Цикл
		Если ЗначенияКУдалению.Найти(ТекЗначение) = Неопределено Тогда
			Результат.Добавить(ТекЗначение);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Получение значений присутствующих в обоих массивах
//
// Параметры:
//  
//  пМассив1 - Массив - первый проверяемый массив
//  пМассив1 - Массив - второй проверяемый массив
//
// Возвращаемое значение:
//   Массив - значения присутствующие в обоих массивах
//
Функция СовпадающиеЗначенияМассивов(пМассив1, пМассив2) Экспорт
	
	Результат = Новый Массив;
	Для Каждого Знач1 Из пМассив1 Цикл
		Если пМассив2.Найти(Знач1) <> Неопределено Тогда
			Результат.Добавить(Знач1);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Дополнение массива значениями из другого массива
//
// Параметры:
//  
//  пПриемник  - Массив - массив который необходимо дополнить
//  пИсточник  - Массив - массив из которого производится дополнение
//  пТолькоУникальные  - Булево - Если Истина, то будут добавлены только уникальные значения
//
Процедура ДополнитьМассив(пПриемник, пИсточник, пТолькоУникальные = Ложь) Экспорт
	
	// Инициализируем список уникальных значений
	Если пТолькоУникальные Тогда
		СуществующиеЗначения = Новый Соответствие;
		Для Каждого Значение Из пПриемник Цикл
			СуществующиеЗначения[Значение] = Истина;			
		КонецЦикла;
	КонецЕсли;
	
	// Копируем массив. Если контроль уникальных, то сверяемся со списком уникальных	
	Для Каждого Значение Из пИсточник Цикл
		Если пТолькоУникальные Тогда
			Если СуществующиеЗначения[Значение] = Неопределено Тогда
				пПриемник.Добавить(Значение);
				СуществующиеЗначения[Значение] = Истина;
			Иначе
				Продолжить;
			КонецЕсли;
		Иначе // без контроля уникальности
			пПриемник.Добавить(Значение);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Удаление незаполненных значений из массива.
// Для корректного использования см. функцию "ЗначениеЗаполнено"
//
// Параметры:
//  
//  пМассив  - Массив - Массив для обработки
//
Процедура УдалитьПустыеЗначенияМассива(пМассив) Экспорт
	
	ВГраница = пМассив.ВГраница();
	Индекс = пМассив.ВГраница();
	
	Пока Индекс > 0 Цикл
		Если Не ЗначениеЗаполнено(пМассив[Индекс]) Тогда
			пМассив.Удалить(Индекс);
		КонецЕсли;
		Индекс = Индекс - 1;
	КонецЦикла;

КонецПроцедуры

// Выполняет сравнение массивов путем проверки взаимного вхождения множеств. Дубли и порядок элементов игнорируются
//
// Параметры:
//  Массив1  - Массив - первый массив для сравнения
//  Массив2  - Массив - второй массив для сравнения
//
// Возвращаемое значение:
//   Результат сравнения   - Булево. Истина если массивы равны
//
Функция МассивыРавны(пМассив1, пМассив2) Экспорт
	
	СписокПроверки = Новый Соответствие;
	СписокПроверки.Вставить(пМассив1, пМассив2);
	СписокПроверки.Вставить(пМассив2, пМассив1);
	
	Результат = Истина;
	//Прогоняем элементы каждого массива и ищем им соответствие в массиве для сравнения
	Для Каждого ЭлемСписка Из СписокПроверки Цикл
		МассивКПроверке = ЭлемСписка.Ключ;
		МассивЭталон = ЭлемСписка.Значение; 
		
		Если НЕ Результат Тогда
			Прервать;
		Иначе
			Для Каждого Элем Из МассивЭталон Цикл
				Если МассивКПроверке.Найти(Элем) = Неопределено Тогда
					Результат = Ложь;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
	
КонецФункции

// Помещение значений массива в строку с разделителем
//
// Параметры:
//  
//  пМассив  - Массив - массив для помещения в строку
//  пРазделитель  - Строка - разделитель значений в строке
//
// Возвращаемое значение:
//   Строка   - Значения массива приведенные к строке и разделенные символом разделителем
//
Функция МассивВСтрокуСРазделителями(пМассив, пРазделитель = ",") Экспорт 
	
	Результат = "";
	
	ПервыйПроход = Истина;
	Для Каждого Значение из пМассив Цикл
		Результат = Результат + ?(ПервыйПроход, "", пРазделитель) + Значение;
		ПервыйПроход = Ложь;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Помещение массива в переданную коллекцию
//
// Параметры:
//  
//  пМассив  - Массив - исходный массив
//  пПриемник  - Массив,СписокЗначений - коллекция-приёмник.
//
// Возвращаемое значение:
//   Массив,СписокЗначений   - Результат помещения массива в указанную коллекцию
//
Функция МассивВКоллекцию(пМассив, пПриемник) Экспорт
	
	ТипКоллекции = ТипЗнч(пПриемник);
	
	Если ТипКоллекции = Тип("Массив") Тогда
		Результат = пМассив;
	ИначеЕсли ТипКоллекции = Тип("СписокЗначений") Тогда
		Результат = пПриемник;
		Результат.ЗагрузитьЗначения(пМассив);
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

// Сортировка массива объектов по значению реквизита
// Не рекомендуется использовать для сортировки ссылочных объектов
//
// Параметры:
//  
//  пМассив  - Массив - массив объектов. Все объекты должны иметь реквизит указанный в параметре пИмяРек
//  пИмяРек  - Строка - имя реквизита по которому будет производиться сравнение
//  пНаправление  - Строка - Направление сортировки. Может принимать значения "Возр" или "Убыв"
//
Процедура СортироватьОбъекты(пМассив, пИмяРек, пНаправление = "ВОЗР") Экспорт
	
	МассивУпорядочен = Ложь;
	МаксИндекс = пМассив.ВГраница()- 1;
	МножительНаправления = ?(НРЕГ(пНаправление = "ВОЗР"), Истина, Ложь);
	
	Пока Не МассивУпорядочен Цикл
		БылиПерестановки = Ложь;
		Для Сч = 0 По МаксИндекс Цикл
			Знач1 = пМассив[Сч][пИмяРек];
			Знач2 = пМассив[Сч+1][пИмяРек];
			СделатьПерестановку = Знач1 > Знач2 И Знач1 <> Знач2;
			СделатьПерестановку = СделатьПерестановку И МножительНаправления;	
			Если СделатьПерестановку Тогда
				врЗнач = пМассив[Сч];
				пМассив[Сч] = пМассив[Сч+1];
				пМассив[Сч+1] = врЗнач;
			КонецЕсли;
			БылиПерестановки = Макс(БылиПерестановки, СделатьПерестановку);
		КонецЦикла;
		МассивУпорядочен = Не БылиПерестановки;
	КонецЦикла;
	
КонецПроцедуры

// Сортировка массива по значению
//
// Параметры:
//  
//  пМассив  - Массив - массив значений. Поддерживаются только значения поддерживающие операции сравнения больше/меньше
//  пНаправление  - Строка - Направление сортировки. Может принимать значения "Возр" или "Убыв"
//
Процедура СортироватьМассив(пМассив, пНаправление = "ВОЗР") Экспорт
	
	МассивУпорядочен = Ложь;
	МаксИндекс = пМассив.ВГраница()- 1;
	МножительНаправления = ?(НРЕГ(пНаправление = "ВОЗР"), Истина, Ложь);
	
	Пока Не МассивУпорядочен Цикл
		БылиПерестановки = Ложь;
		Для Сч = 0 По МаксИндекс Цикл
			Знач1 = пМассив[Сч];
			Знач2 = пМассив[Сч+1];
			СделатьПерестановку = Знач1 > Знач2 И Знач1 <> Знач2;
			СделатьПерестановку = СделатьПерестановку И МножительНаправления;	
			Если СделатьПерестановку Тогда
				врЗнач = пМассив[Сч];
				пМассив[Сч] = пМассив[Сч+1];
				пМассив[Сч+1] = врЗнач;
			КонецЕсли;
			БылиПерестановки = Макс(БылиПерестановки, СделатьПерестановку);
		КонецЦикла;
		МассивУпорядочен = Не БылиПерестановки;
	КонецЦикла;
	
КонецПроцедуры

// Получение наибольшего элемента массива
// Сравнение элементов производится обычным оператором сравнения, поэтому поддерживаются не только числовые значения
// Если массив пустой, то вернётся Неопределено
//
// Параметры:
//
//  пМассив - Массив - массив, максимальное значение элемента которого надо вычислить
//
// Возвращаемое значение:
//   Произвольный - максимальное значение элемента
//
Функция МаксЭлементМассива(пМассив) Экспорт
	
	Если пМассив.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = пМассив[0];
	МаксИндекс = пМассив.ВГраница();
	Для Сч = 1 По МаксИндекс Цикл
		ТекЗначение = пМассив[Сч];
		Если ТекЗначение > Результат Тогда
			Результат = ТекЗначение;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Получение наименьшего элемента массива
// Сравнение элементов производится обычным оператором сравнения, поэтому поддерживаются не только числовые значения
// Если массив пустой, то вернётся Неопределено
//
// Параметры:
//
//  пМассив - Массив - массив, минимальное значение элемента которого надо вычислить
//
// Возвращаемое значение:
//   Произвольный - минимальное значение элемента
//
Функция МинЭлементМассива(пМассив) Экспорт
	
	Если пМассив.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = пМассив[0];
	МаксИндекс = пМассив.ВГраница();
	Для Сч = 1 По МаксИндекс Цикл
		ТекЗначение = пМассив[Сч];
		Если ТекЗначение < Результат Тогда
			Результат = ТекЗначение;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область Структура

// Формирование текстового представления значений реквизитов структуры/соответствия
// 
//
// Параметры:
//  
//  пСтруктура - Структура,Соответствие,ФиксированнаяСтруктура,ФиксированноеСоответствие - структура, которую необходимо обработать
//  пРазделитель - Строка - Строка, которая будет разделителем пар ключ/значение
//  пРазделительПары - Строка - Строка, которая будет разделителем ключа и значения
//
// Возвращаемое значение:
//   Строка - Представления ключей и значения
//
Функция ПредставлениеСтруктуры(пСтруктура, пРазделитель = Неопределено, пРазделительПары = ": ") Экспорт
	
	РазделительЭлементов = ?(пРазделитель = Неопределено, Символы.ПС, пРазделитель);
	
	ЧастиСтроки = Новый Массив;
	Для Каждого Элем Из пСтруктура Цикл
		ЧастиСтроки.Добавить(Элем.Ключ);
		ЧастиСтроки.Добавить(пРазделительПары);
		ЧастиСтроки.Добавить(Элем.Значение);
		ЧастиСтроки.Добавить(РазделительЭлементов);
	КонецЦикла;
	
	МаксИндекс = ЧастиСтроки.ВГраница();
	ЧастиСтроки.Удалить(МаксИндекс); //удаляем закрывающий разделитель элементов
	
	Результат = МассивВСтрокуСРазделителями(ЧастиСтроки, "");
	
	Возврат Результат;

КонецФункции

// Создание/Дополнение структуры или соответствия по массиву
// Это полиморфная функция чей результат зависит от типа параметра
//
// Параметры:
//  
//  пМассив - Строка,Массив,СписокЗначений,Структура,Соответствие - Ключи структуры
//                 Для коллекций типа Структура и Соответствие предполагается хранение имени реквизита в ключе
//  пЗначениеПоУмолчанию - Произвольный - Значение которое будет вставлено во все новые пары Ключ/Значение
//  пКонтейнер - Строка,Тип,Структура,Соответствие - описание универсальной коллекции
//                 Если передана строка, то предполагается, что это имя универсальной коллекции "Структура"
//                 или "Соответствие", а в результате будет создан и заполнен новый объект указанного типа
//                 Если передан тип, то будет создана новая коллекция указанного типа 
//                 В остальных случаях функция вернёт переданный объект после дозаполнения 
//
// Возвращаемое значение:
//   Структура,Соответствие - Универсальная структура, новая или переданная
//
Функция СтруктураПоМассиву(пМассив, пЗначениеПоУмолчанию = Неопределено, пКонтейнер = "Структура") Экспорт
	
	Результат = УниверсальнаяКоллекция(пКонтейнер);
	КлючиСтруктуры = ПреобразоватьВМассив(пМассив, Ложь);
	
	Для Каждого ИмяКлюча Из КлючиСтруктуры Цикл
		Результат.Вставить(ИмяКлюча, пЗначениеПоУмолчанию);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область КлассУниверсальнаяКоллекция

Функция ЭкземплярКлассаУниверсальнаяКоллекция(пОбъект) Экспорт
	
	Результат = КоллекцииСлужебныйКлиентСервер_бук.ЭкземплярКлассаУниверсальнаяКоллекция(пОбъект);
	
	Возврат Результат;
	
КонецФункции

Функция ЭкземплярКлассаТаблицаЗначений(пОбъект) Экспорт
	
	Результат = КоллекцииСлужебныйКлиентСервер_бук.ЭкземплярКлассаТаблицаЗначений(пОбъект);
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоЭкземплярКлассаУниверсальнаяКоллекция(пОбъект) Экспорт
	
	Результат = КоллекцииСлужебныйКлиентСервер_бук.ЭтоЭкземплярКлассаУниверсальнаяКоллекция(пОбъект);
	
	Возврат Результат;

КонецФункции

Функция ЭтоЭкземплярКлассаТаблицаЗначений(пОбъект) Экспорт
	
	Результат = КоллекцииСлужебныйКлиентСервер_бук.ЭтоЭкземплярКлассаТаблицаЗначений(пОбъект);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти