///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2019, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////
// strict-types

#Область СлужебныйПрограммныйИнтерфейс

// Подписки БСП
// 
// Возвращаемое значение: 
//  Структура:
// * ПередВыгрузкойДанных - Булево
// * ПередЗагрузкойДанных - Булево
// * ПослеВыгрузкиДанных - Булево
// * ПослеЗагрузкиДанных - Булево
// * ПослеЗагрузкиПользователейИнформационнойБазы - Булево
// * ПослеЗагрузкиПользователяИнформационнойБазы - Булево
// * ПриДобавленииОбработчиковОбновленияБТС - Булево
// * ПриЗагрузкеПользователяИнформационнойБазы - Булево
// * ПриЗаполненииТаблицыПараметровИБ - Булево
// * ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки - Булево
// * ПриЗаполненииТиповОбщихДанныхНеТребующихСопоставлениеСсылокПриЗагрузке - Булево
// * ПриЗаполненииТиповОбщихДанныхПоддерживающихСопоставлениеСсылокПриЗагрузке - Булево
// * ПриЗаполненииТиповТребующихАннотациюСсылокПриВыгрузке - Булево
// * ПриОпределенииВерсииИнтерфейсаКорреспондента - Булево
// * ПриОпределенииИсключенийНеразделенныхДанных - Булево
// * ПриОпределенииИспользованияРегламентныхЗаданий - Булево
// * ПриОпределенииОбработчиковКаналовСообщений - Булево
// * ПриОпределенииОбработчиковОшибок - Булево
// * ПриОпределенииОбработчиковПоставляемыхДанных - Булево
// * ПриОпределенииПсевдонимаПользователя - Булево
// * ПриОпределенииПсевдонимовОбработчиков - Булево
// * ПриПолученииСпискаШаблонов - Булево
// * ПриРегистрацииОбработчиковВыгрузкиДанных - Булево
// * ПриРегистрацииОбработчиковЗагрузкиДанных - Булево
// * ПриУстановкеЗначенийПараметровИБ - Булево
// * ПриФормированииСпискаУслуг - Булево
// * РегистрацияИнтерфейсовОтправляемыхСообщений - Булево
// * РегистрацияИнтерфейсовПринимаемыхСообщений - Булево
// (См. ИнтеграцияПодсистемБТС.СобытияБТС)
Функция ПодпискиБСП() Экспорт
	
	Подписки = ИнтеграцияПодсистемБТС.СобытияБТС();
	ИнтеграцияПодсистемБСП.ПриОпределенииПодписокНаСобытияБТС(Подписки);
	
	Возврат Подписки;
	
КонецФункции

// Подписки БИП
// 
// Возвращаемое значение:
//  Структура:
// * ПередВыгрузкойДанных - Булево
// * ПередЗагрузкойДанных - Булево
// * ПослеВыгрузкиДанных - Булево
// * ПослеЗагрузкиДанных - Булево
// * ПослеЗагрузкиПользователейИнформационнойБазы - Булево
// * ПослеЗагрузкиПользователяИнформационнойБазы - Булево
// * ПриДобавленииОбработчиковОбновленияБТС - Булево
// * ПриЗагрузкеПользователяИнформационнойБазы - Булево
// * ПриЗаполненииТаблицыПараметровИБ - Булево
// * ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки - Булево
// * ПриЗаполненииТиповОбщихДанныхНеТребующихСопоставлениеСсылокПриЗагрузке - Булево
// * ПриЗаполненииТиповОбщихДанныхПоддерживающихСопоставлениеСсылокПриЗагрузке - Булево
// * ПриЗаполненииТиповТребующихАннотациюСсылокПриВыгрузке - Булево
// * ПриОпределенииВерсииИнтерфейсаКорреспондента - Булево
// * ПриОпределенииИсключенийНеразделенныхДанных - Булево
// * ПриОпределенииИспользованияРегламентныхЗаданий - Булево
// * ПриОпределенииОбработчиковКаналовСообщений - Булево
// * ПриОпределенииОбработчиковОшибок - Булево
// * ПриОпределенииОбработчиковПоставляемыхДанных - Булево
// * ПриОпределенииПсевдонимаПользователя - Булево
// * ПриОпределенииПсевдонимовОбработчиков - Булево
// * ПриПолученииСпискаШаблонов - Булево
// * ПриРегистрацииОбработчиковВыгрузкиДанных - Булево
// * ПриРегистрацииОбработчиковЗагрузкиДанных - Булево
// * ПриУстановкеЗначенийПараметровИБ - Булево
// * ПриФормированииСпискаУслуг - Булево
// * РегистрацияИнтерфейсовОтправляемыхСообщений - Булево
// * РегистрацияИнтерфейсовПринимаемыхСообщений - Булево
// (См. ИнтеграцияПодсистемБТС.СобытияБТС)
Функция ПодпискиБИП() Экспорт
	
	Подписки = ИнтеграцияПодсистемБТС.СобытияБТС();
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтернетПоддержкаПользователей") Тогда
		МодульИнтеграцияПодсистемБИП = ОбщегоНазначения.ОбщийМодуль("ИнтеграцияПодсистемБИП");
		МодульИнтеграцияПодсистемБИП.ПриОпределенииПодписокНаСобытияБТС(Подписки);
	КонецЕсли;
	
	Возврат Подписки;
	
КонецФункции

#КонецОбласти