#Область ПрограммныйИнтерфейс

// Открывает форму форму оплаты сервиса.
// Метод переопределяется в расширении fresh.
// @skip-warning - обратная совместимость.
// @skip-check module-empty-method 
//
Процедура ОткрытьФормуОплатыСервиса() Экспорт
КонецПроцедуры

// Открывает форму выбора тарифа сервиса.
// Метод переопределяется в расширении fresh.
// @skip-warning - обратная совместимость.
// @skip-check module-empty-method 
//
// Параметры:
//  КодОбслуживающейОрганизации	 - Число - код обслуживающей организации 
//  Источник -ФормаКлиентскогоПриложения - источник открытия формы
//  ОповещениеОЗакрытии - ОписаниеОповещения - оповещение о закрытии формы выбора тарифа.
//
Процедура ОткрытьФормуВыбораТарифа(КодОбслуживающейОрганизации, Источник = Неопределено, ОповещениеОЗакрытии = Неопределено) Экспорт
КонецПроцедуры
 
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Метод переопределяется в расширении fresh.
// @skip-warning - обратная совместимость.
// @skip-check module-empty-method
// 
// Параметры:
// 	Параметры - см. ОбщегоНазначенияКлиентПереопределяемый.ПриНачалеРаботыСистемы.Параметры
//
Процедура ПриНачалеРаботыСистемы(Параметры) Экспорт
КонецПроцедуры

#КонецОбласти 
