
#Область ПрограммныйИнтерфейс

// Возвращает данные объекта из Менеджера сервиса по правилу трансляции.
// @skip-warning ПустойМетод - особенность реализации.
// 
// Параметры: 
//  ИдентификаторПравила - Строка - идентификатор правила трансляции с типом "Чтение".
//  КлючОбъекта - Строка, Число - ключ объекта, определенный в правиле.
// 
// Возвращаемое значение: 
//  Структура -- данные объекта или Неопределено, если данные не получены:
// * Поле - Произвольный - произвольный состав полей.
Функция ПолучитьДанныеОбъектаПоПравилу(ИдентификаторПравила, КлючОбъекта) Экспорт
КонецФункции 

// Отправляет данные в Менеджер сервиса.
// @skip-warning ПустойМетод - особенность реализации.
//
// Параметры:
//  ИдентификаторПравила - Строка - идентификатор правила трансляции с типом "Загрузка". 
//  Данные - Структура - данные для отправки в менеджер сервиса:
//   * Поле - Произвольный - произвольный состав полей, определенный у универсальном объекте.
// 
// Возвращаемое значение:
//  Структура - результат выполнения запроса:
//  * КодСостояния - Число - код состояния ответа.
//  * ТелоОтвета - Строка - тело ответа в виде строки.
//  * ДанныеОтвета - Неопределено, Структура - данные объекта или Неопределено, если данные не получены:
//    ** Поле - Произвольный - произвольный состав полей, если ответ содержит заголовок
//    						   "Content-Type: application/json" возвращается Структура.
Функция ОтправитьДанныеОбъектаПоПравилу(ИдентификаторПравила, Данные = Неопределено) Экспорт
КонецФункции

// Изменяет объект в Менеджере сервиса по правилу трансляции.
// @skip-warning ПустойМетод - особенность реализации.
//
// Параметры:
//  ИдентификаторПравила - Строка - идентификатор правила трансляции с типом "Загрузка". 
//  КлючОбъекта - Строка, Число - ключ объекта, определенный в правиле.
//  Данные - Структура - данные для отправки в менеджер сервиса. 
//   * Поле - Произвольный - произвольный состав полей, определенный у универсальном объекте.
// 
// Возвращаемое значение:
//  Структура - данные ответа:
//  * КодСостояния - Число - код состояния ответа.
//  * ТелоОтвета - Строка - тело ответа.
//  * ДанныеОтвета - Неопределено, Структура - данные объекта или Неопределено, если данные не получены:
//    ** Поле - Произвольный - произвольный состав полей, если ответ содержит заголовок
//    						   "Content-Type: application/json" возвращается Структура.
Функция ИзменитьДанныеОбъектаПоПравилу(ИдентификаторПравила, КлючОбъекта, Данные = Неопределено) Экспорт
КонецФункции

// Метод позволяет подписаться на оповещения об изменении объектов в менеджере сервиса по правилам тарансляции.
// @skip-warning ПустойМетод - особенность реализации.
//
// Параметры:
//  ИдентификаторПравила - Строка - идентификатор правила трансляции. 
//  КлючОбъекта - Строка - ключ объекта интеграции на обновления которого подписываемся.
//
Процедура ПодписатьсяНаОповещенияОбИзменении(ИдентификаторПравила, КлючОбъекта) Экспорт
КонецПроцедуры

// Метод позволяет отписаться от оповещений об изменении объектов в менеджере сервиса по правилам трансляции.
// @skip-warning ПустойМетод - особенность реализации.
//
// Параметры:
//  ИдентификаторПравила - Строка - идентификатор правила трансляции
//  КлючОбъекта - Строка - ключ объекта, по которому отписываемся от оповещений об обновлениях.
//
Процедура ОтписатьсяОтОповещенийНаИзменения(ИдентификаторПравила, КлючОбъекта) Экспорт
КонецПроцедуры

// Функция позволяет прочитать полученные данные объекта по ключу полученных данных.
// @skip-warning ПустойМетод - особенность реализации.
//
// Параметры:
//  ИдентификаторПравила - Строка - идентификатор правила трансляции.
//  КлючОбъекта - Строка - ключ объекта.
// 
// Возвращаемое значение:
//   Структура - прочитанные полученные данные объекта:
//   * Поле - Произвольный - произвольный состав полей, определенный у универсальном объекте.
//
Функция ПрочитатьПолученныеДанныеОбъекта(ИдентификаторПравила, КлючОбъекта) Экспорт
КонецФункции

// Метод позволяет подписаться на оповещения об изменении объектов в менеджере сервиса.
// @skip-warning ПустойМетод - особенность реализации.
//
// Параметры:
//  ТипОбъекта - Строка 
//  ИдентификаторОбъекта - УникальныйИдентификатор
Процедура ПодписатьсяНаОповещениеОбИзмененииОбъекта(ТипОбъекта, ИдентификаторОбъекта) Экспорт
КонецПроцедуры

// Метод позволяет отписаться от оповещений об изменении объектов в менеджере сервиса по правилам трансляции.
// @skip-warning ПустойМетод - особенность реализации.
//
// Параметры:
//  ТипОбъекта - Строка
//  ИдентификаторОбъекта - УникальныйИдентификатор
Процедура ОтписатьсяОтОповещенияОбИзмененииОбъекта(ТипОбъекта, ИдентификаторОбъекта) Экспорт
КонецПроцедуры            

// Функция позволяет проверить признак изменения объекта по типу и идентификатору объекта.
// @skip-warning ПустойМетод - особенность реализации.
//
// Параметры:
//  ТипОбъекта - Строка
//  ИдентификаторОбъекта - УникальныйИдентификатор
//
// Возвращаемое значение:
//  Булево - признак изменения объекта после последней подписки на изменение.
Функция ПолученоОповещениеОбИзмененииОбъекта(ТипОбъекта, ИдентификаторОбъекта) Экспорт
КонецФункции
 
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Процедура позволяет записать или заранее инициализировать полученные данные объекта
// по ключу полученных данных.
// @skip-warning ПустойМетод - особенность реализации.
//
// Параметры:
//  ИдентификаторПравила - Строка -идентификатор правила трансляции
//  КлючОбъекта - Строка - ключ объекта.
//  Данные - Структура - сохраняемые полученные данные объекта.
//
Процедура ЗаписатьПолученныеДанныеОбъекта(ИдентификаторПравила, КлючОбъекта, Данные) Экспорт
КонецПроцедуры

#КонецОбласти 
