#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем ТекущийКонтейнер;
Перем ТекущиеЗагружаемыеТипы;
Перем ТекущиеИсключаемыеТипы;
Перем ТекущиеОбработчики;
Перем ТекущийПотокЗаменыСсылок; // ОбработкаОбъект.ВыгрузкаЗагрузкаДанныхПотокЗаменыСсылок
Перем ОбработанныеДублиПредопределенных;
Перем ИндексПервогоЗагружаемого;
Перем ФиксироватьОбработкуОбъектов;

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура Инициализировать(Контейнер, ЗагружаемыеТипы, ИсключаемыеТипы, Обработчики, ПолноеИмяПервогоЗагружаемогоОбъектаМетаданных = Неопределено, СоответствиеСсылок = Неопределено) Экспорт
	
	ТекущийКонтейнер = Контейнер;
	ФиксироватьОбработкуОбъектов = Контейнер.ФиксироватьСостояние();
	 
	ТекущиеЗагружаемыеТипы = ЗагружаемыеТипы;
	ТекущиеЗагружаемыеТипы = СортироватьЗагружаемыеТипы(ТекущиеЗагружаемыеТипы);
	ТекущиеИсключаемыеТипы = ИсключаемыеТипы;
	ТекущиеОбработчики = Обработчики;
	ТекущийПотокЗаменыСсылок = Обработки.ВыгрузкаЗагрузкаДанныхПотокЗаменыСсылок.Создать();
	ТекущийПотокЗаменыСсылок.Инициализировать(ТекущийКонтейнер, ТекущиеОбработчики, СоответствиеСсылок);	
	ОбработанныеДублиПредопределенных = Новый Соответствие();
	
	Если ПолноеИмяПервогоЗагружаемогоОбъектаМетаданных = Неопределено Тогда
		ИндексПервогоЗагружаемого = 0;
	Иначе
		ПервыйЗагружаемыйОбъектМетаданных = Метаданные.НайтиПоПолномуИмени(
			ПолноеИмяПервогоЗагружаемогоОбъектаМетаданных);
		ИндексПервогоЗагружаемого = ТекущиеЗагружаемыеТипы.Найти(ПервыйЗагружаемыйОбъектМетаданных);
	КонецЕсли;
	 	 			
КонецПроцедуры

Процедура ЗагрузитьДанные() Экспорт
	
	ВыполнитьЗаменуСсылок();
	ВыполнитьЗагрузкуДанных();
	
КонецПроцедуры

// Возвращаемое значение: 
//  ОбработкаОбъект.ВыгрузкаЗагрузкаДанныхПотокЗаменыСсылок - текущий поток замены ссылок.
Функция ТекущийПотокЗаменыСсылок() Экспорт
	
	Возврат ТекущийПотокЗаменыСсылок;
	
КонецФункции

//@skip-warning ПустойМетод - особенность реализации.
//
Процедура Закрыть() Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Типы сортируются по убыванию приоритета, сериализаторы выбирают их из массива с конца.
//
// Параметры:
//	ЗагружаемыеТипы - Массив из ОбъектМетаданных - массив метаданных.
//
// Возвращаемое значение:
//	Массив - отсортированный массив метаданных по приоритету.
//
Функция СортироватьЗагружаемыеТипы(Знач ЗагружаемыеТипы)
	
	Сортировка = Новый ТаблицаЗначений();
	Сортировка.Колонки.Добавить("ОбъектМетаданных");
	Сортировка.Колонки.Добавить("Приоритет", Новый ОписаниеТипов("Число"));
	Сортировка.Колонки.Добавить("Имя", Новый ОписаниеТипов("Строка"));
	
	Для каждого ОбъектМетаданных Из ЗагружаемыеТипы Цикл
		
		Строка = Сортировка.Добавить();
		Строка.ОбъектМетаданных = ОбъектМетаданных;
		Строка.Имя = ОбъектМетаданных.Имя;
		
		Если ОбщегоНазначенияБТС.ЭтоКонстанта(ОбъектМетаданных) Тогда
			
			Строка.Приоритет = 0;
			
		ИначеЕсли ОбщегоНазначенияБТС.ЭтоСсылочныеДанные(ОбъектМетаданных) Тогда
			
			Если ОбщегоНазначенияБТС.ЭтоПланВидовХарактеристик(ОбъектМетаданных) Тогда
				
				Строка.Приоритет = 1;
				
			ИначеЕсли ОбщегоНазначенияБТС.ЭтоПланСчетов(ОбъектМетаданных) Тогда
				
				Строка.Приоритет = 2;
				
			ИначеЕсли ОбщегоНазначенияБТС.ЭтоПланВидовРасчета(ОбъектМетаданных) Тогда
				
				Строка.Приоритет = 3;
				
			ИначеЕсли ОбщегоНазначенияБТС.ЭтоСправочник(ОбъектМетаданных) Тогда
				
				Строка.Приоритет = 4;
				
			Иначе
				
				Строка.Приоритет = 5;
				
			КонецЕсли;
				
		ИначеЕсли ОбщегоНазначенияБТС.ЭтоНаборЗаписей(ОбъектМетаданных) Тогда
			
			Строка.Приоритет = 6;
			
		ИначеЕсли Метаданные.РегистрыРасчета.Содержит(ОбъектМетаданных.Родитель()) Тогда // Перерасчеты
			
			Строка.Приоритет = 7;
			
		ИначеЕсли Метаданные.Последовательности.Содержит(ОбъектМетаданных) Тогда
			
			Строка.Приоритет = 8;
			
		Иначе
			
			ШаблонТекста = НСтр("ru = 'Выгрузка объекта метаданных не поддерживается %1'");
			ТекстСообщения = СтрШаблон(ШаблонТекста, ОбъектМетаданных.ПолноеИмя());
			ВызватьИсключение(ТекстСообщения);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Сортировка.Сортировать("Приоритет, Имя");
	
	Возврат Сортировка.ВыгрузитьКолонку("ОбъектМетаданных");
	
КонецФункции

Процедура ВыполнитьЗаменуСсылок()
	
	МенеджерПересозданияСсылок = Обработки.ВыгрузкаЗагрузкаДанныхМенеджерПересозданияСсылок.Создать();
	МенеджерПересозданияСсылок.Инициализировать(ТекущийКонтейнер, ТекущийПотокЗаменыСсылок);
	МенеджерПересозданияСсылок.ВыполнитьПересозданиеСсылок();
	
	МенеджерСопоставленияСсылок = Обработки.ВыгрузкаЗагрузкаДанныхМенеджерСопоставленияСсылок.Создать();
	МенеджерСопоставленияСсылок.Инициализировать(ТекущийКонтейнер, ТекущийПотокЗаменыСсылок, ТекущиеОбработчики);
	МенеджерСопоставленияСсылок.ВыполнитьСопоставлениеСсылок();
	
	ВыгрузкаЗагрузкаДанныхСлужебный.ЗафиксироватьСоответствиеСсылок(ТекущийПотокЗаменыСсылок.СоответствиеСсылок());
	
КонецПроцедуры

Процедура ВыполнитьЗагрузкуДанных()
	
	Для ИндексЗагружаемого = ИндексПервогоЗагружаемого По ТекущиеЗагружаемыеТипы.ВГраница() Цикл
	
		ОбъектМетаданных = ТекущиеЗагружаемыеТипы[ИндексЗагружаемого];
		
		Если ТекущиеИсключаемыеТипы.Найти(ОбъектМетаданных) = Неопределено Тогда
			
			ВыгрузкаЗагрузкаДанныхСлужебный.ЗафиксироватьНачалоЗагрузкиОбъектаМетаданных(ОбъектМетаданных);	
			
			Если ФиксироватьОбработкуОбъектов Тогда
				ТекущийКонтейнер.ЗафиксироватьНачалоОбработкиОбъектаМетаданных(ОбъектМетаданных);
			КонецЕсли;
			
			Отказ = Ложь;
			ТекущиеОбработчики.ПередЗагрузкойТипа(ТекущийКонтейнер, ОбъектМетаданных, Отказ);
			
			Если Отказ Тогда
				Если ФиксироватьОбработкуОбъектов Тогда
					ТекущийКонтейнер.ОбъектыОбработаны(
						ТекущийКонтейнер.ОбъектовКОбработкеПоОбъектуМетаданных(ОбъектМетаданных));
				КонецЕсли; 
			Иначе
				ЗагрузитьДанныеОбъектаИнформационнойБазы(ОбъектМетаданных);		
			КонецЕсли;
			
			ТекущиеОбработчики.ПослеЗагрузкиТипа(ТекущийКонтейнер, ОбъектМетаданных);
									
		Иначе
							
			ЗаписьЖурналаРегистрации(
				НСтр("ru = 'Выгрузка загрузка данных. Загрузка объекта пропущена'", ОбщегоНазначения.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Информация,
				ОбъектМетаданных,
				,
				СтрШаблон(НСтр("ru = 'Загрузка данных объекта метаданных %1 пропущена, т.к. он включен в
                          |список объектов метаданных, исключаемых из выгрузки и загрузки данных'", ОбщегоНазначения.КодОсновногоЯзыка()),
					ОбъектМетаданных.ПолноеИмя()));
			
		КонецЕсли;
		
	КонецЦикла;
	
	ВыгрузкаЗагрузкаДанныхСлужебный.ЗафиксироватьЗавершениеЗагрузкиОбъектовМетаданных();	
	
	Если ФиксироватьОбработкуОбъектов Тогда
		ТекущийКонтейнер.ЗафиксироватьЗавершениеОбработкиОбъектовМетаданных();
	КонецЕсли;
			
КонецПроцедуры

// Загружает все необходимые данные для объекта информационной базы.
//
// Параметры:
//	ОбъектМетаданных - ОбъектМетаданных - загружаемый объект метаданных.
//
Процедура ЗагрузитьДанныеОбъектаИнформационнойБазы(Знач ОбъектМетаданных)
	
	ЗаписьЖурналаРегистрации(
		НСтр("ru = 'Выгрузка загрузка данных. Загрузка объекта метаданных'", ОбщегоНазначения.КодОсновногоЯзыка()),
		УровеньЖурналаРегистрации.Информация,
		ОбъектМетаданных,
		,
		СтрШаблон(НСтр("ru = 'Начало загрузки данных объекта метаданных: %1'", ОбщегоНазначения.КодОсновногоЯзыка()),
			ОбъектМетаданных.ПолноеИмя()));
	
	КоличествоОбъектов = 0;
	ОтложенныеНаборы = Новый Соответствие;
	ПараметрыДляЗаписиИзменений = Неопределено;

	Если ОбщегоНазначения.ЭтоПланОбмена(ОбъектМетаданных) Тогда

		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Выгрузка загрузка данных. Загрузка объекта метаданных'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Информация,
			ОбъектМетаданных,
			,
			СтрШаблон(НСтр("ru = 'Очистка данных объекта метаданных: %1'", ОбщегоНазначения.КодОсновногоЯзыка()),
				ОбъектМетаданных.ПолноеИмя()));
		
		РаботаВМоделиСервиса.ОчиститьДанныеОбъектаМетаданных(ОбъектМетаданных.ПолноеИмя(), ОбъектМетаданных);
		
	КонецЕсли;
		
	Для Каждого ОписаниеФайла Из ТекущийКонтейнер.ПолучитьОписанияФайловИзКаталога(ВыгрузкаЗагрузкаДанныхСлужебный.InfobaseData(), ОбъектМетаданных.ПолноеИмя()) Цикл
		
		ТекущийКонтейнер.РаспаковатьФайл(ОписаниеФайла);
		
		ТекущийПотокЗаменыСсылок.ВыполнитьЗаменуСсылокВФайле(ОписаниеФайла);
		
		ПотокЧтения = Обработки.ВыгрузкаЗагрузкаДанныхПотокЧтенияДанныхИнформационнойБазы.Создать();
		ПотокЧтения.ОткрытьФайл(ОписаниеФайла.ПолноеИмя);
				
		Пока ПотокЧтения.ПрочитатьОбъектДанныхИнформационнойБазы() Цикл
			
			Объект = ПотокЧтения.ТекущийОбъект();
			Артефакты = ПотокЧтения.АртефактыТекущегоОбъекта();
			
			Если ПотокЧтения.ТипТекущегоОбъекта() = ВыгрузкаЗагрузкаДанныхСлужебный.InfobaseData() Тогда
			
				ЗаписатьОбъектВИнформационнуюБазу(Объект, Артефакты, ОтложенныеНаборы, ОбъектМетаданных);
				
			ИначеЕсли ПотокЧтения.ТипТекущегоОбъекта() = ВыгрузкаЗагрузкаДанныхСлужебный.InfobaseDataChanges() Тогда
				
				Если ПараметрыДляЗаписиИзменений = Неопределено Тогда
					
					ПараметрыДляЗаписиИзменений = ПараметрыДляЗаписиИзменений(ОбъектМетаданных);
					
				КонецЕсли;
				
				Если ПараметрыДляЗаписиИзменений.ЭтоКонстанта Тогда
					
					ЗаписатьИзменениеКонстанты(ОбъектМетаданных, Объект, Артефакты);
					
				ИначеЕсли ПараметрыДляЗаписиИзменений.ЭтоСсылочныеДанные Тогда
					
					ЗаписатьИзменениеСсылки(ОбъектМетаданных, Объект, Артефакты);
					
				ИначеЕсли ПараметрыДляЗаписиИзменений.ЭтоНаборЗаписей Тогда
					
					ЗаписатьИзменениеНабораЗаписей(ОбъектМетаданных, ПараметрыДляЗаписиИзменений.ПоляОтбора, Объект, Артефакты);
					
				КонецЕсли;
				
			КонецЕсли;
			
			КоличествоОбъектов = КоличествоОбъектов + 1;
			
		КонецЦикла;
		
		ПотокЧтения.Закрыть();
		УдалитьФайлы(ОписаниеФайла.ПолноеИмя);
		
	КонецЦикла;
	
	Для Каждого КлючИЗначение Из ОтложенныеНаборы Цикл
		
		Объект = КлючИЗначение.Значение.Объект; // СправочникОбъект, ДокументОбъект
		АртефактыОбъекта = КлючИЗначение.Значение.АртефактыОбъекта;
		КоличествоОбъектов = КоличествоОбъектов + 1;
		
		Попытка
			Объект.Записать();
		Исключение
		
			Комментарий = СтрШаблон(
				НСтр("ru = 'Объекта метаданных %1 с представлением ""%2"" не загружен по причине: %3'", ОбщегоНазначения.КодОсновногоЯзыка()),
				ОбъектМетаданных.ПолноеИмя(),
				Строка(Объект),
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			// @skip-check module-nstr-camelcase - ошибка проверки
			ЗаписьЖурналаРегистрации(
				НСтр("ru = 'Выгрузка загрузка данных. Загрузка объекта метаданных.Ошибка'", ОбщегоНазначения.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка,
				ОбъектМетаданных,
				,
				Комментарий);
			
			ВызватьИсключение Комментарий;
				
		КонецПопытки;
			
		ТекущиеОбработчики.ПослеЗагрузкиОбъекта(ТекущийКонтейнер, Объект, АртефактыОбъекта);
		
	КонецЦикла;
	
	Комментарий = СтрШаблон(
		НСтр("ru = 'Окончание загрузки данных объекта метаданных: %1
					|Загружено объектов: %2'", ОбщегоНазначения.КодОсновногоЯзыка()),
		ОбъектМетаданных.ПолноеИмя(), 
		КоличествоОбъектов);
	ЗаписьЖурналаРегистрации(
		НСтр("ru = 'Выгрузка загрузка данных. Загрузка объекта метаданных'", ОбщегоНазначения.КодОсновногоЯзыка()),
		УровеньЖурналаРегистрации.Информация,
		ОбъектМетаданных,
		,
		Комментарий);
	
КонецПроцедуры

Процедура ЗаписатьОбъектВИнформационнуюБазу(Объект, АртефактыОбъекта, ОтложенныеНаборы, ОбъектМетаданных)
	
	ЗаписатьОбъектВИнформационнуюБазуВнутр(
		Объект,
		АртефактыОбъекта,
		ОтложенныеНаборы,
		ОбъектМетаданных);
	
	Если ФиксироватьОбработкуОбъектов Тогда
		ТекущийКонтейнер.ОбъектОбработан();	
	КонецЕсли;
		
КонецПроцедуры

Процедура ЗаписатьОбъектВИнформационнуюБазуВнутр(Объект, АртефактыОбъекта, ОтложенныеНаборы, ОбъектМетаданных)
	
	Отказ = Ложь;
	ТекущиеОбработчики.ПередЗагрузкойОбъекта(ТекущийКонтейнер, Объект, АртефактыОбъекта, Отказ);
	ЭтоУдалениеОбъекта = ТипЗнч(Объект) = Тип("УдалениеОбъекта");
	
	ПолноеИмяОбъектаМетаданных = ОбъектМетаданных.ПолноеИмя();
	
	Если Не Отказ Тогда
		
		Если ОбщегоНазначенияБТС.ЭтоКонстанта(ОбъектМетаданных) Тогда
			
			Если Не ЗначениеЗаполнено(Объект.Значение) Тогда
				// Поскольку константы предварительно очищались - повторная перезапись пустых
				// значений не требуется.
				Возврат;
			КонецЕсли;
			
		КонецЕсли;
		
		Объект.ОбменДанными.Загрузка = Истина;
		
		Если Не ЭтоУдалениеОбъекта Тогда
			Объект.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов");
		КонецЕсли;
		
		Если ОбщегоНазначенияБТС.ЭтоНезависимыйНаборЗаписей(ОбъектМетаданных) Тогда
			
			Попытка
				
				Объект.Записать();
				
			Исключение
				
				Комментарий = СтрШаблон(
					НСтр("ru = 'Объекта метаданных %1 с представлением ""%2"" не загружен по причине: %3'", ОбщегоНазначения.КодОсновногоЯзыка()),
					ПолноеИмяОбъектаМетаданных,
					Строка(Объект),
					ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				
				// @skip-check module-nstr-camelcase - ошибка проверки
				ЗаписьЖурналаРегистрации(
					НСтр("ru = 'Выгрузка загрузка данных. Загрузка объекта метаданных.Ошибка'", ОбщегоНазначения.КодОсновногоЯзыка()),
					УровеньЖурналаРегистрации.Ошибка,
					ОбъектМетаданных,
					,
					Комментарий);
						
				ВызватьИсключение Комментарий;
				
			КонецПопытки;
			
		Иначе

			ДублиПредопределенных = Неопределено;
			
			Если ОбщегоНазначенияБТС.ЭтоСсылочныеДанныеПоддерживающиеПредопределенныеЭлементы(ОбъектМетаданных)
				И Не ЭтоУдалениеОбъекта
				И Объект.Предопределенный Тогда
				
				ИмяПредопределенного = Объект.ИмяПредопределенныхДанных;
				
				ПолноеИмяПредопределенного = СтрШаблон(
					"%1.%2",
					ПолноеИмяОбъектаМетаданных,
					ИмяПредопределенного);
					
				Если ОбработанныеДублиПредопределенных.Получить(ПолноеИмяПредопределенного) = Неопределено Тогда
					
					ОбработанныеДублиПредопределенных.Вставить(
						ПолноеИмяПредопределенного,
						Истина);
						
					Запрос = Новый Запрос;
					Запрос.Текст = СтрЗаменить("ВЫБРАТЬ
						|	Т.Ссылка КАК Ссылка
						|ИЗ
						|	&Таблица КАК Т
						|ГДЕ 
						|	Т.ИмяПредопределенныхДанных = &ИмяПредопределенного
						|	И Т.Ссылка <> &Ссылка",
						"&Таблица",
					 	ПолноеИмяОбъектаМетаданных);
					Запрос.УстановитьПараметр("ИмяПредопределенного", ИмяПредопределенного);
					Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
					
					ДублиПредопределенных = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
					
				КонецЕсли;
			КонецЕсли;
			
			Попытка
				
				Если ЗначениеЗаполнено(ДублиПредопределенных) Тогда
				
					НачатьТранзакцию();
					
					Попытка
						
						Для Каждого ДубльПредопределенных Из ДублиПредопределенных Цикл
							ДубльПредопределенныхОбъект = ДубльПредопределенных.ПолучитьОбъект(); // СправочникОбъект
							ДубльПредопределенныхОбъект.ОбменДанными.Загрузка = Истина;
							ДубльПредопределенныхОбъект.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов");
							ДубльПредопределенныхОбъект.Удалить();
						КонецЦикла;
						
						Объект.Записать();
						
						ЗафиксироватьТранзакцию();
							
					Исключение
						ОтменитьТранзакцию();
						ВызватьИсключение;
					КонецПопытки;
					
				ИначеЕсли ОбщегоНазначенияБТС.ЭтоРегистрСведений(ОбъектМетаданных)
					И ОбъектМетаданных.РежимЗаписи = Метаданные.СвойстваОбъектов.РежимЗаписиРегистра.ПодчинениеРегистратору 
					И ОбъектМетаданных.ПериодичностьРегистраСведений <> Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.ПозицияРегистратора Тогда
					
					Регистратор = Объект.Отбор.Регистратор.Значение;
					Попытка
						Объект.Записать();
						ОтложенныеНаборы.Удалить(Регистратор);
					Исключение
						ОтложенныеНаборы.Вставить(Регистратор, Новый Структура("Объект, АртефактыОбъекта", Объект, АртефактыОбъекта));
						Возврат;
					КонецПопытки;
				
				Иначе 
					Объект.Записать();
				КонецЕсли;
			Исключение
				
				Комментарий = СтрШаблон(
					НСтр("ru = 'Объекта метаданных %1 с представлением ""%2"" не загружен по причине: %3'", ОбщегоНазначения.КодОсновногоЯзыка()),
					ПолноеИмяОбъектаМетаданных,
					Строка(Объект),
					ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				
				// @skip-check module-nstr-camelcase - ошибка проверки
				ЗаписьЖурналаРегистрации(
					НСтр("ru = 'Выгрузка загрузка данных. Загрузка объекта метаданных.Ошибка'", ОбщегоНазначения.КодОсновногоЯзыка()),
					УровеньЖурналаРегистрации.Ошибка,
					ОбъектМетаданных,
					,
					Комментарий);
			
				ВызватьИсключение Комментарий;
				
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ТекущиеОбработчики.ПослеЗагрузкиОбъекта(ТекущийКонтейнер, Объект, АртефактыОбъекта);
		
КонецПроцедуры

Функция ПараметрыДляЗаписиИзменений(ОбъектМетаданных)
	
	Результат = Новый Структура;
	Результат.Вставить("ЭтоКонстанта", Ложь);
	Результат.Вставить("ЭтоСсылочныеДанные", Ложь);
	Результат.Вставить("ЭтоНаборЗаписей", Ложь);
	Результат.Вставить("ПоляОтбора", Новый Массив);
	
	Если ОбщегоНазначенияБТС.ЭтоКонстанта(ОбъектМетаданных) Тогда
		
		Результат.ЭтоКонстанта = Истина;
		
	ИначеЕсли ОбщегоНазначенияБТС.ЭтоСсылочныеДанные(ОбъектМетаданных) Тогда
		
		Результат.ЭтоСсылочныеДанные = Истина;
		
	ИначеЕсли ОбщегоНазначенияБТС.ЭтоНаборЗаписей(ОбъектМетаданных) Тогда
		
		Результат.ЭтоНаборЗаписей = Истина;
		
		Если Метаданные.РегистрыСведений.Содержит(ОбъектМетаданных)
			И ОбъектМетаданных.РежимЗаписи = Метаданные.СвойстваОбъектов.РежимЗаписиРегистра.Независимый Тогда
			
			Если ОбъектМетаданных.ПериодичностьРегистраСведений <> Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Непериодический
				И ОбъектМетаданных.ОсновнойОтборПоПериоду Тогда
				
				Результат.ПоляОтбора.Добавить("Период");
				
			КонецЕсли;
			
			Для Каждого Измерение Из ОбъектМетаданных.Измерения Цикл
				
				Если Измерение.ОсновнойОтбор Тогда
					
					Результат.ПоляОтбора.Добавить(Измерение.Имя);
					
				КонецЕсли;
				
			КонецЦикла;
			
		ИначеЕсли Метаданные.РегистрыРасчета.Содержит(ОбъектМетаданных.Родитель()) Тогда
			
			Результат.ПоляОтбора.Добавить("ОбъектПерерасчета");
			
		Иначе
			
			Результат.ПоляОтбора.Добавить("Регистратор");
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ЗаписатьИзменениеКонстанты(ОбъектМетаданных, Изменения, Артефакты)
	
	ПланыОбмена.ЗарегистрироватьИзменения(Изменения.Узел, ОбъектМетаданных);
	
	Если ЗначениеЗаполнено(Изменения.НомерСообщения) Тогда
		
		ПланыОбмена.ВыбратьИзменения(Изменения.Узел, Изменения.НомерСообщения, ОбъектМетаданных);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаписатьИзменениеСсылки(ОбъектМетаданных, Изменения, Артефакты)
	
	ПланыОбмена.ЗарегистрироватьИзменения(Изменения.Узел, Изменения.Ссылка);
	
	Если ЗначениеЗаполнено(Изменения.НомерСообщения) Тогда
		
		ПланыОбмена.ВыбратьИзменения(Изменения.Узел, Изменения.НомерСообщения, Изменения.Ссылка);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаписатьИзменениеНабораЗаписей(ОбъектМетаданных, ПоляОтбора, Изменения, Артефакты)
	
	МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ОбъектМетаданных.ПолноеИмя());
	НаборЗаписей = МенеджерОбъекта.СоздатьНаборЗаписей();
	
	Для Каждого ПолеОтбора Из ПоляОтбора Цикл
		
		ЭлементОтбора = НаборЗаписей.Отбор[ПолеОтбора]; // ЭлементОтбора
		ЭлементОтбора.Установить(Изменения[ПолеОтбора]);
		
	КонецЦикла;
	
	ПланыОбмена.ЗарегистрироватьИзменения(Изменения.Узел, НаборЗаписей);
	
	Если ЗначениеЗаполнено(Изменения.НомерСообщения) Тогда
		
		ПланыОбмена.ВыбратьИзменения(Изменения.Узел, Изменения.НомерСообщения, НаборЗаписей);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
