 
 

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Портфель", Объект.Портфель);
	Если ЗначениеЗаполнено(Объект.Портфель) Тогда
		ЗаполнитьДанныеИзПортфеля();
		ПроверитьВозможностьИзмененияПортфеля(Отказ);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.РежимПозиций) Тогда
		Объект.РежимПозиций = Перечисления.биг_OKX_PostionModes.net_mode;
	КонецЕсли;
	
	Если Объект.РазмерПлеча = 0 Тогда
		Объект.РазмерПлеча = 1;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьДоступностьПоИнструментам();
	НастроитьВидимостьЭлементовНастройкиУровняМаржи();
	ТипИнструментаПриИзмененииНаСервере();
	УстановитьДоступностьПлеча();
	УстановитьДоступностьИнструментов();
	УстановитьДоступностьТаблицыАккаунты();
	УстановитьДоступностьРежимаПозиций();
	УстановитьВидимостьФлаговОперацийПоАккаунтам(); 
	РассчитатьДоступностьКнопкиСохранения();
	ПроверкаОткрытойСделки();
	НастройкаВидимостиТейковИОчистка();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура БиржаПриИзменении(Элемент)
	
	УстановитьДоступностьПоИнструментам();
	УстановитьДоступностьТаблицыАккаунты();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьПоИнструментам()
	
	Элементы.ТипИнструмента.Доступность = ЗначениеЗаполнено(Объект.Биржа) И ЗначениеЗаполнено(Объект.Портфель);
	
КонецПроцедуры


&НаКлиенте
Процедура ТипИнструментаПриИзменении(Элемент)
	
	Объект.РазмерПлеча = 1;
	
	ОчиститьТаблицуИнструментов();
	ТипИнструментаПриИзмененииНаСервере();
	УстановитьДоступностьИнструментов();
	УстановитьДоступностьПлеча();
	НастроитьВидимостьЭлементовНастройкиУровняМаржи();
	УстановитьДоступностьРежимаПозиций();
	УстановитьВидимостьФлаговОперацийПоАккаунтам();
	РассчитатьДоступностьКнопкиСохранения();
	
	ТипВыбран = ЗначениеЗаполнено(Объект.ТипИнструмента);
	Элементы.Инструменты.Доступность = ТипВыбран;
	Элементы.РежимТорговли.Доступность = ТипВыбран;
	
	НастройкаВидимостиТейковИОчистка();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьФлаговОперацийПоАккаунтам()
	
	Элементы.ГруппаФлагиОперацийПоАккаунту.Видимость = Объект.ТипПортфеля <> ПредопределенноеЗначение("Перечисление.биг_ТипыПортфелей.Консалтинг");
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьТаблицыАккаунты()
	
	Доступно = ЗначениеЗаполнено(Объект.Биржа) И ЗначениеЗаполнено(Объект.Портфель);
	Элементы.Аккаунты.Доступность = Доступно;
	
КонецПроцедуры

&НаСервере
Процедура ТипИнструментаПриИзмененииНаСервере()
	
	ДоступныеРежимы = биг_МаркетАпи.ПолучитьДоступныеРежимыТорговли(Объект.ТипИнструмента, Объект.Биржа);
	
	ЗаполнитьСписокВыбораРежимовТорговли(ДоступныеРежимы);
	ЗаполнитьДляВсехИнструментов();
	
КонецПроцедуры

&НаКлиенте
Процедура РежимТорговлиПриИзменении(Элемент)
	
	УстановитьДоступностьПлеча();
	НастроитьВидимостьЭлементовНастройкиУровняМаржи();
	УстановитьДоступностьИнструментов();
	
КонецПроцедуры

&НаКлиенте
Процедура РазмерПлечаПриИзменении(Элемент)
	ЗаполнитьМаржуВСтроках();
КонецПроцедуры

&НаКлиенте
Процедура РазмерПлечаПолзунокПриИзменении(Элемент)
	ЗаполнитьМаржуВСтроках();
КонецПроцедуры

&НаКлиенте
Процедура ИнструментыРазмерПлечаПриИзменении(Элемент)
	
	ТекДанные = Элементы.Инструменты.ТекущиеДанные;
	ВыполнитьПроверкуМаржиВСтроке(ТекДанные); 
	
КонецПроцедуры

&НаКлиенте
Процедура ФлагАктуализацияАккаунтовПриИзменении(Элемент)
	РассчитатьДоступностьКнопкиСохранения();
КонецПроцедуры                             

&НаКлиенте
Процедура ФлагАктуализацииВидаМаржиПриИзменении(Элемент)
	РассчитатьДоступностьКнопкиСохранения();
КонецПроцедуры

&НаКлиенте
Процедура ФлагАктуализацииРежимаПозицийПриИзменении(Элемент)
	РассчитатьДоступностьКнопкиСохранения();
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьДоступностьКнопкиСохранения()
	
	Если Объект.ТипПортфеля = ПредопределенноеЗначение("Перечисление.биг_ТипыПортфелей.Консалтинг") Тогда
		КнопкаДоступна = Истина;
	Иначе
		КнопкаДоступна = ФлагАктуализацииВидаМаржи И ФлагАктуализацииРежимаПозиций И ФлагАктуализацииТипаИнструмента;	
	КонецЕсли;                                      
	
	Элементы.Сохранить.Доступность = КнопкаДоступна; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_Инструменты

&НаКлиенте
Процедура ИнструментыИнструментНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	// показывать только те инструменты, у которых Lever >= Объект.РазмерПлеча
	ТекДанные = Элементы.Инструменты.ТекущиеДанные;	
	
	// пробросить фильтр по уровню Lever в форму выбора Инструмента	
	СтандартнаяОбработка 			= Ложь; 	
	Оповещение 						= Новый ОписаниеОповещения("ИнструментыИнструментЗавершениеВыбора", ЭтаФорма);
	
	НастройкиКомпоновкиДанных 		= Новый НастройкиКомпоновкиДанных;
	
	ЭлементОтбора = НастройкиКомпоновкиДанных.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.Использование 	= Истина;
	ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("lever");
	ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	ЭлементОтбора.ПравоеЗначение 	= Объект.РазмерПлеча;
	
	ЭлементОтбора = НастройкиКомпоновкиДанных.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.Использование 	= Истина;
	ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("instType");
	ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение 	= Объект.ТипИнструмента;
	
	ПараметрыОткрытия = Новый Структура("ФиксированныеНастройки", НастройкиКомпоновкиДанных);	
    
	ОткрытьФорму("Справочник.big_Instruments.Форма.ФормаВыбора", ПараметрыОткрытия, ЭтаФорма, ЭтаФорма.КлючУникальности,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ИнструментыИнструментЗавершениеВыбора(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		ТекДанные = Элементы.Инструменты.ТекущиеДанные;
		ТекДанные.Инструмент 	= Результат;
		ИнструментыИнструментПриИзменении(Неопределено);
	КонецЕсли; 
		
КонецПроцедуры

&НаКлиенте
Процедура ИнструментыИнструментАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	СтандартнаяОбработка 			= Ложь; 	
	//Оповещение 						= Новый ОписаниеОповещения("ИнструментыИнструментЗавершениеВыбора", ЭтаФорма);
	//
	//НастройкиКомпоновкиДанных 		= Новый НастройкиКомпоновкиДанных;	
	//
	//ЭлементОтбора = НастройкиКомпоновкиДанных.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ЭлементОтбора.Использование 	= Истина;
	//ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("lever");
	//ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
	//ЭлементОтбора.ПравоеЗначение 	= Объект.РазмерПлеча;
	//
	//
	//ПараметрыОткрытия = Новый Структура("ФиксированныеНастройки", НастройкиКомпоновкиДанных);	
	//
	//ОткрытьФорму("Справочник.big_Instruments.Форма.ФормаВыбора", ПараметрыОткрытия, ЭтаФорма, ЭтаФорма.КлючУникальности,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_Аккаунты

&НаСервере
Процедура ОбновитьМаржуАккаунтаНаСервере(Аккаунт)
	
	// TO DO: запустить каждый аккаунт в отдельный поток, дождаться результата и двинуть дальше
	
	Для каждого Строка Из Объект.Инструменты Цикл
		
		// Создание базовой структуры операции
		СтруктураОперации = биг_МаркетАпиКлиентСервер.СтруктураОперации_УстановитьМаржу();
		
		// Заполнение общих полей
		ЗаполнитьОбщиеПоля(СтруктураОперации, Строка, Объект);
		
		// Логика для FUTURES и SWAP
		Если Объект.ТипИнструмента = Перечисления.big_OKX_InstrumentType.FUTURES 
			ИЛИ Объект.ТипИнструмента = Перечисления.big_OKX_InstrumentType.SWAP Тогда
			
			Если Объект.РежимПозиций = Перечисления.биг_OKX_PostionModes.long_short_mode Тогда
				
				// Выполнение операции для стороны "лонг"
				ВыполнитьОперациюДляСтороны(
				Аккаунт, 
				СтруктураОперации, 
				Перечисления.big_OKX_PositionSides.long
				);
				
				// Выполнение операции для стороны "шорт"
				ВыполнитьОперациюДляСтороны(
				Аккаунт, 
				СтруктураОперации, 
				Перечисления.big_OKX_PositionSides.short
				);
				
			Иначе
				
				// Выполнение операции без указания стороны
				биг_МаркетАпи.УстановитьМаржу(Аккаунт, СтруктураОперации);
			КонецЕсли;
		Иначе
			// Выполнение операции для других типов инструментов
			биг_МаркетАпи.УстановитьМаржу(Аккаунт, СтруктураОперации);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьОбщиеПоля(СтруктураОперации, Строка, Объект)
	
	СтруктураОперации.Вставить("ИнструментИД", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Строка.Инструмент, "instId"));
    // СтруктураОперации.Вставить("МонетаИД", ""); // TO DO: заполняется для крос-маржи
    СтруктураОперации.Вставить("УровеньМаржи", Строка.РазмерПлеча);
    СтруктураОперации.Вставить("РежимТорговли", Объект.РежимТорговли);
	
КонецПроцедуры

Процедура ВыполнитьОперациюДляСтороны(Аккаунт, СтруктураОперации, СторонаПозиции)
	
	// Добавляем сторону позиции в структуру
    СтруктураОперации.Вставить("СторонаПозиции", СторонаПозиции);
    
    // Выполняем операцию установки маржи
    биг_МаркетАпи.УстановитьМаржу(Аккаунт, СтруктураОперации);
    
КонецПроцедуры

&НаСервере
Процедура УстановитьРежимАккаунтаНаСервере(Аккаунт)

	// в идеале это определять в модуле биржи, что бы Обработка портфеля была универсальной
	ТребуемыйУровень = 0;
	Если Объект.ТипИнструмента = Перечисления.big_OKX_InstrumentType.SPOT Тогда
		ТребуемыйУровень = 1;
	Иначе
		ТребуемыйУровень = 2; //(спот и фьючи)
	КонецЕсли; 
	
	Если Объект.РежимТорговли = Перечисления.big_OKX_tdModes.cross Тогда
		ТребуемыйУровень = 3;	
	КонецЕсли;
	
	// есть какой то портфолио маржин мод - врядли нам надо, пока не буду разбираться. если что Уровень = 4
	ТекУровень = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Аккаунт, "acctLv");
	
	Если Число(ТекУровень) < ТребуемыйУровень Тогда
		СтруктураОперации = биг_МаркетАпиКлиентСервер.СтруктураОперации_УстановитьРежимАккаунта();
		СтруктураОперации.УровеньАккаунта = ТребуемыйУровень;
		
		биг_МаркетАпи.УстановитьРежимАккаунта(Аккаунт, СтруктураОперации);
	КонецЕсли;                                                            
	
КонецПроцедуры  

&НаСервере
Процедура УстановитьРежимПозиций(Аккаунт)

	СтруктураОперации = биг_МаркетАпиКлиентСервер.СтруктураОперации_УстановитьРежимПозиций();
	СтруктураОперации.РежимПозиций = Объект.РежимПозиций;
	
	биг_МаркетАпи.УстановитьРежимПозиций(Аккаунт, СтруктураОперации);
	
КонецПроцедуры

&НаКлиенте
Процедура АккаунтыАккаунтНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	// показывать только те аккаунты, которые не входят в другие портфели на тек момент (и которых нет в тек форме)
	// убираем в том числе те аккаунты, которые учавствуют в дабл-импакте
	АккаунтыФормы = Новый Массив;
	Для каждого Строка Из Объект.Аккаунты Цикл
		Если ЗначениеЗаполнено(Строка.Аккаунт) Тогда
			АккаунтыФормы.Добавить(Строка.Аккаунт);
		КонецЕсли;
	КонецЦикла;
	
	МассивАккаунтов = ПолучитьСвободныеАккаунты(АккаунтыФормы, Объект.ВалютаОценкиПортфеля);
	
	СтандартнаяОбработка 			= Ложь; 	
	Оповещение 						= Новый ОписаниеОповещения("АккаунтыАккаунтЗавершениеВыбора", ЭтаФорма);
	
	НастройкиКомпоновкиДанных 		= Новый НастройкиКомпоновкиДанных;	
	
	ЭлементОтбора = НастройкиКомпоновкиДанных.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.Использование 	= Истина;
	ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Ссылка");
	ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.ВСписке;
	ЭлементОтбора.ПравоеЗначение 	= МассивАккаунтов;
	
	ПараметрыОткрытия = Новый Структура("ФиксированныеНастройки", НастройкиКомпоновкиДанных);	
    
	ОткрытьФорму("Справочник.big_MarketAccounts.Форма.ФормаВыбора", ПараметрыОткрытия, ЭтаФорма, ЭтаФорма.КлючУникальности,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	        
КонецПроцедуры

&НаКлиенте
Процедура АккаунтыАккаунтЗавершениеВыбора(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		ТекДанные = Элементы.Аккаунты.ТекущиеДанные;
		ТекДанные.Аккаунт = Результат;
		
		Если Объект.Аккаунты.Количество() > 1 Тогда
			
			// Если изменили первую строку, то "образцом" будет вторая, Иначе Первая.			
			Если ЗначениеЗаполнено(ТекДанные.Аккаунт) Тогда
				Идентификатор 		= ТекДанные.ПолучитьИдентификатор();		
				СтрокаТЧ			= Объект.Аккаунты.НайтиПоИдентификатору(Идентификатор);		
				ИндексТекущейСтроки = Объект.Аккаунты.Индекс(СтрокаТЧ);
				
				Если ИндексТекущейСтроки = 0 Тогда
					АккаунтОбразец = Объект.Аккаунты[1].Аккаунт;
				Иначе
					АккаунтОбразец = Объект.Аккаунты[0].Аккаунт;	
				КонецЕсли;
				
				ПараметрыОткрытия = Новый Структура();
				ПараметрыОткрытия.Вставить("АккаунтОбразец", 		АккаунтОбразец);
				ПараметрыОткрытия.Вставить("ТекущийАккаунт", 		ТекДанные.Аккаунт);
				ПараметрыОткрытия.Вставить("МонетаУчетаПортфеля", 	Объект.ВалютаОценкиПортфеля);
				ПараметрыОткрытия.Вставить("ТипИнструмента", 		Объект.ТипИнструмента);
				
				Оповещение = Новый ОписаниеОповещения("ПриведениеСоставаАккаунтаКМоедельному_Завершение", ЭтаФорма);
				ОткрытьФорму("Обработка.биг_ПриведениеСоставаАккаунтаКМодельному.Форма.Форма", ПараметрыОткрытия, ЭтаФорма,,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			КонецЕсли;
			
		Иначе
			// в Портфеле 1 аккаунт - нет смысла приводить их друг к другу
			// при создании Модельного портфеля Управляющий создает свой модельный аккаунт и приводит его состав к нужным пропорциям
			// после этого добавляет новые аккаунты клиентов, которые будут приводиться по составу к модельному аккаунту
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АккаунтыАккаунтПриИзменении(Элемент)
	// см. АккаунтыАккаунтЗавершениеВыбора
КонецПроцедуры

&НаКлиенте
Процедура ПриведениеСоставаАккаунтаКМоедельному_Завершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено ИЛИ Результат = Ложь Тогда
		ТекДанные	= Элементы.Аккаунты.ТекущиеДанные;
		ТекДанные.Аккаунт = Неопределено;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура АккаунтыПередУдалениемНаСервере(Аккаунт, ВалютаОценкиПортфеля)
	
	Запись = РегистрыСведений.биг_АккаунтыКРаспределению.СоздатьМенеджерЗаписи();
	Запись.Аккаунт = Аккаунт;
	Запись.ВалютаОценки	= ВалютаОценкиПортфеля;
	Запись.Записать(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура АккаунтыПередУдалением(Элемент, Отказ)
	
	ТекДанные	= Элементы.Аккаунты.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекДанные.Аккаунт) Тогда
		АккаунтыПередУдалениемНаСервере(ТекДанные.Аккаунт, Объект.ВалютаОценкиПортфеля);	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сохранить(Команда)
	
	// TO DO: вывести уведомление о прогрессе
	Ошибка = Ложь;
	ПроверитьЗаполнениеНастроекСтоповИТейков(Ошибка);
	
	Если НЕ Ошибка Тогда
		СохранитьНаСервере(Ошибка);	
	КонецЕсли;	
	
	Если НЕ Ошибка Тогда
		Закрыть();	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНаСервере(Ошибка)
	
	НачатьТранзакцию();
	
	Попытка
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.биг_УчастникиПортфелей");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.ИсточникДанных = Объект.Аккаунты.Выгрузить();
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Аккаунт", "Аккаунт");
		ЭлементБлокировки.УстановитьЗначение("Портфель", Объект.Портфель);
		Блокировка.Заблокировать(); 
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.биг_УчастникиСтратегий");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.ИсточникДанных = Объект.Аккаунты.Выгрузить();
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Participiant", "Аккаунт");
		Блокировка.Заблокировать(); 
				
		Если АккаунтыСвободны() Тогда
			
			АккаунтыБезПортфеля = ОтфильтроватьРанееВключенныеАккаунты();
			Дата				= ТекущаяДатаСеанса();			
			// записать аккаунты участников портфеля и заблокировать регистр
			Набор = РегистрыСведений.биг_УчастникиПортфелей.СоздатьНаборЗаписей();
			Набор.Отбор.Портфель.Установить(Объект.Портфель);
			Набор.Прочитать();
			
			Для каждого Строка Из Объект.Аккаунты Цикл				
				Если АккаунтыБезПортфеля.Найти(Строка.Аккаунт) <> Неопределено Тогда
					Запись = Набор.Добавить();
					Запись.Период	= Дата;
					Запись.Портфель = Объект.Портфель;
					Запись.Аккаунт	= Строка.Аккаунт;
					Запись.Участник	= Истина;	
				КонецЕсли;				
			КонецЦикла;                  
			Набор.Записать(Истина);
			
			// установить настройки аккаунтов согласно параметрам портфеля
			Если Объект.ТипПортфеля <> Перечисления.биг_ТипыПортфелей.Консалтинг Тогда				
				Для каждого Строка Из Объект.Аккаунты Цикл                	
					УстановитьРежимАккаунтаНаСервере(Строка.Аккаунт);
					ОбновитьМаржуАккаунтаНаСервере(Строка.Аккаунт);
					УстановитьРежимПозиций(Строка.Аккаунт);
				КонецЦикла;				
			КонецЕсли;
                 		
			// заисать элемент справочника портфель
			ОбъектПортфеля = Объект.Портфель.ПолучитьОбъект();
			Если НЕ ЗначениеЗаполнено(ОбъектПортфеля.Управляющий) Тогда
				ОбъектПортфеля.Управляющий = ПараметрыСеанса.АвторизованныйПользователь;	
			КонецЕсли;
			
			ОбъектПортфеля.Биржа 					= Объект.Биржа;
			ОбъектПортфеля.Портфель 				= Объект.Портфель;
			ОбъектПортфеля.РежимТорговли 			= Объект.РежимТорговли;
			ОбъектПортфеля.ТипИнструмента 			= Объект.ТипИнструмента;
			ОбъектПортфеля.РазмерПлеча 				= Объект.РазмерПлеча;
			ОбъектПортфеля.РежимПозиций				= Объект.РежимПозиций;
			
			ОбъектПортфеля.ТипПортфеля				= Объект.ТипПортфеля;
			ОбъектПортфеля.ВалютаОценкиПортфеля		= Объект.ВалютаОценкиПортфеля;
			
			ОбъектПортфеля.Аккаунты.Очистить();
			ОбъектПортфеля.Аккаунты.Загрузить(Объект.Аккаунты.Выгрузить());
			
			ОбъектПортфеля.Инструменты.Очистить();
			ОбъектПортфеля.Инструменты.Загрузить(Объект.Инструменты.Выгрузить());
			
			ОбъектПортфеля.НастройкаАлгоОрдеров.Очистить();
			ОбъектПортфеля.НастройкаАлгоОрдеров.Загрузить(Объект.НастройкаАлгоОрдеров.Выгрузить());
			
			ОбъектПортфеля.Записать();
			
			ОтразитьВключениеВПортфельАккаунтов();
			
			ЗафиксироватьТранзакцию();			
		КонецЕсли;
		
	Исключение
		Сообщить(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ОтменитьТранзакцию();
		Ошибка = Истина;
	КонецПопытки;            
	
КонецПроцедуры

&НаСервере
Функция ОтфильтроватьРанееВключенныеАккаунты()
	
	ТаблицаАккаунтов = Новый ТаблицаЗначений;
	ТаблицаАккаунтов.Колонки.Добавить("Аккаунт", Новый ОписаниеТипов("СправочникСсылка.big_MarketAccounts"));
	Для каждого Строка Из Объект.Аккаунты Цикл
		НС = ТаблицаАккаунтов.Добавить();
		НС.Аккаунт = Строка.Аккаунт;
	КонецЦикла;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Аккаунты.Аккаунт КАК Аккаунт
	|ПОМЕСТИТЬ ВТ_Аккаунты
	|ИЗ
	|	&Аккаунты КАК Аккаунты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Аккаунты.Аккаунт КАК Аккаунт
	|ИЗ
	|	ВТ_Аккаунты КАК ВТ_Аккаунты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.биг_УчастникиПортфелей.СрезПоследних(, Портфель = &ТекущийПортфель) КАК биг_УчастникиПортфелейСрезПоследних
	|		ПО ВТ_Аккаунты.Аккаунт = биг_УчастникиПортфелейСрезПоследних.Аккаунт
	|ГДЕ
	|	биг_УчастникиПортфелейСрезПоследних.Аккаунт ЕСТЬ NULL";

	Запрос.УстановитьПараметр("Аккаунты", ТаблицаАккаунтов);
	Запрос.УстановитьПараметр("ТекущийПортфель", Объект.Портфель);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Массив = Новый Массив;
	Пока Выборка.Следующий() Цикл
		Массив.Добавить(Выборка.Аккаунт);			
	КонецЦикла;                          
	
	Возврат Массив;
	
КонецФункции


&НаСервере
Функция АккаунтыСвободны()
	
	МассивАккаунтов = Новый Массив();
	Для каждого Строка Из Объект.Аккаунты Цикл
		МассивАккаунтов.Добавить(Строка.Аккаунт);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	биг_УчастникиПортфелейСрезПоследних.Аккаунт КАК Аккаунт
	|ИЗ
	|	РегистрСведений.биг_УчастникиПортфелей.СрезПоследних(
	|			,
	|			Портфель <> &ТекПортфель
	|				И Аккаунт В (&МассивАккаунтов)) КАК биг_УчастникиПортфелейСрезПоследних
	|ГДЕ
	|	биг_УчастникиПортфелейСрезПоследних.Участник
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	биг_УчастникиСтратегийСрезПоследних.Participiant
	|ИЗ
	|	РегистрСведений.биг_УчастникиСтратегий.СрезПоследних(, Participiant В (&МассивАккаунтов)) КАК биг_УчастникиСтратегийСрезПоследних
	|ГДЕ
	|	биг_УчастникиСтратегийСрезПоследних.Участник";
	
	Запрос.УстановитьПараметр("МассивАккаунтов", МассивАккаунтов);
	Запрос.УстановитьПараметр("ТекПортфель",	Объект.Портфель);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Истина;
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Сообщить("Аккаунт " + Выборка.Аккаунт + " уже участвует в другом портфеле/автостратегии");
		КонецЦикла;
		Возврат Ложь;
	КонецЕсли;
		
КонецФункции

&НаСервере
Процедура ОтразитьВключениеВПортфельАккаунтов()
	
	// получим аккаунты для которых нет актуальной записи в результатах управления
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	биг_РезультатыУправленияСрезПоследних.Портфель КАК Портфель,
	|	биг_РезультатыУправленияСрезПоследних.Аккаунт КАК Аккаунт,
	|	биг_РезультатыУправленияСрезПоследних.ВалютаОценкиПортфеля КАК ВалютаОценкиПортфеля,
	|	биг_РезультатыУправленияСрезПоследних.Монета КАК Монета,
	|	биг_РезультатыУправленияСрезПоследних.Количество КАК Количество,
	|	биг_РезультатыУправленияСрезПоследних.Цена КАК Цена,
	|	биг_РезультатыУправленияСрезПоследних.Сумма КАК Сумма
	|ПОМЕСТИТЬ ВТ_ПортфелиАккаунтов
	|ИЗ
	|	РегистрСведений.биг_РезультатыУправления.СрезПоследних(, Аккаунт В (&МассивАккаунтов)) КАК биг_РезультатыУправленияСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПортфелиАккаунтов.Портфель КАК Портфель,
	|	ВТ_ПортфелиАккаунтов.Аккаунт КАК Аккаунт,
	|	ВТ_ПортфелиАккаунтов.ВалютаОценкиПортфеля КАК ВалютаОценкиПортфеля,
	|	ВТ_ПортфелиАккаунтов.Монета КАК Монета,
	|	ВТ_ПортфелиАккаунтов.Количество КАК Количество,
	|	ВТ_ПортфелиАккаунтов.Цена КАК Цена,
	|	ВТ_ПортфелиАккаунтов.Сумма КАК Сумма
	|ПОМЕСТИТЬ ВТ_Пустые
	|ИЗ
	|	ВТ_ПортфелиАккаунтов КАК ВТ_ПортфелиАккаунтов
	|ГДЕ
	|	ВТ_ПортфелиАккаунтов.Портфель = ЗНАЧЕНИЕ(Справочник.биг_Портфели.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПортфелиАккаунтов.Портфель КАК Портфель,
	|	ВТ_ПортфелиАккаунтов.Аккаунт КАК Аккаунт,
	|	ВТ_ПортфелиАккаунтов.ВалютаОценкиПортфеля КАК ВалютаОценкиПортфеля,
	|	ВТ_ПортфелиАккаунтов.Монета КАК Монета,
	|	ВТ_ПортфелиАккаунтов.Количество КАК Количество,
	|	ВТ_ПортфелиАккаунтов.Цена КАК Цена,
	|	ВТ_ПортфелиАккаунтов.Сумма КАК Сумма
	|ПОМЕСТИТЬ ВТ_НЕПустые
	|ИЗ
	|	ВТ_ПортфелиАккаунтов КАК ВТ_ПортфелиАккаунтов
	|ГДЕ
	|	ВТ_ПортфелиАккаунтов.Портфель <> ЗНАЧЕНИЕ(Справочник.биг_Портфели.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Пустые.Портфель КАК Портфель,
	|	ВТ_Пустые.Аккаунт КАК Аккаунт,
	|	ВТ_Пустые.ВалютаОценкиПортфеля КАК ВалютаОценкиПортфеля,
	|	ВТ_Пустые.Монета КАК Монета,
	|	ВТ_Пустые.Количество КАК Количество,
	|	ВТ_Пустые.Цена КАК Цена,
	|	ВТ_Пустые.Сумма КАК Сумма
	|ИЗ
	|	ВТ_Пустые КАК ВТ_Пустые
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НЕПустые КАК ВТ_НЕПустые
	|		ПО ВТ_Пустые.Аккаунт = ВТ_НЕПустые.Аккаунт
	|			И ВТ_Пустые.ВалютаОценкиПортфеля = ВТ_НЕПустые.ВалютаОценкиПортфеля
	|			И ВТ_Пустые.Монета = ВТ_НЕПустые.Монета
	|ГДЕ
	|	ВТ_НЕПустые.Аккаунт ЕСТЬ NULL";
	Запрос.УстановитьПараметр("МассивАккаунтов", Объект.Аккаунты.Выгрузить().ВыгрузитьКолонку("Аккаунт"));
	Запрос.УстановитьПараметр("Портфель", Справочники.биг_Портфели.ПустаяСсылка());
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Дата 	= ТекущаяДатаСеанса();
	
	Пока Выборка.Следующий() Цикл
		
		Набор = РегистрыСведений.биг_РезультатыУправления.СоздатьНаборЗаписей();
		Набор.Отбор.Портфель.Установить(Объект.Портфель);
		Набор.Отбор.Аккаунт.Установить(Выборка.Аккаунт);
		Набор.Отбор.ВалютаОценкиПортфеля.Установить(Выборка.ВалютаОценкиПортфеля);
		Набор.Отбор.Монета.Установить(Выборка.Монета);
		Набор.Отбор.Период.Установить(Дата);
		
		Запись = Набор.Добавить();        
		Запись.Период				= Дата;
		Запись.Портфель 			= Объект.Портфель; 
		Запись.Аккаунт				= Выборка.Аккаунт;
		Запись.ВалютаОценкиПортфеля	= Выборка.ВалютаОценкиПортфеля;
		Запись.Монета				= Выборка.Монета;
		Запись.Количество			= Выборка.Количество;
		Запись.Цена					= Выборка.Цена;
		Запись.Сумма				= Выборка.Сумма;
		
		Набор.Записать(Истина);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьНастройкуСТиТКпоВсем(Команда)
	
	ТекДанные = Элементы.НастройкаАлгоОрдеров.ТекущиеДанные;
	ИД = ТекДанные.ПолучитьИдентификатор();
	
	Для каждого Строка Из Объект.НастройкаАлгоОрдеров Цикл
		ИДСтроки = Строка.ПолучитьИдентификатор();
		Если ИДСтроки <> ИД Тогда
			ЗаполнитьЗначенияСвойств(Строка, ТекДанные,, "Инструмент, ИД");
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура НастройкаВидимостиТейковИОчистка()
	
	Возврат;
	
	ПоддерживатьТейки = (Объект.ТипИнструмента = ПредопределенноеЗначение("Перечисление.big_OKX_InstrumentType.SWAP") ИЛИ Объект.ТипИнструмента = ПредопределенноеЗначение("Перечисление.big_OKX_InstrumentType.FUTURES"));
	
	Элементы.НастройкаАлгоОрдеровИспользоватьТейкПрофит.Видимость 	= ПоддерживатьТейки;
	Элементы.НастройкаАлгоОрдеровВариантАвтоТейк.Видимость 			= ПоддерживатьТейки;
	Элементы.НастройкаАлгоОрдеровПравилоАвтоТейкПрофит.Видимость 	= ПоддерживатьТейки;
	
	Если НЕ ПоддерживатьТейки Тогда
		Для каждого Строка Из Объект.НастройкаАлгоОрдеров Цикл
			Строка.ИспользоватьТейкПрофит 	= Ложь;
			Строка.ВариантАвтоТейк			= Неопределено;
			Строка.ПравилоАвтоТейкПрофит	= 0;
		КонецЦикла;	
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьЗаполнениеНастроекСтоповИТейков(Ошибка)
	
	Для каждого Строка Из Объект.НастройкаАлгоОрдеров Цикл
		
		Если Строка.ИспользоватьСтопЛосс И НЕ (ЗначениеЗаполнено(Строка.ВариантАвтоСтоп) И ЗначениеЗаполнено(Строка.ПравилоАвтоСтопЛосс)) Тогда
			Ошибка = Истина;
			Шаблон = "Для пары " + Строка.Инструмент + " установен флаг использовать Stop Loss, но не заполнены все необходимые поля";
			Сообщить(Шаблон);
		КонецЕсли;
		
		Если (ЗначениеЗаполнено(Строка.ВариантАвтоСтоп) ИЛИ ЗначениеЗаполнено(Строка.ПравилоАвтоСтопЛосс)) И НЕ Строка.ИспользоватьСтопЛосс Тогда
			Ошибка = Истина;
			Шаблон = "Для пары " + Строка.Инструмент + " установлены настройки использования Stop Loss, но не включен флаг применения";
			Сообщить(Шаблон);
		КонецЕсли;
		
		Если Строка.ИспользоватьТейкПрофит И НЕ (ЗначениеЗаполнено(Строка.ВариантАвтоТейк) И ЗначениеЗаполнено(Строка.ПравилоАвтоТейкПрофит)) Тогда
			Ошибка = Истина;
			Шаблон = "Для пары " + Строка.Инструмент + " установен флаг использовать Take Profit, но не заполнены все необходимые поля";
			Сообщить(Шаблон);
		КонецЕсли;
		
		Если (ЗначениеЗаполнено(Строка.ВариантАвтоТейк) ИЛИ ЗначениеЗаполнено(Строка.ПравилоАвтоТейкПрофит)) И НЕ Строка.ИспользоватьТейкПрофит Тогда
			Ошибка = Истина;
			Шаблон = "Для пары " + Строка.Инструмент + " установлены настройки использования Take Profit, но не включен флаг применения";
			Сообщить(Шаблон);
		КонецЕсли;
	КонецЦикла;	
	
КонецФункции

&НаКлиенте
Процедура ПроверкаОткрытойСделки()
	
	Если Объект.Аккаунты.Количество() > 0 Тогда
		Строка 	= Объект.Аккаунты[0];
		Аккаунт = Строка.Аккаунт;
		
		ЕстьОткрытая = ЕстьОткрытаяСделка(Аккаунт);
		Элементы.Аккаунты.Доступность 					= НЕ ЕстьОткрытая;
		Элементы.НадписьЕстьОткрытаяСделка.Видимость 	= ЕстьОткрытая;
	Иначе
		Элементы.НадписьЕстьОткрытаяСделка.Видимость	= Ложь;	
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьОткрытаяСделка(Аккаунт)

	// TODO: По нормальному здесь во втором запросе нужна связь по стратегии и какой то общий регистр с сигналами всех стратегий, но пока и так сойдет
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	биг_ПозицииПоСделкам.Аккаунт КАК Аккаунт,
	|	NULL КАК Participiant
	|ИЗ
	|	РегистрСведений.биг_ПозицииПоСделкам КАК биг_ПозицииПоСделкам
	|ГДЕ
	|	биг_ПозицииПоСделкам.Аккаунт = &Аккаунт
	|	И биг_ПозицииПоСделкам.Позиция.Статус <> &СтатусЗакрыта
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	NULL,
	|	биг_УчастникиСтратегийСрезПоследних.Participiant
	|ИЗ
	|	РегистрСведений.биг_УчастникиСтратегий.СрезПоследних КАК биг_УчастникиСтратегийСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.биг_ДаблИмпактСигналы КАК биг_ДаблИмпактСигналы
	|		ПО (ИСТИНА)
	|ГДЕ
	|	биг_УчастникиСтратегийСрезПоследних.Participiant = &Аккаунт
	|	И (биг_ДаблИмпактСигналы.ТекущееСобытие = ЗНАЧЕНИЕ(Перечисление.биг_ДаблИмпактEvents.АИ_ОжиданиеУвеличенияПозиции)
	|			ИЛИ биг_ДаблИмпактСигналы.ТекущееСобытие = ЗНАЧЕНИЕ(Перечисление.биг_ДаблИмпактEvents.АИ_МониторингПозиции))";
	Запрос.УстановитьПараметр("Аккаунт", 		Аккаунт);
	Запрос.УстановитьПараметр("СтатусЗакрыта", 	Перечисления.big_СтатусыТорговыхОбъектов.Исполнен);
	РезультатЗапроса = Запрос.Выполнить();
	
	ЕстьОткрытая = НЕ РезультатЗапроса.Пустой();
	Возврат ЕстьОткрытая;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьДанныеИзПортфеля()
	
	ПортфельОбъект 					= Объект.Портфель.ПолучитьОбъект();
	Объект.Биржа 					= ПортфельОбъект.Биржа;
	Объект.РежимТорговли 			= ПортфельОбъект.РежимТорговли;
	Объект.ТипИнструмента 			= ПортфельОбъект.ТипИнструмента;
	Объект.РазмерПлеча 				= ПортфельОбъект.РазмерПлеча;
	Объект.Управляющий 				= ПортфельОбъект.Управляющий;
	Объект.РежимПозиций				= ПортфельОбъект.РежимПозиций;
	
	Объект.ТипПортфеля				= ПортфельОбъект.ТипПортфеля;
	Объект.ВалютаОценкиПортфеля		= ПортфельОбъект.ВалютаОценкиПортфеля;
	
	Объект.Инструменты.Загрузить(ПортфельОбъект.Инструменты.Выгрузить());
	Объект.Аккаунты.Загрузить(ПортфельОбъект.Аккаунты.Выгрузить());
	Объект.НастройкаАлгоОрдеров.Загрузить(ПортфельОбъект.НастройкаАлгоОрдеров.Выгрузить());
	
	ДозаполнитьТЧНастроекАлгоОрдеров();
	
	Наименование					= Объект.Портфель.Наименование;
КонецПроцедуры

&НаСервере
Процедура ДозаполнитьТЧНастроекАлгоОрдеров()
	
	Если Объект.НастройкаАлгоОрдеров.Количество() = 0 Тогда
		
		Для каждого Строка Из Объект.Инструменты Цикл
			
			Если НЕ ЗначениеЗаполнено(Строка.ИД) Тогда
				Строка.ИД = Новый УникальныйИдентификатор;
			КонецЕсли;
			
			СтрокаНастройки = Объект.НастройкаАлгоОрдеров.Добавить();
			СтрокаНастройки.ИД = Строка.ИД;
			СтрокаНастройки.Инструмент = Строка.Инструмент;			
		КонецЦикла;	                                       	
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСвободныеАккаунты(АккаунтыФормы, ВалютаОценки)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	биг_АккаунтыКРаспределению.Аккаунт КАК Аккаунт
	|ИЗ
	|	РегистрСведений.биг_АккаунтыКРаспределению КАК биг_АккаунтыКРаспределению
	|ГДЕ
	|	биг_АккаунтыКРаспределению.ВалютаОценки = &ВалютаОценки
	|	И НЕ биг_АккаунтыКРаспределению.Аккаунт В (&АккаунтыФормы)";
	
	Запрос.УстановитьПараметр("АккаунтыФормы", АккаунтыФормы);
	Запрос.УстановитьПараметр("ВалютаОценки", ВалютаОценки);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Массив = Новый Массив;
	Пока Выборка.Следующий() Цикл
			Массив.Добавить(Выборка.Аккаунт);
	КонецЦикла;
	
	Возврат Массив;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСписокВыбораРежимовТорговли(ДоступныеРежимы)

	Элементы.РежимТорговли.СписокВыбора.Очистить();
	Для каждого Режим Из ДоступныеРежимы Цикл
		НС = Элементы.РежимТорговли.СписокВыбора.Добавить();
		НС.Значение = Режим;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДляВсехИнструментов()
	
	Для каждого Строка Из Объект.Инструменты Цикл
		Строка.ТипИнструмента = Объект.ТипИнструмента;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьМаржуВСтроках()
	
	
	Для каждого Строка Из Объект.Инструменты Цикл
		
		Если ВыполнитьПроверкуМаржиВСтроке(Строка) Тогда
			Строка.РазмерПлеча = Объект.РазмерПлеча;	
		КонецЕсли;	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ВыполнитьПроверкуМаржиВСтроке(СтрокаТЧИнструменты)
	
	ПроверкаПоИнструментам = Истина;
	
	Если ЗначениеЗаполнено(СтрокаТЧИнструменты.Инструмент) Тогда
		МаржаИнструмента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТЧИнструменты.Инструмент, "lever"); 
		
		Если МаржаИнструмента < СтрокаТЧИнструменты.РазмерПлеча Тогда
			СтрокаТЧИнструменты.РазмерПлеча = МаржаИнструмента;
			Сообщить("Для инструмента " + СтрокаТЧИнструменты.Инструмент + " максимальное плечо = " + МаржаИнструмента + ". Установлено."); 
		КонецЕсли;		
	КонецЕсли;
	
	Возврат ПроверкаПоИнструментам;
	
КонецФункции

&НаСервере
Процедура НастроитьВидимостьЭлементовНастройкиУровняМаржи()
	
	МаржаДопустима = (Объект.ТипИнструмента = Перечисления.big_OKX_InstrumentType.SPOT И Объект.РежимТорговли = Перечисления.big_OKX_tdModes.spot_isolated)
					ИЛИ (Объект.ТипИнструмента = Перечисления.big_OKX_InstrumentType.MARGIN)
					ИЛИ (Объект.ТипИнструмента = Перечисления.big_OKX_InstrumentType.SWAP)
					ИЛИ (Объект.ТипИнструмента = Перечисления.big_OKX_InstrumentType.FUTURES);
					
	Элементы.РазмерПлеча.Видимость 				= МаржаДопустима;
	Элементы.РазмерПлечаПолзунок.Видимость 		= МаржаДопустима;
	
	ИзолированнаяМаржа = (Объект.РежимТорговли = Перечисления.big_OKX_tdModes.spot_isolated ИЛИ Объект.РежимТорговли = Перечисления.big_OKX_tdModes.isolated);
		
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьПлеча()

	ИнструментУказан = ЗначениеЗаполнено(Объект.ТипИнструмента);
	Элементы.РазмерПлеча.Доступность			= ИнструментУказан;
	Элементы.РазмерПлечаПолзунок.Доступность 	= ИнструментУказан;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьИнструментов()
	
	Доступно = ЗначениеЗаполнено(Объект.РежимТорговли) И ЗначениеЗаполнено(Объект.ТипИнструмента);
	Элементы.Инструменты.Доступность = Доступно;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТаблицуИнструментов()
	
	Объект.Инструменты.Очистить();
	Объект.НастройкаАлгоОрдеров.Очистить();
	
КонецПроцедуры

&НаСервере
Процедура НаименованиеПриИзмененииНаСервере()
	
	Если ЗначениеЗаполнено(Объект.Портфель) Тогда
		ОбъектПортфеля = Объект.Портфель.ПолучитьОбъект();
	Иначе
		ОбъектПортфеля = Справочники.биг_Портфели.СоздатьЭлемент();
	КонецЕсли;                                                     
	
	ОбъектПортфеля.Наименование = Наименование;
	ОбъектПортфеля.Записать();
	
	Объект.Портфель = ОбъектПортфеля.Ссылка;
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	НаименованиеПриИзмененииНаСервере();
	УстановитьДоступностьПоИнструментам();
	УстановитьДоступностьТаблицыАккаунты();
	ПроверкаОткрытойСделки();
	Элементы.Наименование.Доступность = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьНаименование(Команда)
	Элементы.Наименование.Доступность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ИнструментыИнструментПриИзменении(Элемент)
	
	ТекДанные = Элементы.Инструменты.ТекущиеДанные;
	ТекДанные.РазмерПлеча 	= Объект.РазмерПлеча;
	
	Настройка = ПолучитьСтрокуНастройки(ТекДанные);
	Настройка.Инструмент = ТекДанные.Инструмент;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьВозможностьИзмененияПортфеля(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	биг_ОперацииПортфеля.Портфель КАК Портфель,
	|	биг_ОперацииПортфеля.ИнтеграционныйДокумент КАК ИнтеграционныйДокумент,
	|	биг_ОперацииПортфеля.Статус КАК Статус
	|ИЗ
	|	РегистрСведений.биг_ОперацииПортфеля КАК биг_ОперацииПортфеля
	|ГДЕ
	|	биг_ОперацииПортфеля.Портфель = &Портфель
	|	И (биг_ОперацииПортфеля.ИнтеграционныйДокумент = НЕОПРЕДЕЛЕНО
	|			ИЛИ биг_ОперацииПортфеля.Статус <> Значение(Перечисление.big_СтатусыТорговыхОбъектов.Исполнен)
	|			ИЛИ биг_ОперацииПортфеля.Статус <> Значение(Перечисление.big_СтатусыТорговыхОбъектов.Отменен))";
	Запрос.УстановитьПараметр("Портфель", Объект.Портфель);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ТолькоПросмотр = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьРежимаПозиций()

	Элементы.РежимПозиций.Доступность = ЗначениеЗаполнено(Объект.ТипИнструмента) И ЗначениеЗаполнено(Объект.РежимТорговли);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоТОПуНаСервере(КоличествоПервыхИнструментов)
	
	ПараметрыЗапроса = биг_МаркетАпиКлиентСервер.СтруктураОперации_ЗагрузитьТикеры();
	ПараметрыЗапроса.Биржа 			= Объект.Биржа;
	ПараметрыЗапроса.ИнструментТип 	= Объект.ТипИнструмента;
	
	ТаблицаТикеров = биг_МаркетАпи.ЗагрузитьТикеры(ПараметрыЗапроса);
	Если ТаблицаТикеров <> Неопределено Тогда
		ТаблицаТикеров.Сортировать("Объем24ч Убыв");
		
		Объект.Инструменты.Очистить();
		Объект.НастройкаАлгоОрдеров.Очистить();
		
		КоличествоДляПереноса = Мин(КоличествоПервыхИнструментов, ТаблицаТикеров.Количество());
		Сч = 0;
		
		Пока Сч < КоличествоДляПереноса Цикл
			
			НС = Объект.Инструменты.Добавить();
			НС.Инструмент 	= ТаблицаТикеров[Сч].Инструмент;
			НС.ИД			= Новый УникальныйИдентификатор;
			НС.РазмерПлеча	= Объект.РазмерПлеча;
			
			НСНастроек		= Объект.НастройкаАлгоОрдеров.Добавить();
			ЗаполнитьЗначенияСвойств(НСНастроек, НС);
			
			Сч = Сч + 1;		
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросПоТОП_Завершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат <> Неопределено И Результат > 0 Тогда
		ЗаполнитьПоТОПуНаСервере(Результат);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоТОПу(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ВопросПоТОП_Завершение", ЭтаФорма);
	ПоказатьВводЧисла(Оповещение, 10, "Монеты из ТОП-ХХ требуются ?", 3, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура ИнструментыПередУдалением(Элемент, Отказ)
	
	ТекДанные = Элементы.Инструменты.ТекущиеДанные;
	Настройка = ПолучитьСтрокуНастройки(ТекДанные);
	
	Объект.НастройкаАлгоОрдеров.Удалить(Настройка);
	
КонецПроцедуры

&НаКлиенте
Процедура ИнструментыПриАктивизацииСтроки(Элемент)
	
	ТекСтрока = Элементы.Инструменты.ТекущиеДанные;
	
	Если ТекСтрока <> Неопределено Тогда
		Отбор = Новый Структура("ИД", ТекСтрока.ИД);
	Иначе
		Отбор = Новый Структура("ИД", "");	
	КонецЕсли;
	
	Элементы.НастройкаАлгоОрдеров.ОтборСтрок = Новый ФиксированнаяСтруктура(Отбор);
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСтрокуНастройки(СтрокаИнструмента)
	
	Поиск = Новый Структура("ИД", СтрокаИнструмента.ИД);
	СтрокиНастроек = Объект.НастройкаАлгоОрдеров.НайтиСтроки(Поиск);
	
	Если СтрокиНастроек.Количество() > 0 Тогда
		Строка = СтрокиНастроек[0];
	Иначе
		Строка = Объект.НастройкаАлгоОрдеров.Добавить();
		Строка.ИД 			= СтрокаИнструмента.ИД;
		Строка.Инструмент	= СтрокаИнструмента.Инструмент;		
	КонецЕсли;
	
	Возврат Строка;
	
КонецФункции

&НаКлиенте
Процедура ИнструментыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		
		ТекДанные = Элементы.Инструменты.ТекущиеДанные;
		ТекДанные.ИД = Новый УникальныйИдентификатор;
		ТекДанные.РазмерПлеча = Объект.РазмерПлеча;
		
		СтрокаНастройки = Объект.НастройкаАлгоОрдеров.Добавить();
		СтрокаНастройки.ИД = ТекДанные.ИД;
		
		Отбор = Новый Структура("ИД", ТекДанные.ИД);
		Элементы.НастройкаАлгоОрдеров.ОтборСтрок = Новый ФиксированнаяСтруктура(Отбор);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоТопМаркетКапНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоТопМаркетКап(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ВопросПоТОПМаркетКапы_Завершение", ЭтаФорма);
	ПоказатьВводЧисла(Оповещение, 10, "Монеты из ТОП-ХХ требуются ?", 3, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросПоТОПМаркетКапы_Завершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат <> Неопределено И Результат > 0 Тогда
		ЗаполнитьПоТОПуМаркетКапыНаСервере(Результат);
	КонецЕсли;
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьПоТОПуМаркетКапыНаСервере(КоличествоПервыхИнструментов)
	
	// 1. Получаем универсальную структуру параметров
	ПараметрыЗапроса = биг_МаркетАпиКлиентСервер.СтруктураОперации_ЗагрузитьТопИнструментов();
	ПараметрыЗапроса.Биржа = биг_ОбщегоНазначенияКлиентСервер.ПолучитьЗначениеПоИмени("КоинГеко");
	ПараметрыЗапроса.ВалютаЦены = "usd"; // Получить цены в usd
	ПараметрыЗапроса.Лимит = КоличествоПервыхИнструментов; // Получить ТОП-XX
	ПараметрыЗапроса.Сортировка = "marcet_cap"; // Сортировать по маркет капе
	ПараметрыЗапроса.ПорядокСортировки = "desc"; // По убыванию

	// 2. Вызываем унифицированный метод
	ТаблицаТикеров = биг_МаркетАпи.ЗагрузитьТопИнструментов(ПараметрыЗапроса);

	Если ТаблицаТикеров <> Неопределено Тогда
		ТаблицаТикеров.Сортировать("РыночнаяКапитализация Убыв");
		
		ДополнитьТаблицуПоМаркетКапеИнструментамиБиржи(ТаблицаТикеров);
		
		Объект.Инструменты.Очистить();
		Объект.НастройкаАлгоОрдеров.Очистить();
		
		КоличествоДляПереноса = Мин(КоличествоПервыхИнструментов, ТаблицаТикеров.Количество());
		Сч = 0;
		
		Пока Сч < КоличествоДляПереноса Цикл
			
			Если ЗначениеЗаполнено(ТаблицаТикеров[Сч].Инструмент) Тогда
				НС = Объект.Инструменты.Добавить();
				НС.Инструмент 	= ТаблицаТикеров[Сч].Инструмент;
				НС.ИД			= Новый УникальныйИдентификатор;
				НС.РазмерПлеча	= Объект.РазмерПлеча;
				
				НСНастроек		= Объект.НастройкаАлгоОрдеров.Добавить();
				ЗаполнитьЗначенияСвойств(НСНастроек, НС);			
			КонецЕсли;
			
			Сч = Сч + 1;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура ДополнитьТаблицуПоМаркетКапеИнструментамиБиржи(ТаблицаТикеров)

	ТаблицаТикеров.Колонки.Добавить("Инструмент");
	МассивСтейблов = биг_ОбщегоНазначенияКлиентСервер.ПолучитьМассивЗначенийПоИмени("Стейблкоин");
	
	Для каждого Строка Из ТаблицаТикеров Цикл
		
		Монета = Справочники.big_Currencys.НайтиПоРеквизиту("ccy", Врег(Строка.Символ));
		Если МассивСтейблов.Найти(Монета) = Неопределено Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	big_Instruments.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.big_Instruments КАК big_Instruments
			|ГДЕ
			|	(big_Instruments.baseCcy.ccy = &ccy
			|				И big_Instruments.quoteCcy.ccy ПОДОБНО ""USDT%""
			|			ИЛИ big_Instruments.settleCcy.ccy = &ccy
			|				И big_Instruments.ctValCcy.ccy ПОДОБНО ""USDT%"")
			|	И big_Instruments.instType = &instType";
			Запрос.УстановитьПараметр("ccy", 		Врег(Строка.Символ));
			Запрос.УстановитьПараметр("instType", 	Объект.ТипИнструмента);
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда 			
				Строка.Инструмент = Выборка.Ссылка;	
			КонецЕсли;			
		КонецЕсли; 	
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти 

