////////////////////////////////////////////////////////////////////////////////
// Подсистема "Выгрузка загрузка данных".
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает объекты метаданных с предопределенными элементами.
//
// Возвращаемое значение:
//   ФиксированныйМассив Из Строка - массив, содержащий полные имена объектов метаданных.
//
Функция ОбъектыМетаданныхСПредопределеннымиЭлементами() Экспорт
	
	Кэш = Новый Массив();
	
	Для Каждого ОбъектМетаданных Из Метаданные.Справочники Цикл
		Кэш.Добавить(ОбъектМетаданных.ПолноеИмя());
	КонецЦикла;
	
	Для Каждого ОбъектМетаданных Из Метаданные.ПланыСчетов Цикл
		Кэш.Добавить(ОбъектМетаданных.ПолноеИмя());
	КонецЦикла;
	
	Для Каждого ОбъектМетаданных Из Метаданные.ПланыВидовХарактеристик Цикл
		Кэш.Добавить(ОбъектМетаданных.ПолноеИмя());
	КонецЦикла;
	
	Для Каждого ОбъектМетаданных Из Метаданные.ПланыВидовРасчета Цикл
		Кэш.Добавить(ОбъектМетаданных.ПолноеИмя());
	КонецЦикла;
	
	Возврат Новый ФиксированныйМассив(Кэш);
	
КонецФункции

#КонецОбласти
