////////////////////////////////////////////////////////////////////////////////
// <Заголовок модуля: краткое описание и условия применения модуля.>
//  
////////////////////////////////////////////////////////////////////////////////
#Область ПрограммныйИнтерфейс

Функция ЗадачиРасчетаДляАлгоИмпакт(КлючНастроек) Экспорт
		
	// Увеличивать, что бы снизить шум
	// Уменьшать, что бы выявлять более слабые паттерны
	
	ЗадачиРасчета = Новый Массив;
    
	Задача = биг_УправлениеИндикаторамиКлиентСервер.ОписаниеЗадачиРасчетаИндикатора();	
	ЧайкинКороткийЕМА			= биг_СтратегииСервер.ПолучитьЗначениеПараметраСтратегии("АИ_1_Чайкин_КороткийЕМА", КлючНастроек); //2-3
	ЧайкинДлинныйЕМА			= биг_СтратегииСервер.ПолучитьЗначениеПараметраСтратегии("АИ_1_Чайкин_ДлинныйЕМА", КлючНастроек); //7-12
	Задача.Индикатор 			= Перечисления.биг_ВидыИндикаторов.ChOscil;
	Задача.Длина1 				= ЧайкинКороткийЕМА;
	Задача.Длина2 				= ЧайкинДлинныйЕМА;
	Задача.ИмяКолонкиРезультата = "Чайкин";
	ЗадачиРасчета.Добавить(Задача);
	
	Задача = биг_УправлениеИндикаторамиКлиентСервер.ОписаниеЗадачиРасчетаИндикатора();	
	ЧайкинМА					= биг_СтратегииСервер.ПолучитьЗначениеПараметраСтратегии("АИ_1_Чайкин_СМА", КлючНастроек); //4-10 (шаг 2)
	Задача.Индикатор 			= Перечисления.биг_ВидыИндикаторов.SMA;
	Задача.Длина1 				= ЧайкинМА;
	Задача.ИмяПоляДляРасчета	= "Чайкин";
	Задача.ИмяКолонкиРезультата = "Чайкин_СМА";
	ЗадачиРасчета.Добавить(Задача);
	
	Задача = биг_УправлениеИндикаторамиКлиентСервер.ОписаниеЗадачиРасчетаИндикатора();	
	ЧайкинМА					= биг_СтратегииСервер.ПолучитьЗначениеПараметраСтратегии("АИ_1_Чайкин_СреднийМА", КлючНастроек); //4-10 (шаг 2)
	Задача.Индикатор 			= Перечисления.биг_ВидыИндикаторов.MA;
	Задача.Длина1 				= ЧайкинМА;
	Задача.ИмяПоляДляРасчета	= "Чайкин";
	Задача.ИмяКолонкиРезультата = "Чайкин_МА";
	ЗадачиРасчета.Добавить(Задача);
	
	Задача = биг_УправлениеИндикаторамиКлиентСервер.ОписаниеЗадачиРасчетаИндикатора();	
	ЧайкинТВМ					= биг_СтратегииСервер.ПолучитьЗначениеПараметраСтратегии("АИ_1_Чайкин_ТВМ", КлючНастроек);
	Задача.Индикатор 			= Перечисления.биг_ВидыИндикаторов.TVMAX;
	Задача.Длина1 				= 72;
	Задача.Длина2 				= ЧайкинТВМ;
	Задача.ИмяПоляДляРасчета	= "Чайкин";
	Задача.ИмяКолонкиРезультата = "Чайкин_ТВМакс";
	ЗадачиРасчета.Добавить(Задача);
	
	Задача = биг_УправлениеИндикаторамиКлиентСервер.ОписаниеЗадачиРасчетаИндикатора();	
	ЧайкинТВМ					= биг_СтратегииСервер.ПолучитьЗначениеПараметраСтратегии("АИ_1_Чайкин_ТВМ", КлючНастроек);
	Задача.Индикатор 			= Перечисления.биг_ВидыИндикаторов.TVMIN;
	Задача.Длина1 				= 72;
	Задача.Длина2 				= ЧайкинТВМ;
	Задача.ИмяПоляДляРасчета	= "Чайкин";
	Задача.ИмяКолонкиРезультата = "Чайкин_ТВМин";
	ЗадачиРасчета.Добавить(Задача);
		
	Задача = биг_УправлениеИндикаторамиКлиентСервер.ОписаниеЗадачиРасчетаИндикатора();	
	ЗначениеДлины				= биг_СтратегииСервер.ПолучитьЗначениеПараметраСтратегии("АИ_1_МА_ЦенаКороткий", КлючНастроек); //5-7
	Задача.Индикатор 			= Перечисления.биг_ВидыИндикаторов.MA;
	Задача.Длина1 				= ЗначениеДлины;
	Задача.ИмяПоляДляРасчета	= "ЦенаЗакрытия";
	Задача.ИмяКолонкиРезультата = "Цена_МА_Короткий";
	ЗадачиРасчета.Добавить(Задача);
	
	Задача = биг_УправлениеИндикаторамиКлиентСервер.ОписаниеЗадачиРасчетаИндикатора();	
	ЗначениеДлины				= биг_СтратегииСервер.ПолучитьЗначениеПараметраСтратегии("АИ_1_МА_ЦенаДлинный", КлючНастроек); // 20-30
	Задача.Индикатор 			= Перечисления.биг_ВидыИндикаторов.MA;
	Задача.Длина1 				= ЗначениеДлины;
	Задача.ИмяПоляДляРасчета	= "ЦенаЗакрытия";
	Задача.ИмяКолонкиРезультата = "Цена_МА_Длинный";
	ЗадачиРасчета.Добавить(Задача);
	
	Задача = биг_УправлениеИндикаторамиКлиентСервер.ОписаниеЗадачиРасчетаИндикатора();	
	ЗначениеДлины				= биг_СтратегииСервер.ПолучитьЗначениеПараметраСтратегии("АИ_1_РСИ", КлючНастроек); //7-10
	Задача.Индикатор 			= Перечисления.биг_ВидыИндикаторов.RSI;
	Задача.Длина1 				= ЗначениеДлины;
	Задача.ИмяПоляДляРасчета	= "ЦенаЗакрытия";
	Задача.ИмяКолонкиРезультата = "РСИ";
	ЗадачиРасчета.Добавить(Задача);
	
	Задача = биг_УправлениеИндикаторамиКлиентСервер.ОписаниеЗадачиРасчетаИндикатора();	
	ЗначениеДлины				= биг_СтратегииСервер.ПолучитьЗначениеПараметраСтратегии("АИ_1_РСИ_СМА", КлючНастроек); //7-10
	Задача.Индикатор 			= Перечисления.биг_ВидыИндикаторов.SMA;
	Задача.Длина1 				= ЗначениеДлины;
	Задача.ИмяПоляДляРасчета	= "РСИ";
	Задача.ИмяКолонкиРезультата = "РСИ_СМА";
	ЗадачиРасчета.Добавить(Задача); 
	
	Задача = биг_УправлениеИндикаторамиКлиентСервер.ОписаниеЗадачиРасчетаИндикатора();	
	ЗначениеДлины				= биг_СтратегииСервер.ПолучитьЗначениеПараметраСтратегии("АИ_1_АТР", КлючНастроек); //7-10
	Задача.Индикатор 			= Перечисления.биг_ВидыИндикаторов.ATR;
	Задача.Длина1 				= ЗначениеДлины;
	Задача.ИмяПоляДляРасчета	= "ЦенаЗакрытия";
	Задача.ИмяКолонкиРезультата = "АТР";
	ЗадачиРасчета.Добавить(Задача);
	
	Возврат ЗадачиРасчета;
		
КонецФункции

Функция ЗадачиРасчетаДляТорговогоТерминала() Экспорт
		
	ЗадачиРасчета = Новый Массив;
		
	Задача = биг_УправлениеИндикаторамиКлиентСервер.ОписаниеЗадачиРасчетаИндикатора();	
	ЗначениеДлины				= 5; //5-7
	Задача.Индикатор 			= Перечисления.биг_ВидыИндикаторов.MA;
	Задача.Длина1 				= ЗначениеДлины;
	Задача.ИмяПоляДляРасчета	= "ЦенаЗакрытия";
	Задача.ИмяКолонкиРезультата = "Цена_МА_Короткий";
	ЗадачиРасчета.Добавить(Задача);
	
	Задача = биг_УправлениеИндикаторамиКлиентСервер.ОписаниеЗадачиРасчетаИндикатора();	
	ЗначениеДлины				= 14; // 20-30
	Задача.Индикатор 			= Перечисления.биг_ВидыИндикаторов.MA;
	Задача.Длина1 				= ЗначениеДлины;
	Задача.ИмяПоляДляРасчета	= "ЦенаЗакрытия";
	Задача.ИмяКолонкиРезультата = "Цена_МА_Длинный";
	ЗадачиРасчета.Добавить(Задача);
	
	Задача = биг_УправлениеИндикаторамиКлиентСервер.ОписаниеЗадачиРасчетаИндикатора();	
	ЗначениеДлины				= 14; // 20-30
	Задача.Индикатор 			= Перечисления.биг_ВидыИндикаторов.MA;
	Задача.Длина1 				= ЗначениеДлины;
	Задача.ИмяПоляДляРасчета	= "volCcy";
	Задача.ИмяКолонкиРезультата = "Объем_МА";
	ЗадачиРасчета.Добавить(Задача);
	
	Задача = биг_УправлениеИндикаторамиКлиентСервер.ОписаниеЗадачиРасчетаИндикатора();	
	ЗначениеДлины				= 14; //7-10
	Задача.Индикатор 			= Перечисления.биг_ВидыИндикаторов.RSI;
	Задача.Длина1 				= ЗначениеДлины;
	Задача.ИмяПоляДляРасчета	= "ЦенаЗакрытия";
	Задача.ИмяКолонкиРезультата = "РСИ";
	ЗадачиРасчета.Добавить(Задача);
	
	Задача = биг_УправлениеИндикаторамиКлиентСервер.ОписаниеЗадачиРасчетаИндикатора();	
	ЗначениеДлины				= 3; //7-10
	Задача.Индикатор 			= Перечисления.биг_ВидыИндикаторов.SMA;
	Задача.Длина1 				= ЗначениеДлины;
	Задача.ИмяПоляДляРасчета	= "РСИ";
	Задача.ИмяКолонкиРезультата = "РСИ_СМА";
	ЗадачиРасчета.Добавить(Задача); 
	
	Задача = биг_УправлениеИндикаторамиКлиентСервер.ОписаниеЗадачиРасчетаИндикатора();	
	ЗначениеДлины				= 7; //7-10
	Задача.Индикатор 			= Перечисления.биг_ВидыИндикаторов.ATR;
	Задача.Длина1 				= ЗначениеДлины;
	Задача.ИмяПоляДляРасчета	= "ЦенаЗакрытия";
	Задача.ИмяКолонкиРезультата = "АТР";
	ЗадачиРасчета.Добавить(Задача);
	
	Возврат ЗадачиРасчета;
		
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
