
////////////////////////////////////////////////////////////////////////////////
// <Заголовок модуля: краткое описание и условия применения модуля.>
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Вызов метода /api/v3/coins/markets
// https://docs.coingecko.com/reference/coins-markets
Функция GET_CoinsMarkets(ПараметрыЗапроса) Экспорт
	
	// Базовый URL CoinGecko
	BaseURL 	= "https://api.coingecko.com";
	
	// End-point метода
	APIEndpoint = "/api/v3/coins/markets";
	
	// Формирование строки запроса из параметров
	СтрокаПараметров = "";
	Для Каждого Элемент Из ПараметрыЗапроса Цикл
		Если ЗначениеЗаполнено(Элемент.Значение) Тогда
			Если СтрокаПараметров <> "" Тогда
				СтрокаПараметров = СтрокаПараметров + "&";
			КонецЕсли;
			СтрокаПараметров = СтрокаПараметров + Элемент.Ключ + "=" + Элемент.Значение;
		КонецЕсли;
	КонецЦикла;
	
	Если СтрокаПараметров <> "" Тогда
		APIEndpoint = APIEndpoint + "?" + СтрокаПараметров;
	КонецЕсли; 
	
	// Выполнение GET-запроса
	Ответ = биг_КоннекторHTTP.GetJson(BaseURL + APIEndpoint); 
	
	Если Ответ.Количество() > 0 Тогда
		
		ТипЧисло 	= ОбщегоНазначения.ОписаниеТипаЧисло(30, 8);
		ТипСтрока	= ОбщегоНазначения.ОписаниеТипаСтрока(100);
		Таблица 	= Новый ТаблицаЗначений;
		
		// Добавление колонок с русскими названиями
		Таблица.Колонки.Добавить("Инструмент", 				Новый ОписаниеТипов("СправочникСсылка.big_Instruments")); // Ссылка на инструмент
		Таблица = Новый ТаблицаЗначений;
		
		// Добавление колонок с русскими названиями, сопоставленными с предыдущими и новыми данными
		Таблица.Колонки.Добавить("ИнструментИД", 					ТипСтрока); // id (CoinGecko) <-> instId (OKX)
		Таблица.Колонки.Добавить("Символ", 							ТипСтрока); // symbol
		Таблица.Колонки.Добавить("Наименование", 					ТипСтрока); // name
		Таблица.Колонки.Добавить("Изображение", 					ТипСтрока); // путь к логотипу
		Таблица.Колонки.Добавить("ПоследняяЦена", 					ТипЧисло); // current_price <-> last (OKX)
		Таблица.Колонки.Добавить("РыночнаяКапитализация", 			ТипЧисло); // market_cap
		Таблица.Колонки.Добавить("РангРыночнойКапитализации", 		ТипЧисло); // market_cap_rank
		Таблица.Колонки.Добавить("ПолностьюРазводненнаяОценка", 	ТипЧисло); // fully_diluted_valuation
		Таблица.Колонки.Добавить("Объем24ч_ВВалюте", 				ТипЧисло); // total_volume <-> volCcy24h (OKX)
		Таблица.Колонки.Добавить("Максимум24ч", 					ТипЧисло); // high_24h <-> high24h (OKX)
		Таблица.Колонки.Добавить("Минимум24ч", 						ТипЧисло); // low_24h <-> low24h (OKX)
		Таблица.Колонки.Добавить("ИзменениеЦены24ч", 				ТипЧисло); // price_change_24h
		Таблица.Колонки.Добавить("ИзменениеЦеныПроцент24ч", 		ТипЧисло); // price_change_percentage_24h
		Таблица.Колонки.Добавить("ИзменениеРынкаКап24ч", 			ТипЧисло); // market_cap_change_24h
		Таблица.Колонки.Добавить("ИзменениеРынкаКапПроцент24ч", 	ТипЧисло); // market_cap_change_percentage_24h
		Таблица.Колонки.Добавить("ЦиркулирующееПредложение", 		ТипЧисло); // circulating_supply
		Таблица.Колонки.Добавить("ВсегоПредложение", 				ТипЧисло); // total_supply
		Таблица.Колонки.Добавить("МаксПредложение", 				ТипЧисло); // max_supply
		Таблица.Колонки.Добавить("МаксимумЗаВсеВремя", 				ТипЧисло); // ath
		Таблица.Колонки.Добавить("ИзменениеОтATHПроцент", 			ТипЧисло); // ath_change_percentage
		Таблица.Колонки.Добавить("ДатаМаксимумаЗаВсеВремя", 		ТипЧисло); // ath_date (будет храниться как Число - Timestamp)
		Таблица.Колонки.Добавить("МинимумЗаВсеВремя", 				ТипЧисло); // atl
		Таблица.Колонки.Добавить("ИзменениеОтATLПроцент", 			ТипЧисло); // atl_change_percentage
		Таблица.Колонки.Добавить("ДатаМинимумаЗаВсеВремя", 			ТипЧисло); // atl_date (будет храниться как Число - Timestamp)
		Таблица.Колонки.Добавить("ВремяПоследнегоОбновления", 		ТипЧисло); // last_updated (будет храниться как Число - Timestamp)
		
		// Заполнение таблицы данными из ответа CoinGecko
		Для Каждого Соответствие Из Ответ Цикл
			НоваяСтрока = Таблица.Добавить();
			
			// Заполняем поля данными из CoinGecko
			НоваяСтрока.ИнструментИД 					= Соответствие["id"];
			НоваяСтрока.Символ 							= Соответствие["symbol"];
			НоваяСтрока.Наименование 					= Соответствие["name"];
			НоваяСтрока.Изображение 					= Соответствие["image"];
			НоваяСтрока.ПоследняяЦена 					= ?(Соответствие["current_price"] = Неопределено, 0, Число(Соответствие["current_price"]));
			НоваяСтрока.РыночнаяКапитализация 			= ?(Соответствие["market_cap"] = Неопределено, 0, Число(Соответствие["market_cap"]));
			НоваяСтрока.РангРыночнойКапитализации 		= ?(Соответствие["market_cap_rank"] = Неопределено, 0, Число(Соответствие["market_cap_rank"]));
			НоваяСтрока.ПолностьюРазводненнаяОценка 	= ?(Соответствие["fully_diluted_valuation"] = Неопределено, 0, Число(Соответствие["fully_diluted_valuation"]));
			НоваяСтрока.Объем24ч_ВВалюте 				= ?(Соответствие["total_volume"] = Неопределено, 0, Число(Соответствие["total_volume"]));
			НоваяСтрока.Максимум24ч 					= ?(Соответствие["high_24h"] = Неопределено, 0, Число(Соответствие["high_24h"]));
			НоваяСтрока.Минимум24ч 						= ?(Соответствие["low_24h"] = Неопределено, 0, Число(Соответствие["low_24h"]));
			НоваяСтрока.ИзменениеЦены24ч 				= ?(Соответствие["price_change_24h"] = Неопределено, 0, Число(Соответствие["price_change_24h"]));
			НоваяСтрока.ИзменениеЦеныПроцент24ч 		= ?(Соответствие["price_change_percentage_24h"] = Неопределено, 0, Число(Соответствие["price_change_percentage_24h"]));
			НоваяСтрока.ИзменениеРынкаКап24ч 			= ?(Соответствие["market_cap_change_24h"] = Неопределено, 0, Число(Соответствие["market_cap_change_24h"]));
			НоваяСтрока.ИзменениеРынкаКапПроцент24ч 	= ?(Соответствие["market_cap_change_percentage_24h"] = Неопределено, 0, Число(Соответствие["market_cap_change_percentage_24h"]));
			НоваяСтрока.ЦиркулирующееПредложение 		= ?(Соответствие["circulating_supply"] = Неопределено, 0, Число(Соответствие["circulating_supply"]));
			НоваяСтрока.ВсегоПредложение 				= ?(Соответствие["total_supply"] = Неопределено, 0, Число(Соответствие["total_supply"]));
			НоваяСтрока.МаксПредложение 				= ?(Соответствие["max_supply"] = Неопределено, 0, Число(Соответствие["max_supply"]));
			НоваяСтрока.МаксимумЗаВсеВремя 				= ?(Соответствие["ath"] = Неопределено, 0, Число(Соответствие["ath"]));
			НоваяСтрока.ИзменениеОтATHПроцент 			= ?(Соответствие["ath_change_percentage"] = Неопределено, 0, Число(Соответствие["ath_change_percentage"]));
			НоваяСтрока.ДатаМаксимумаЗаВсеВремя 		= Соответствие["ath_date"]; 
			НоваяСтрока.МинимумЗаВсеВремя 				= ?(Соответствие["atl"] = Неопределено, 0, Число(Соответствие["atl"]));
			НоваяСтрока.ИзменениеОтATLПроцент 			= ?(Соответствие["atl_change_percentage"] = Неопределено, 0, Число(Соответствие["atl_change_percentage"]));
			НоваяСтрока.ДатаМинимумаЗаВсеВремя 			= Соответствие["atl_date"];
			НоваяСтрока.ВремяПоследнегоОбновления 		= Соответствие["last_updated"];
		КонецЦикла;
		
		Результат 		= Таблица;		
	Иначе
		
		Результат = Неопределено;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиПроведения

#КонецОбласти

#Область ОбработчикиСобытий

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти


