
&НаКлиенте
Процедура ИзменитьНастройку(Команда)
	
	Данные = Элементы.Список.ТекущиеДанные;
	ПараметрыОткрытия = Новый Структура("Настройка", Данные.Ссылка);
	ОткрытьФорму("Обработка.биг_УправлениеНастройкамиСтратегий.Форма.Форма", ПараметрыОткрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура НоваяНастройка(Команда)
	
	ОткрытьФорму("Обработка.биг_УправлениеНастройкамиСтратегий.Форма.Форма");
	
КонецПроцедуры

&НаСервере
Процедура АктуализироватьНазванияКлючейНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	биг_КлючиНастроекСтратегии.Ссылка КАК Ссылка,
	|	биг_КлючиНастроекСтратегии.Владелец КАК Владелец
	|ИЗ
	|	Справочник.биг_КлючиНастроекСтратегии КАК биг_КлючиНастроекСтратегии";
	
	ВыборкаНастройка = Запрос.Выполнить().Выбрать();
	Пока ВыборкаНастройка.Следующий() Цикл
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	big_КонтрольныеУровни.Ссылка КАК КонтрольныйУровень,
		|	&Настройка КАК Настройка,
		|	big_КонтрольныеУровни.КраткоеПредставление КАК КраткоеПредставление,
		|	big_КонтрольныеУровни.ПорядокВНазвании КАК ПорядокВНазвании,
		|	big_КонтрольныеУровни.ЗначениеПоУмолчанию КАК ЗначениеПоУмолчанию,
		|	ВЫБОР
		|		КОГДА big_КонтрольныеУровни.КраткоеПредставление = """"
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК КраткоеПредставлениеЗаполнено
		|ПОМЕСТИТЬ ВТ_Настройки
		|ИЗ
		|	Справочник.big_КонтрольныеУровни КАК big_КонтрольныеУровни
		|ГДЕ
		|	big_КонтрольныеУровни.Владелец = &Владелец
		|	И НЕ big_КонтрольныеУровни.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Настройки.КонтрольныйУровень КАК КонтрольныйУровень,
		|	ЕСТЬNULL(биг_ЗначенияКонтрольныхУровней.Значение, """") КАК Значение,
		|	ВТ_Настройки.КраткоеПредставление КАК КраткоеПредставление,
		|	ВТ_Настройки.ПорядокВНазвании КАК ПорядокВНазвании,
		|	ВТ_Настройки.ЗначениеПоУмолчанию КАК ЗначениеПоУмолчанию,
		|	ВТ_Настройки.КонтрольныйУровень.Код КАК Код,
		|	ВТ_Настройки.КраткоеПредставлениеЗаполнено КАК КраткоеПредставлениеЗаполнено
		|ИЗ
		|	ВТ_Настройки КАК ВТ_Настройки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.биг_ЗначенияКонтрольныхУровней КАК биг_ЗначенияКонтрольныхУровней
		|		ПО ВТ_Настройки.КонтрольныйУровень = биг_ЗначенияКонтрольныхУровней.КонтрольныйУровень
		|			И ВТ_Настройки.Настройка = биг_ЗначенияКонтрольныхУровней.НастройкаСтратегии
		|
		|УПОРЯДОЧИТЬ ПО
		|	КраткоеПредставлениеЗаполнено,
		|	ПорядокВНазвании,
		|	КраткоеПредставление";
		
		Запрос.УстановитьПараметр("Владелец", ВыборкаНастройка.Владелец);
		Запрос.УстановитьПараметр("Настройка", ВыборкаНастройка.Ссылка);
		ВыборкаЗначений = Запрос.Выполнить().Выбрать();
		
		НазваниеСтратегии 	= "" + ВыборкаНастройка.Владелец + ": ";
		СтрокаОсновных 		= "";
		СтрокаВторичных 	= " (";
		НужнаВторичная 		= Ложь;
		
		Пока ВыборкаЗначений.Следующий() Цикл
			
			Если ЗначениеЗаполнено(ВыборкаЗначений.КраткоеПредставление) Тогда
				СтрокаОсновных = СтрокаОсновных + ВыборкаЗначений.КраткоеПредставление + "=" + ВыборкаЗначений.Значение + "; ";				
			Иначе				
				
				Если ВыборкаЗначений.ЗначениеПоУмолчанию <> ВыборкаЗначений.Значение Тогда
					СтрокаВторичных = СтрокаВторичных + ВыборкаЗначений.Код + "=" + ВыборкаЗначений.Значение + ";";
					НужнаВторичная 	= Истина;
				КонецЕсли;								
			КонецЕсли;
			
		КонецЦикла;
		
		СтрокаВторичных = СтрокаВторичных + ")";
		
		НастройкаОбъект = ВыборкаНастройка.Ссылка.ПолучитьОбъект();
		НастройкаОбъект.Наименование = НазваниеСтратегии + СтрокаОсновных + ?(НужнаВторичная, СтрокаВторичных, "");
		НастройкаОбъект.НаименованиеПолное = НазваниеСтратегии + СтрокаОсновных + ?(НужнаВторичная, СтрокаВторичных, ""); 
		НастройкаОбъект.Записать();
	КонецЦикла;                    
	
	Сообщить("Выполнено");
	
КонецПроцедуры

&НаКлиенте
Процедура АктуализироватьНазванияКлючей(Команда)
		
	АктуализироватьНазванияКлючейНаСервере(); 
	
КонецПроцедуры
