


 ////////////////////////////////////////////////////////////////////////////////
 // <Заголовок модуля: краткое описание и условия применения модуля.>
 //  
 ////////////////////////////////////////////////////////////////////////////////
 
 
 #Область ОбработчикиСобытийФормы
 
 &НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтартовоеЗаполнениеФормы();	
	
КонецПроцедуры
 
 #КонецОбласти
 
 
 #Область ОбработчикиСобытийЭлементовШапкиФормы
 
 #КонецОбласти
 
 
 
 #Область ОбработчикиКомандФормы
 
 &НаКлиенте
Процедура ПолучитьСвечи(Команда)
	
	ПолучитьСвечиНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьСвечиНаСервере()
	
	СтруктураОперации = биг_МаркетАпиКлиентСервер.СтруктураОперации_ЗагрузитьСвечи();
	СтруктураОперации.Биржа            = Market;
	СтруктураОперации.ИнструментИД     = instId;
	СтруктураОперации.Бар              = Bar;
	СтруктураОперации.КоличествоСвечей = 300;
	
	биг_МаркетАпи.ЗагрузитьСвечи(СтруктураОперации);
	
	//РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	//РеквизитОбъект.GET_DownloadCandles(Instrument, Bar);
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьИнструментыНаСервере()
	
	РеквизитОбъект = РеквизитФормыВЗначение("Объект");
	
	СтруктураОперации = биг_МаркетАпиКлиентСервер.СтруктураОперации_ЗагрузитьИнструменты();
	СтруктураОперации.Биржа 			= Market;
	СтруктураОперации.ИнструментТип 	= instType;
	СтруктураОперации.ИнструментИД 	= instId;

	биг_МаркетАпи.ЗагрузитьИнструменты(СтруктураОперации);
	
	//РеквизитОбъект.GET_DownloadInstruments(instType, uly, instFamily, instId);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИнструменты(Команда)
	ЗагрузитьИнструментыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПодгрузитьИсториюСвечейНаСервере(СтруктураОперации)
		
	биг_МаркетАпи.ЗагрузитьИсториюСвечей(СтруктураОперации);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодгрузитьИсториюСвечей(Команда)
	
	Лимит 				= 100;
	
	ТС 					= ?(ЗначениеЗаполнено(ГрузитьОтТочки), биг_ОбщегоНазначенияКлиентСервер.ДатуВTimestampЧисло(ГрузитьОтТочки), биг_ОбщегоНазначенияКлиентСервер.ДатуВTimestampЧисло());
	ГрузитьДоТочкиТС 	= биг_ОбщегоНазначенияКлиентСервер.ДатуВTimestampЧисло(ГрузитьДоТочки);
	
	ДлительностьБара	= ДлительностьБара(Bar);
	ТребуетсяБар		= Цел((ТС - ГрузитьДоТочкиТС) / ДлительностьБара) + 1;
	ТребуетсяИтераций	= Цел(ТребуетсяБар/Лимит); 
	
	Сч = 0;
	
	Состояние("Начало загрузки", 0);
	
	Пока ТС > ГрузитьДоТочкиТС Цикл
		
		ТССтрока = биг_ОбщегоНазначенияКлиентСервер.TimeStampЧислоВСтроку(ТС);
		
		СтруктураОперации = биг_МаркетАпиКлиентСервер.СтруктураОперации_ЗагрузитьИсториюСвечей();
		СтруктураОперации.Биржа            = Market;
		СтруктураОперации.ИнструментИД     = instId;
		СтруктураОперации.Бар              = Bar;
		СтруктураОперации.ТочкаДо          = ТССтрока;
		//СтруктураОперации.ТочкаПосле       = "";
		СтруктураОперации.КоличествоСвечей = Лимит;
		
		ПодгрузитьИсториюСвечейНаСервере(СтруктураОперации);
		
		ТС = ТС - (ДлительностьБара * 100);
		
		Сч = Сч + 1;		
			
		Прогресс = Окр(Сч / ТребуетсяИтераций * 100, 0);
		
		Шаблон 			= "Загрузка свечей %1 / %2 запросов";
		ТекстСостояния 	= СтрШаблон(Шаблон, Сч, ТребуетсяИтераций);
		
		Состояние(ТекстСостояния, Прогресс);	
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьRSIНаСервере()
	
	ТСНачало 		= биг_ОбщегоНазначенияКлиентСервер.ДатуВTimestampЧисло(НачалоПериодаRSI);
	ТСЗавершение 	= биг_ОбщегоНазначенияКлиентСервер.ДатуВTimestampЧисло(ЗавершениеПериодаRSI); 
	
	//биг_Индикаторы.ВычислитьПоказательRSISMA(Market, instId, Bar, ТСНачало, ТСЗавершение);
	
	// по новому
	биг_Индикаторы.ВычислитьПоказатель(Market, instId, Bar, Перечисления.биг_ВидыИндикаторов.RSI, 14,,, Перечисления.биг_ИсточникиДанныхТехническихИндикаторов.ЦенаЗакрытия, ТСНачало, ТСЗавершение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьRSI(Команда)
	ОбновитьRSIНаСервере();
	Сообщить("RSI пересчитан");
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьОрдера(Команда)
	ЗагрузитьОрдераНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьОрдераНаСервере()
	
	// ОТКРЫТЫЕ ОРДЕРА
	
	СтруктураОперации = биг_МаркетАпиКлиентСервер.СтруктураОперации_ПолучитьСписокОрдеров();
	СтруктураОперации.Аккаунт 		= Account;

	биг_МаркетАпи.ПолучитьСписокОрдеров(Account, СтруктураОперации);
	
	//РеквизитОбъект 	= РеквизитФормыВЗначение("Объект");
	//РеквизитОбъект.GET_PendingOrders(Account);
	
КонецПроцедуры

&НаСервере
Процедура ИсторияОрдеровНаСервере()
	
	СтруктураОперации = биг_МаркетАпиКлиентСервер.СтруктураОперации_ПолучитьИсториюОрдеров();
	СтруктураОперации.Аккаунт 		= Account;
	СтруктураОперации.ИнструментТип	= instType;
	
	Если ЗначениеЗаполнено(instId) Тогда
		СтруктураОперации.ИнструментИД = instId;	
	КонецЕсли;
	
	биг_МаркетАпи.ПолучитьИсториюОрдеров(Account, СтруктураОперации);
	//РеквизитОбъект 	= РеквизитФормыВЗначение("Объект");
	//РеквизитОбъект.GET_OrdersHistory_7(Account,,,,,,,,,,,,, instId);
	
КонецПроцедуры

&НаКлиенте
Процедура ИсторияОрдеров(Команда)
	ИсторияОрдеровНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПолучитьБаллансНаСервере()

	СтруктураОперации = биг_МаркетАпиКлиентСервер.СтруктураОперации_ОбновитьБаллансСчета();
	СтруктураОперации.Биржа 	= Market;
	СтруктураОперации.Аккаунт = Account;
	
	биг_МаркетАпи.ОбновитьБаллансСчета(Account, СтруктураОперации); 
	
	//РеквизитОбъект 	= РеквизитФормыВЗначение("Объект");
	//РеквизитОбъект.GET_AccountBalance(Account);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьБалланс(Команда)
	ПолучитьБаллансНаСервере();
КонецПроцедуры

&НаСервере
Процедура КонфигурацияАккаунтаНаСервере()
	
	СтруктураОперации = биг_МаркетАпиКлиентСервер.СтруктураОперации_ПолучитьИнформациюОбАккаунте();
	СтруктураОперации.Биржа 	= Market;
	СтруктураОперации.Аккаунт = Account;
	
	биг_МаркетАпи.ПолучитьИнформациюОбАккаунте(Account, СтруктураОперации);
	
	//РеквизитОбъект 	= РеквизитФормыВЗначение("Объект");
	//РеквизитОбъект.GET_AccountConfiguration(Account);
	
КонецПроцедуры

&НаКлиенте
Процедура КонфигурацияАккаунта(Команда)
	КонфигурацияАккаунтаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтправитьОрдерНаСервере()
	
	биг_МаркетАпи.СоздатьОрдер(Order);
	
	//РеквизитОбъект 	= РеквизитФормыВЗначение("Объект");
	//РеквизитОбъект.POST_PlaceOrder(Order);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьОрдер(Команда)
	ОтправитьОрдерНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьОрдерНаСервере()
	
	Аккаунт = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Order, 	"Аккаунт");
	Если Не ЗначениеЗаполнено(Аккаунт) Тогда
		Сообщить("В документе не указан Аккаунт");
		Возврат;
	КонецЕсли;
	биг_МаркетАпи.АктуализироватьОрдер(Order);
	
	//РеквизитОбъект 	= РеквизитФормыВЗначение("Объект");
	//РеквизитОбъект.GET_OrderDetails(Order);	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОрдер(Команда)
	ОбновитьОрдерНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПолучитьПозицииНаСервере()
	
	СтруктураОперации = биг_МаркетАпиКлиентСервер.СтруктураОперации_ПолучитьОткрытыеПозиции();
	СтруктураОперации.Биржа			= Market;
	СтруктураОперации.Аккаунт       = Account;
	СтруктураОперации.ИнструментТип = instType;
	СтруктураОперации.ИнструментИД  = instId;
	
	биг_МаркетАпи.ПолучитьОткрытыеПозиции(Account, СтруктураОперации);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьПозиции(Команда)
	ПолучитьПозицииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗакрытьПозициюНаСервере()
	
	биг_МаркетАпи.ЗакрытьПозицию(Позиция, Account);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьПозицию(Команда)
	ЗакрытьПозициюНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ИсторияПозиций(Команда)
	ИсторияПозицийНаСервере();
КонецПроцедуры

&НаСервере
Процедура ИсторияПозицийНаСервере()

	СтруктураОперации = биг_МаркетАпиКлиентСервер.СтруктураОперации_ПолучитьИсториюПозиций();
	СтруктураОперации.Биржа			= Market;
	СтруктураОперации.Аккаунт       = Account;
	СтруктураОперации.ИнструментТип = instType;
	СтруктураОперации.ИнструментИД  = instId;
	
	биг_МаркетАпи.ПолучитьИсториюПозиций(Account, СтруктураОперации);
	
КонецПроцедуры

#КонецОбласти
 
 
#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ДлительностьБара(Бар)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Бар, "SecondsAmount");
		
КонецФункции


&НаСервере
Процедура СтартовоеЗаполнениеФормы()

	Market 		= РегистрыСведений.биг_ПредопределенныеЭлементы.ПолучитьЗначениеПоИмени("OKX");
    instId 		= "BTC-USDT-SWAP";
	Bar			= Справочники.big_BarTypes.H1;
	Account		= РегистрыСведений.биг_ПредопределенныеЭлементы.ПолучитьЗначениеПоИмени("OKXDemoAccount");
	orderType	= Перечисления.big_OKX_OrderTypes.conditional;
	
	НачалоПериодаRSI = Дата("20200101"); 
	ЗавершениеПериодаRSI = КонецМесяца(ТекущаяДата());
	
	ГрузитьДоТочки		= Дата(2023,12,28);
	
	Order		= ПодобратьНеотправленныйОрдер();
    instType	= Перечисления.big_OKX_InstrumentType.SWAP;
	
КонецПроцедуры

&НаСервере
Функция ПодобратьНеотправленныйОрдер()

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	big_Order_OKX.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.big_Order_OKX КАК big_Order_OKX
	|ГДЕ
	|	НЕ big_Order_OKX.ПометкаУдаления
	|	И big_Order_OKX.ordId = """"
	|
	|УПОРЯДОЧИТЬ ПО
	|	big_Order_OKX.Ссылка УБЫВ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Ссылка;	
	
КонецФункции

///////////////////
/// АЛГО-ОРДЕРА

&НаСервере
Процедура ОтправитьАлгоНаСервере()

	Если НЕ ЗначениеЗаполнено(АлгоОрдер.Аккаунт) Тогда
		Сообщить("В документе не указан аккаунт");
		Возврат;
	КонецЕсли;  
	
	биг_МаркетАпи.СоздатьАлгоОрдер(АлгоОрдер, Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьАлго(Команда)
	ОтправитьАлгоНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОткрытыеАлгоНаСервере()
	
	СтруктураОперации = биг_МаркетАпиКлиентСервер.СтруктураОперации_ПолучитьСписокАлгоОрдеров();
	СтруктураОперации.Аккаунт = Account;
	СтруктураОперации.ОрдерТип = orderType;
	
	биг_МаркетАпи.ПолучитьСписокАлгоОрдеров(Account, СтруктураОперации);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытыеАлго(Команда)
	ОткрытыеАлгоНаСервере();
КонецПроцедуры

&НаСервере
Процедура ИсторияАлгоНаСервере()
	
	СтруктураОперации = биг_МаркетАпиКлиентСервер.СтруктураОперации_ПолучитьИсториюАлгоОрдеров();
	СтруктураОперации.ОрдерТип = orderType;
	СтруктураОперации.ИнструментИД = instId;                             
	
	//биг_МаркетАпи.ПолучитьИсториюАлгоОрдеров(Account, СтруктураОперации);
	
	СтруктураОперации.Состояние = "effective";	
	биг_МаркетАпи.ПолучитьИсториюАлгоОрдеров(Account, СтруктураОперации);
	
	СтруктураОперации.Состояние = "canceled";	
	биг_МаркетАпи.ПолучитьИсториюАлгоОрдеров(Account, СтруктураОперации);
	
	СтруктураОперации.Состояние = "order_failed";	
	биг_МаркетАпи.ПолучитьИсториюАлгоОрдеров(Account, СтруктураОперации);
	
КонецПроцедуры

&НаКлиенте
Процедура ИсторияАлго(Команда)
	ИсторияАлгоНаСервере();
КонецПроцедуры

&НаСервере
Процедура ИзменитьАлгоНаСервере()
	
	СтруктураОперации = биг_МаркетАпиКлиентСервер.СтруктураОперации_ИзменитьАлгоОрдер();
		
	Если ЗначениеЗаполнено(newSlOrdPx) Тогда
		СтруктураОперации.НовыйЦенаСтопЛос = newSlOrdPx;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(newSlTriggerPx) Тогда
		СтруктураОперации.НовыйТриггерСтопЛос = newSlTriggerPx;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(newTpTriggerPx) Тогда
		СтруктураОперации.НовыйТриггерТейкПрофит = newTpTriggerPx;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(newTpOrdPx) Тогда
		СтруктураОперации.НовыйЦенаТейкПрофит = newTpOrdPx;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(newSz) Тогда
		СтруктураОперации.НовыйОбъемТейкПрофит = newSz;
	КонецЕсли;
	
	биг_МаркетАпи.ИзменитьАлгоОрдер(АлгоОрдер, СтруктураОперации);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьАлго(Команда)
	ИзменитьАлгоНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтменитьАлгоНаСервере()
	
	СтруктураОперации = биг_МаркетАпиКлиентСервер.СтруктураОперации_ОтменитьАлгоОрдер();
	СтруктураОперации.АлгоОрдерИД = АлгоОрдер.algoId;
	
	биг_МаркетАпи.ОтменитьАлгоОрдер(АлгоОрдер, СтруктураОперации);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьАлго(Команда)
	ОтменитьАлгоНаСервере();
КонецПроцедуры

&НаСервере
Процедура АктуализироватьАлгоНаСервере()
	
	СтруктураОперации = биг_МаркетАпиКлиентСервер.СтруктураОперации_АктуализироватьАлгоОрдер();
	
	Если ЗначениеЗаполнено(КлиентАлгоОрдерИД) Тогда
		СтруктураОперации.КлиентАлгоОрдерИД = КлиентАлгоОрдерИД;
	Иначе
		СтруктураОперации.КлиентАлгоОрдерИД = биг_ОКХ_КлиентСервер.КлиентскийИдентификатор(АлгоОрдер);	
	КонецЕсли; 
	
	биг_МаркетАпи.АктуализироватьАлгоОрдер(АлгоОрдер, СтруктураОперации);
	
КонецПроцедуры

&НаКлиенте
Процедура АктуализироватьАлго(Команда)
	АктуализироватьАлгоНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПолучитьЦенуНаСервере()
	
	СтруктураОперации = биг_МаркетАпиКлиентСервер.СтруктураОперации_ПолучитьЦену();
	СтруктураОперации.Биржа			= Market;
	СтруктураОперации.ИнструментТип	= instType;
	СтруктураОперации.ИнструментИД	= instId;
	
	Цена = биг_МаркетАпи.ПолучитьЦену(СтруктураОперации);
	Сообщить(Цена);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьЦену(Команда)
	ПолучитьЦенуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьSMA20_ОбъемНаСервере()
	
	ТСНачало 		= биг_ОбщегоНазначенияКлиентСервер.ДатуВTimestampЧисло(НачалоПериодаRSI);
	ТСЗавершение 	= биг_ОбщегоНазначенияКлиентСервер.ДатуВTimestampЧисло(ЗавершениеПериодаRSI); 
	
	//биг_Индикаторы.ВычислитьПоказатель(Market, instId, Bar, Перечисления.биг_ВидыИндикаторов.MA, 20, Перечисления.биг_ВидыИндикаторов.SMA, 9, "Объем", ТСНачало, ТСЗавершение);
	//биг_Индикаторы.ВычислитьПоказатель(Market, instId, Bar, Перечисления.биг_ВидыИндикаторов.SMA, 9, , , "Объем", ТСНачало, ТСЗавершение);
	биг_Индикаторы.ВычислитьПоказатель(Market, instId, Bar, Перечисления.биг_ВидыИндикаторов.MA, 20, , , Перечисления.биг_ИсточникиДанныхТехническихИндикаторов.volCcy, ТСНачало, ТСЗавершение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьSMA20_Объем(Команда)
	ОбновитьSMA20_ОбъемНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьRSIПоСтаромуНаСервере()
	
	ТСНачало 		= биг_ОбщегоНазначенияКлиентСервер.ДатуВTimestampЧисло(НачалоПериодаRSI);
	ТСЗавершение 	= биг_ОбщегоНазначенияКлиентСервер.ДатуВTimestampЧисло(ЗавершениеПериодаRSI);
	
	биг_Индикаторы.ВычислитьПоказательRSISMA(Market, instId, Bar, ТСНачало, ТСЗавершение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьRSIПоСтарому(Команда)
	ОбновитьRSIПоСтаромуНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДеталиСчетаТриМес(Команда)
	ДеталиСчетаТриМесНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДеталиСчетаТриМесНаСервере()
	
	Структура = биг_МаркетАпиКлиентСервер.СтруктураОперации_ПолучитьИсториюДвиженийСчета();
	Структура.НачалоТочкаТС = биг_ОбщегоНазначенияКлиентСервер.ДатуВTimestampСтрока(ГрузитьОтТочки);
	Структура.ТипСчета = 2;
	
	биг_МаркетАпи.ПолучитьИсториюДвиженийСчетаТриМесяца(Account, Структура);
	
КонецПроцедуры

&НаСервере
Процедура ЦенаТикетаНаСервере()
	
	СтруктураОперации = биг_МаркетАпиКлиентСервер.СтруктураОперации_ПолучитьЦену();
	СтруктураОперации.Биржа			= Market;
	СтруктураОперации.ИнструментТип	= instType;
	СтруктураОперации.ИнструментИД	= instId;
	
	Цена = биг_МаркетАпи.ПолучитьЦенуТикета(СтруктураОперации);
	Сообщить(Цена);
	
КонецПроцедуры

&НаКлиенте
Процедура ЦенаТикета(Команда)
	ЦенаТикетаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьМонетыНаСервере()
	
	СтруктураОперации = биг_МаркетАпиКлиентСервер.СтруктураОперации_ЗагрузитьМонеты();
	СтруктураОперации.Биржа = Market;

	биг_МаркетАпи.ЗагрузитьМонеты(СтруктураОперации);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьМонеты(Команда)
	ЗагрузитьМонетыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИсториюОрдеровЗаПериод(Команда)
	ЗагрузитьИсториюОрдеровЗаПериодНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьИсториюОрдеровЗаПериодНаСервере()
	
	ПараметрыЗапроса = биг_МаркетАпиКлиентСервер.СтруктураОперации_ПолучитьИсториюОрдеров();
	ПараметрыЗапроса.Биржа 				= Market;
	ПараметрыЗапроса.Аккаунт 			= Account;
	ПараметрыЗапроса.ИнструментТип		= instType;
	//ПараметрыЗапроса.НачалоТочкаТС 		= биг_ОбщегоНазначенияКлиентСервер.ДатуВTimestampЧисло(НачалоПериода);
	//ПараметрыЗапроса.НачалоТочкаТС 		= биг_ОбщегоНазначенияКлиентСервер.ДатуВTimestampЧисло(ЗавершениеПериода);
	//ПараметрыЗапроса.ЗавершениеТочкаТС	= биг_ОбщегоНазначенияКлиентСервер.ДатуВTimestampЧисло(ЗавершениеПериода);
	//ПараметрыЗапроса.ЗавершениеТочкаТС	= биг_ОбщегоНазначенияКлиентСервер.ДатуВTimestampЧисло(НачалоПериода);
	
	Ответ = биг_МаркетАпи.ПолучитьИсториюОрдеров(Account, ПараметрыЗапроса);
    
КонецПроцедуры



      
 
#КонецОбласти