
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ОтразитьДвижения_РезультатыУправления(Отказ, РежимПроведения);
    ОтразитьДвижения_АккаунтыКРаспределению(Отказ, РежимПроведения);
	ОтразитьДвижения_СебестоимостьАктивов(Отказ, РежимПроведения);
КонецПроцедуры

Процедура ОтразитьДвижения_РезультатыУправления(Отказ, РежимПроведения)
    
	Набор = РегистрыСведений.биг_РезультатыУправления.СоздатьНаборЗаписей();
	Набор.Отбор.Портфель.Установить(Справочники.биг_Портфели.ПустаяСсылка());
	Набор.Отбор.Аккаунт.Установить(Аккаунт);
	Набор.Отбор.Период.Установить(Дата);
	
	Для каждого Строка Из ПортфельКлиента Цикл
		Запись 						= Набор.Добавить();
		Запись.Период 				= Дата;
		Запись.Портфель				= Справочники.биг_Портфели.ПустаяСсылка();
		Запись.Аккаунт				= Аккаунт;
		Запись.Монета				= Строка.Монета;
		Запись.ВалютаОценкиПортфеля	= ВалютаОценкиПортфеля;
		Запись.Количество			= Строка.Количество;
		Запись.Цена					= Строка.КурсКВалютеОценки;
		Запись.Сумма				= Строка.СуммаВВалютеОценки;
	КонецЦикла;                                         
	
	Набор.Записывать = Истина;
	Набор.Записать(Истина);
		
КонецПроцедуры 

Процедура ОтразитьДвижения_АккаунтыКРаспределению(Отказ, РежимПроведения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	big_MarketAccounts.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА биг_АккаунтыКРаспределению.Аккаунт ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОтсутствуетВОчереди,
	|	ВЫБОР
	|		КОГДА биг_УчастникиПортфелейСрезПоследних.Аккаунт ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОтсутствуетВПортфеле
	|ИЗ
	|	Справочник.big_MarketAccounts КАК big_MarketAccounts
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.биг_АккаунтыКРаспределению КАК биг_АккаунтыКРаспределению
	|		ПО (биг_АккаунтыКРаспределению.Аккаунт = big_MarketAccounts.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.биг_УчастникиПортфелей.СрезПоследних КАК биг_УчастникиПортфелейСрезПоследних
	|		ПО (биг_УчастникиПортфелейСрезПоследних.Аккаунт = big_MarketAccounts.Ссылка)
	|ГДЕ
	|	big_MarketAccounts.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Аккаунт);
	ВЫборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Если Выборка.ОтсутствуетВОчереди И Выборка.ОтсутствуетВПортфеле Тогда
		
		Набор = РегистрыСведений.биг_АккаунтыКРаспределению.СоздатьНаборЗаписей();
		Набор.Отбор.Аккаунт.Установить(Аккаунт);
		Запись = Набор.Добавить();
		Запись.Аккаунт	= Аккаунт;
		Запись.ВалютаОценки = ВалютаОценкиПортфеля;
		
		Набор.Записать(Истина);
	КонецЕсли;	
		
КонецПроцедуры

Процедура ОтразитьДвижения_СебестоимостьАктивов(Отказ, РежимПроведения)
	
	Себестоимость = Движения.биг_СебестоимостьАктивов;
	Себестоимость.Очистить();
	Себестоимость.Записывать = Истина;
	
	Блокировка 	= Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.биг_СебестоимостьАктивов");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("Аккаунт", Аккаунт);
	Блокировка.Заблокировать();
	
	Для каждого Строка Из ПортфельКлиента Цикл
		
		МассивСтейблов = биг_ОбщегоНазначенияКлиентСервер.ПолучитьМассивЗначенийПоИмени("Стейблкоин");
		Если МассивСтейблов.Найти(Строка.Монета) = Неопределено Тогда
			Запись = Себестоимость.ДобавитьПриход(); 
			Запись.Период		= Дата;
			Запись.Аккаунт 		= Аккаунт;
			Запись.Монета		= Строка.Монета;
			Запись.Партия		= Ссылка;
			Запись.Количество	= Строка.Количество;
			Запись.Сумма		= Строка.СуммаВВалютеОценки;			
		КонецЕсли;	
	КонецЦикла;	
		
КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	биг_РезультатыУправленияСрезПоследних.Портфель КАК Портфель
		|ИЗ
		|	РегистрСведений.биг_РезультатыУправления.СрезПоследних(, Аккаунт = &Аккаунт) КАК биг_РезультатыУправленияСрезПоследних
		|ГДЕ
		|	биг_РезультатыУправленияСрезПоследних.Портфель <> ЗНАЧЕНИЕ(Справочник.биг_Портфели.ПустаяСсылка)";
		Запрос.УстановитьПараметр("Аккаунт", Аккаунт);
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			Отказ = Истина;
			Сообщить("Отмена проведения не возможна, аккаунт уже включен в портфель");
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры


