#Область Описание
// Класс для работы с универсальными коллекциями
// Данный модуль обеспечивает эмуляцию работы родительского класса УниверсальнаяКоллекция 
// Иерархическая структура класса УниверсальнаяКоллекция:
// УниверсальнаяКоллекция - родительский. Не создаёт экземпляры, доступны только статические методы
//    - УниверсальнаяКоллекцияСервер - дочерний класс. Для работы на сервере и в толстых клиентах. Технически это обработка-объект
//    - УниверсальнаяКоллекцияКлиент - дочерний класс. Для работы в тонких клиентах. Менее производительный. Технически это форма клиентского приложения
//    - ТаблицаЗначений - проектируемый дочерний класс для работы с таблицами значений
//    - Таблицы - проектируемый дочерний класс для работы с разнообразными таблицами во всех контекстах включая: ТаблицаЗначений,ТаблицаФормы,ДинамичесийСписок итд.

#Область Планы

// Планы:
// + Итератор 
// + + Сброс 
// + + Следующий 
// + + ТекКлюч, ТекЗначение 
// + + Шаг итератора 
// + + Обратный шаг итератора 
// + Добавление,Вставка,Удаление
// + Поиск ключа значения
// + Поиск ключей значений
// + Индексирование/оптимизация поиска
// + Выгрузка значений/ключей
// + Загрузка массива значений
// + Фиксация коллекций
// + Снятие фиксации коллекций
// + Копирование коллекций
// -----------------------------------
// Отсечка для первого релиза
// -----------------------------------
// + Поддержка тонкого клиента
// + Комплексные тесты для Сервера и Тонкого клиента
// + Рефакторинг методов с учётом новой архитектуры класса
// -----------------------------------
// Отсечка для второго релиза
// -----------------------------------
// - Поиск по отбору
// - Экспорт в другие коллекции
// - Поддержка таблиц формы
// - Сортировка - ХЗ надо ли
// - Поиск/получение элементов (не ключей) - ХЗ надо ли
//-------------------------------------------------------------
// + !!!Тесты по всем методам!!! 
// + + Итератор
// + + Модификация
// + + Индексирование
// + + Простой поиск
// + + Поиск нескольких/всех
// + + Фиксация
// + + Снятие фиксации
// + + Копирование


#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область УниверсальнаяКоллекцияСтатическиеМетоды

Функция ЭкземплярКлассаУниверсальнаяКоллекция(пОбъект) Экспорт
	
	Если ЭтоЭкземплярКлассаУниверсальнаяКоллекция(пОбъект) Тогда
		Результат = пОбъект;
	Иначе
		#Если ТонкийКлиент Или ВебКлиент Или МобильныйКлиент Или МобильноеПриложениеКлиент Тогда
			Результат = ПолучитьФорму("Обработка.УниверсальнаяКоллекция_бук.Форма.УниверсальнаяКоллекцияКлиент");
		#Иначе
			Результат = Обработки.УниверсальнаяКоллекция_бук.Создать();
		#КонецЕсли
		Результат.Инициализировать(пОбъект);	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭкземплярКлассаТаблицаЗначений(пОбъект) Экспорт
	
	Если ЭтоЭкземплярКлассаУниверсальнаяКоллекция(пОбъект) Тогда
		Результат = пОбъект;
	Иначе
		#Если ТонкийКлиент Или ВебКлиент Или МобильныйКлиент Или МобильноеПриложениеКлиент Тогда
			Контекст = Новый Структура("Тип", Тип("ТаблицаЗначений"));
			ОшибкаТипКоллекцииНеПоддерживаетКонтекст(Контекст);
		#Иначе
			Результат = Обработки.ТаблицаЗначений_бук.Создать();
		#КонецЕсли
		Результат.Инициализировать(пОбъект);	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоЭкземплярКлассаУниверсальнаяКоллекция(пОбъект) Экспорт
	
	ТипВходящихДанных = ТипЗнч(пОбъект);
	#Если ТонкийКлиент Или ВебКлиент Или МобильныйКлиент Или МобильноеПриложениеКлиент Тогда
		Результат = ТипВходящихДанных = Тип("ФормаКлиентскогоПриложения") 
		И пОбъект.ИмяФормы = ИмяКлассаУниверсальнаяКоллекцияКлиент(); 
	#Иначе
		Результат = ТипВходящихДанных = Тип("ОбработкаОбъект.УниверсальнаяКоллекция_бук"); 
	#КонецЕсли
	
	Возврат Результат;

КонецФункции

Функция ЭтоЭкземплярКлассаТаблицаЗначений(пОбъект) Экспорт
	
	ТипВходящихДанных = ТипЗнч(пОбъект);
	#Если ТонкийКлиент Или ВебКлиент Или МобильныйКлиент Или МобильноеПриложениеКлиент Тогда
		Результат = Ложь;  // ТЗ не работает в данном контексте
	#Иначе
		Результат = ТипВходящихДанных = Тип("ОбработкаОбъект.ТаблицаЗначений_бук"); 
	#КонецЕсли
	
	Возврат Результат;

КонецФункции


Функция ИмяКласса() Экспорт
	
	Возврат "УниверсальнаяКоллекция";
	
КонецФункции

Функция ИмяКлассаУниверсальнаяКоллекцияКлиент() Экспорт
	
	ЧастиИмени = Новый Массив;
	ЧастиИмени.Добавить(ИмяКласса());
	ЧастиИмени.Добавить("Клиент");
	Разделитель = "";
	Результат = СтрСоединить(ЧастиИмени, Разделитель);
	
	Возврат Результат;
	
КонецФункции

Функция ШифрПараметрНеПередан() Экспорт
	
	Возврат "UFL_ШифрПараметрНеПередан";

КонецФункции

#КонецОбласти

// Инициализация класса для работы с коллекцией
// Тип коллекции определяется переданными данными
//
// Параметры:
//  
//  пИсточник - Строка,Тип,Массив,Структура,Соответствие,СписокЗначений,ТаблицаЗначений,ФиксированныйМассив,ФиксированнаяСтруктура,ФиксированноеСоответствие - описание коллекции для последующей инициализации
//                Если передана строка, то в ней ожидается наименование коллекции. В данном случае будет создана новая коллекция
//                Передача типа коллекции, также приведёт к созданию новой коллекции
//                Передача непосредственно универсальной коллекции просто инициализирует класс для дальнейшей работы с ней
//  пПараметрыКонструктора - Массив,Структура,Соответствие,Неопределено - Если задано, то передаст параметры для конструктора
//                Используется для инициализации фиксированных коллекций
//                Для списка значений допустима передача массива. В этом случае список будет инициализирован со значениями из массива
//
// Возвращаемое значение:
//   Булево - Истина, если инициализация выполнена успешно
//
Функция Инициализировать(пИсточник, пПараметрыКонструктора = Неопределено) Экспорт
	
	Свойства = Новый Структура;
	Свойства.Вставить("ТипыПоддерживаемыхКоллекций", ТипыПоддерживаемыхКоллекций()); 
	Свойства.Вставить("ПустоеЗначение", Новый УникальныйИдентификатор); 
	Свойства.Вставить("Коллекция", КонструкторКоллекции(пИсточник, пПараметрыКонструктора)); 
	Свойства.Вставить("Тип", ТипЗнч(Свойства.Коллекция)); 
	Свойства.Вставить("Фиксированная", ЭтоТипФиксированнойКоллекции(Свойства.Тип)); 
	Свойства.Вставить("ИзПарыФиксНеФикс", Свойства.Фиксированная Или ЕстьФиксАналог(Свойства.Тип)); 
	Свойства.Вставить("КлючЭтоИндекс", КлючЭтоИндекс(Свойства.Тип)); 
	Свойства.Вставить("ЕстьПолеЗначение", ЕстьПолеЗначение(Свойства.Тип)); 
	Свойства.Вставить("ДоступнаВыгрузкаЗначений", ДоступнаВыгрузкаЗначения(Свойства.Тип)); 
	Свойства.Вставить("ИндексКлючейАктуален", Ложь);
	Свойства.Вставить("КлючиКоллекции", Новый Массив);
	Свойства.Вставить("ЕстьВстроенныйИндекс", ЕстьВстроенныйИндекс(Свойства.Тип)); 
	Свойства.Вставить("ИндексПоиска", Новый Соответствие);
	Свойства.Вставить("ИндексПоискаДоступен", Ложь);
	Свойства.Вставить("ИндексПоискаПоОтбору", Новый Соответствие);
	Свойства.Вставить("ПозицияИтератора", -1);
	Свойства.Вставить("ТекущееЗначение", Свойства.ПустоеЗначение);
	Свойства.Вставить("ТекущийКлюч", Свойства.ПустоеЗначение);
	Свойства.Вставить("ЧислоЗначений", 0);
	Свойства.Вставить("МаксИндекс", 0);
	
	ПриИзмененииКоличества(Свойства, Истина);
	Сбросить(Свойства);
	
	Возврат Свойства;
	
КонецФункции

Процедура ПриИзмененииКоличества(Свойства, пОбновитьКлючи = Ложь)  Экспорт
	
	Сбросить(Свойства);
	
	Свойства.ЧислоЗначений = КоличествоЗначенийКоллекции(Свойства); 
	Свойства.МаксИндекс = Свойства.ЧислоЗначений - 1;
	Свойства.ИндексКлючейАктуален = Ложь;
	Свойства.ИндексПоискаДоступен = Ложь;
	Если пОбновитьКлючи Тогда
		ОбновитьИндексКлючейПриНеобходимости(Свойства);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

#Область Итератор_1_0

// Сбрасывает позицию курсора в начальное положение
// Действие необходимо, чтобы начать перебор элементов после того как он был начат,
// но по какой-либо причине прекращён
//
// Параметры:
//  нет передаваемых параметров
//
Процедура Сбросить(Свойства) Экспорт
	
	Свойства.ПозицияИтератора = -1;
	Свойства.ТекущееЗначение = Свойства.ПустоеЗначение;
	Свойства.ТекущийКлюч = Свойства.ПустоеЗначение;
	
КонецПроцедуры

// Метод итератора коллекции
// Сдвигает позицию итератора на заданный шаг итератора
// При первом вызове позиционирование производится на первый элемент коллекции при положительном шаге итератора
// При первом вызове позиционирование производится на последний элемент коллекции при отрицательном  шаге итератора
//
// Параметры:
//  
//  пШагИтератора - Число - Шаг итератора. Может быть отрицательным. По умолчанию = 1
//
// Возвращаемое значение:
//   Булево - Истина - итератор спозиционировался на следующий элемент. Ложь - следующий элемент отсутствует
//
Функция Следующий(Свойства, пШагИтератора = 1) Экспорт
	
	Если Не Свойства.ИндексКлючейАктуален Тогда
		ОбновитьИндексКлючейПриНеобходимости(Свойства);
	КонецЕсли;
	
	Если ИтераторАктивен(Свойства) Тогда
		Свойства.ПозицияИтератора = Свойства.ПозицияИтератора + пШагИтератора;
	ИначеЕсли пШагИтератора > 0 Тогда
		Свойства.ПозицияИтератора = 0;
	ИначеЕсли пШагИтератора < 0 Тогда
		Свойства.ПозицияИтератора = Свойства.МаксИндекс;
	Иначе
		ОшибкаШагИтератораНеМожетБытьРавенНулю(Свойства);
	КонецЕсли;
	
	
	Если ИтераторАктивен(Свойства) Тогда
		Результат = Истина;
		Свойства.ТекущийКлюч = Свойства.КлючиКоллекции[Свойства.ПозицияИтератора];
		Свойства.ТекущееЗначение = ПолучитьЗначение(Свойства, Свойства.ТекущийКлюч);
	Иначе
		Свойства.ТекущийКлюч = Свойства.ПустоеЗначение;
		Свойства.ТекущееЗначение = Свойства.ПустоеЗначение;
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Получение ключа текущего элемента колллекции
// Для массивов, таблиц итд это будет индекс элемента
// Для структур и соответствий это будет Ключ из пары КлючИЗначение
//
// Параметры:
//  нет передаваемых параметров
//
// Возвращаемое значение:
//   Число,Строка,Произвольный - ключ текущего элемента коллекции
//
Функция Ключ(Свойства) Экспорт
	
	Если ИтераторАктивен(Свойства) Тогда
		Результат = Свойства.ТекущийКлюч;
	Иначе
		ОшибкаОбращениеКЭлементуПриНеактивномИтераторе(Свойства);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Получение значение текущего элемента колллекции
// Для массивов это будет сам элемент, для таблиц строка таблицы,
// для структур, соответствий и списка значений содержимое поля Значение элемента коллекции
// Для структур и соответствий это будет Значение из пары КлючИЗначение
//
// Параметры:
//  нет передаваемых параметров
//
// Возвращаемое значение:
//   Произвольный - значение текущего элемента коллекции
//
Функция Значение(Свойства) Экспорт
	
	Если ИтераторАктивен(Свойства) Тогда
		Результат = Свойства.ТекущееЗначение;
	Иначе
		ОшибкаОбращениеКЭлементуПриНеактивномИтераторе(Свойства);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область Изменение_1_0

// Добавляет элемент в коллекцию
//
// Параметры:
//  
//  пЗначение - Произвольный - Добавляемое значение
//                 Для таблицы либо не обязательно, либо данные заполнения для новой строки
//                 Если данные заполнения будут переданы, то добавляемая строка таблицы будет заполнена из них 
//  пКлюч - Число,Строка,Произвольный - Ключ элемента коллекции
//                 Массив,СписокЗначений,ТаблицаЗначений - не обязательно. Если ключ указан, то производится вставка в позицию ключа
//                 Структура,Соответствие - обязательно, должен быть уникальным.
//
// Возвращаемое значение:
//   Число,Строка,Произвольный - ключ добавленного элемента 
//
Функция Добавить(Свойства, пЗначение = "UFL_ШифрПараметрНеПередан", пКлюч = "UFL_ШифрПараметрНеПередан") Экспорт
	
	Если Свойства.Фиксированная Тогда
		ОшибкаПопыткаМодифицироватьФиксированнуюКоллекцию(Свойства);
	КонецЕсли;

	Ключ = ?(пКлюч = ШифрПараметрНеПередан(), Свойства.ПустоеЗначение, пКлюч);
	Значение = ?(пЗначение = ШифрПараметрНеПередан(), Свойства.ПустоеЗначение, пЗначение);
	
	Результат = ДобавитьЗначениеВКоллекцию(Свойства, пЗначение, Ключ);
	
	Возврат Результат;

КонецФункции

// Производит вставку значения в указанную позицию коллекции
// Реализовано как синтаксический сахар и для совместимости с
// существующим кодом, так как метод Добавить() реализует обе команды и Добавить() и Вставить()
//
// Параметры:
//  
//  пЗначение - Произвольный - вставляемое значение
//                 Для таблицы либо не обязательно, либо данные заполнения для новой строки
//                 Если данные заполнения будут переданы, то вставляемая строка таблицы будет заполнена из них 
//  пКлюч - Число,Строка,Произвольный - Ключ позиции коллекции, куда прпоизводится вставка
//
// Возвращаемое значение:
//   Число,Строка,Произвольный - ключ вставленного элемента 
//
Функция Вставить(Свойства, пКлюч, пЗначение) Экспорт
	
	Если Свойства.Фиксированная Тогда
		ОшибкаПопыткаМодифицироватьФиксированнуюКоллекцию(Свойства);
	КонецЕсли;
	
	Результат = ДобавитьЗначениеВКоллекцию(Свойства, пЗначение, пКлюч);
	
	Возврат Результат;

КонецФункции

// Удалить элемент(ы) с указанным ключом(ами)
//
// Параметры:
//  
//  пКлюч - Массив,Произвольный - ключ(и) удаляемого элемента
//                 Число - числовой ключ(индекс) элемента
//                 Массив - массив ключей
//                 Произвольный - ключ для соответствия
//                 Если будет передан хотя бы один несуществующий ключ, то будет вызвано исключение
//                 Наличие неуникальных ключей допускается
//                 
Процедура Удалить(Свойства, пКлюч) Экспорт
	
	Если Свойства.Фиксированная Тогда
		ОшибкаПопыткаМодифицироватьФиксированнуюКоллекцию(Свойства);
	КонецЕсли;
	
	Если ТипЗнч(пКлюч) = Тип("Массив") Тогда
		КлючиКУдалению = пКлюч;
	Иначе
		КлючиКУдалению = Новый Массив;
		КлючиКУдалению.Добавить(пКлюч);
	КонецЕсли;
	
	УдалитьПоСпискуКлючей(Свойства, КлючиКУдалению);
	
КонецПроцедуры

// Удалить элемент(ы) с указанным значением(ями)
//
// Параметры:
//  
//  пЗначение - Произвольный,Массив - значение или массив значений подлежащих удалению
//  пВсеНайденные - Булево - Истина - удалить все найденные элементы, иначе, только первое найденное
//                 
Процедура УдалитьЗначение(Свойства, пЗначение, пВсеНайденные = Истина) Экспорт
	
	Если Свойства.Фиксированная Тогда
		ОшибкаПопыткаМодифицироватьФиксированнуюКоллекцию(Свойства);
	КонецЕсли;

	Если пВсеНайденные Тогда
		КлючиКУдалению = НайтиВсеПоЗначению(Свойства, пЗначение);
	Иначе
		Ключ = НайтиПоЗначению(Свойства, пЗначение);
		КлючиКУдалению = Новый Массив;
		КлючиКУдалению.Добавить(Ключ);
	КонецЕсли;
	
	УдалитьПоСпискуКлючей(Свойства, КлючиКУдалению);
	
КонецПроцедуры

Процедура Очистить(Свойства) Экспорт
	
	Свойства.Коллекция.Очистить();
	ПриИзмененииКоличества(Свойства, Истина);
	
КонецПроцедуры
	
#КонецОбласти

#Область Индексирование_1_0

// Включение индексации содержимого коллекции для ускорения поиска
// Рекомендации по использованию:
// - Выполнять после того как завершена модификация коллекции, так как процедура индесирования довольно тяжелая
//  ВАЖНО! Вызов метода приводит обнулению прогресса итератора
//
// Параметры:
//  
//  пПараметры - Произвольный - некоторые коллекции требуют передачи параметров для индексирования
//                 ТаблицаЗначений: ожидается Строка или Массив строк являющихся индексом
//                 	ВАЖНО! Если необходимо добавить несколько индексов, то передавать массив строк.
//
Процедура Индексировать(Свойства, пПараметры = Неопределено) Экспорт
	
	ОбновитьИндексПоискаЗначений(Свойства, пПараметры);
	
КонецПроцедуры

// Отключение индексирования и удаление индекса поиска
//
// Параметры:
//  нет передаваемых параметров
//
Процедура УдалитьИндекс(Свойства) Экспорт
	
	ОчиститьИндексПоискаЗначений(Свойства);
	
КонецПроцедуры

#КонецОбласти

#Область ПоискПолучениеДанных_0_85

// Значение элемента коллекции с указанным ключом
//
// Параметры:
//  
//  пКлюч - Число,Строка,Произвольный - Ключ элемента коллекции
//
// Возвращаемое значение:
//   Произвольный - значение элемента коллекции
//
Функция ПолучитьЗначение(Свойства, пКлюч) Экспорт
	
	Результат = ЗначениеЭлементаПоКлючу(Свойства, пКлюч);
	
	Возврат Результат;
	
КонецФункции

// Ключ первого элемента содержащего значение
// При активированном индексаторе поиск будет производиться с использованием индекса
//
// Параметры:
//  
//  пЗначение - Произвольный - значение, которое необходимо найти
//  пПараметрыПоиска - Произвольный - параметры поиска необходимые для некоторых коллекций
//                 ТаблицаЗначений может принимать имена колонок в которых надлежит производить поиск
//  пВыбратьПервые - Число - количество позиций вхождения, которые необходимо вернуть
//                 Если 1 (по умолчанию), то вернётся первый ключ, по которому найдено значение
//                 Если 0 (по умолчанию), то вернутся все ключи, по которым найдено значение. Аналогично методу НайтиВсеПоЗначению()
//
// Возвращаемое значение:
//   Число,Строка,Произвольный - описание возвращаемого значения
//
Функция НайтиПоЗначению(Свойства, пЗначение, пПараметрыПоиска = Неопределено, пВыбратьПервые = 1) Экспорт
	
	Результат = НайтиПоЗначениюВКоллекции(Свойства, пЗначение, пПараметрыПоиска, пВыбратьПервые);
	
	Возврат Результат;
	
КонецФункции

// Массив ключей всех элементов содержащих переданное значение
// При активированном индексаторе поиск будет производиться с использованием индекса
//
// Параметры:
//  
//  пЗначение - Произвольный - значение, которое необходимо найти
//  пПараметрыПоиска - Произвольный - параметры поиска необходимые для некоторых коллекций
//                 ТаблицаЗначений может принимать имена колонок в которых надлежит производить поиск
//
// Возвращаемое значение:
//   Массив - массив ключей элементов, содержащих искомое значение
//
Функция НайтиВсеПоЗначению(Свойства, пЗначение, пПараметрыПоиска = Неопределено) Экспорт
	
	Результат = НайтиПоЗначениюВКоллекции(Свойства, пЗначение, пПараметрыПоиска);
	
	Возврат Результат;
	
КонецФункции

// Все значения коллекции
//
// Параметры:
//
//  пОтбор - Произвольный - В данной версии не поддерживается. 
//                 Находится здесь, чтобы резервировать место в сигнатуре метода
//  пТолькоУникальные - Булево - Если Истина, то будут выгружены только уникальные значения
//
// Возвращаемое значение:
//   Массив - значения коллекции
//
Функция ВыгрузитьЗначения(Свойства, пОтбор = Неопределено, пТолькоУникальные = Ложь) Экспорт
	
	#Область ВыгрузитьЗначения_ПланРабот
	
	// Реализация:
	// 1. Отбор может быть простым как для НайтиСтроки
	// 2. Отбор может быть сложным (UFL-формат)
	// 3. Определять тип отбора автоматически
	// 4. Алгоритм должен вызываться из ВыгрузитьКлючи() и ВыгрузитьЗначения() 
	
	//Мысли:
	// 1 Идея: помещать данные в ТЗ и искать там через компоновщик
	// 1 Минусы:
	// - Не доступно на тонком клиенте
	// - Возможно, слишком большие накладные расходы при однократном поиске
	// 2 Идея: сравнивать по отбору простым перебором значений
	// Тормозной язык явно проиграет при многократном поиске
	
	// Вывод:
	// - Универсальная реализация для тонких клиентов
	// - Отдельная реализация для сервера/толстого клиента
	// - Провести тесты
	
	#КонецОбласти
	
	Если пОтбор = Неопределено Тогда
		Результат = СписокЗначенийКоллекции(Свойства, пТолькоУникальные);
	ИначеЕсли ТаблицаЗначенийПоддерживается() Тогда
		Результат = НайтиЗначенияЧерезКомпоновщик(Свойства, пОтбор, пТолькоУникальные);
	Иначе
		Результат = НайтиЗначенияПоОтбору(Свойства, пОтбор, пТолькоУникальные);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Список всех ключей коллекции
//
// Параметры:
//  нет передаваемых параметров
//
// Возвращаемое значение:
//   Массив - ключи коллекции
//
Функция ВыгрузитьКлючи(Свойства) Экспорт

	Результат = КоллекцииКлиентСервер_бук.СкопироватьМассив(Свойства.КлючиКоллекции);

	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область КопированиеИКонвертация_0_85

// Копирование коллекцию в другую коллекцию аналогичного типа
//
// Параметры:
//  
//  пРекурсивно - Булево - Если истина, то все коллекции содержащиеся в исходной коллекции будут так-же скопированы
//                 Иначе, наличные коллекции попадут в копию родительской коллекции как указатели на исходные
//
// Возвращаемое значение:
//   Массив,Структура,Соответствие,СписокЗначений,ТаблицаЗначений,ФиксированныйМассив,ФиксированнаяСтруктура,ФиксированноеСоответствие - копия коллекции
//
Функция Скопировать(Свойства, пРекурсивно = Истина) Экспорт
	
	Результат = СкопироватьКоллекцию(Свойства, Свойства.Коллекция, пРекурсивно);
	
	Возврат Результат;
	
КонецФункции

// Формирование фиксированной копии универсальной коллекции
//
// Параметры:
//  
//  пРекурсивно - Булево - данные коллекции по возможности будут скопированы и зафиксированы рекурсивно
//
// Возвращаемое значение:
//   ФиксированныйМассив,ФиксированнаяСтруктура,ФиксированноеСоответствие - зафиксированные данные
//
Функция СкопироватьКакЗафиксированныеДанные(Свойства, пРекурсивно = Истина) Экспорт
	
	Если Не Свойства.Фиксированная И Свойства.ИзПарыФиксНеФикс Тогда
		Если пРекурсивно Тогда
			Результат = ЗафиксироватьКоллекциюРекурсивно(Свойства.Коллекция);
		Иначе
			ТипФиксКоллекции = ТипФиксАналогаКоллекции(Свойства.Тип);
			ПараметрыКонструктора = Новый Массив;
			ПараметрыКонструктора.Добавить(Свойства.Коллекция);
			Результат = Новый(ТипФиксКоллекции, ПараметрыКонструктора); 
		КонецЕсли;
	Иначе
		ОшибкаФиксацияКоллекцииНедоступна(Свойства);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Формирование копии фиксированной коллекции без фиксации
//
// Параметры:
//  
//  пРекурсивно - Булево - данные коллекции будут скопированы и по необходимости зафиксированы рекурсивно
//
// Возвращаемое значение:
//   Массив,Структура,Соответствие - не зафиксированные данные
//
Функция СкопироватьКакДанныеБезФиксации(Свойства, пРекурсивно = Истина) Экспорт
	
	Если Свойства.Фиксированная Тогда
		Если пРекурсивно Тогда
			Результат = СнятьФиксациюКоллекцииРекурсивно(Свойства.Коллекция);
		Иначе
			ТипНеФиксКоллекции = ТипНеФиксАналогаКоллекции(Свойства.Тип);
			ПараметрыКонструктора = Новый Массив;
			ПараметрыКонструктора.Добавить(Свойства.Коллекция);
			Результат = Новый(ТипНеФиксКоллекции, ПараметрыКонструктора); 
		КонецЕсли;
	Иначе
		ОшибкаСнятиеФиксацииКоллекцииНедоступно(Свойства);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Массив,Структура,Соответствие,СписокЗначений,ТаблицаЗначений,ФиксированныйМассив,ФиксированнаяСтруктура,ФиксированноеСоответствие
Функция СкопироватьВДругуюКоллекцию(Свойства, пПриемник, пРекурсивно = Истина)
	
	
КонецФункции


#КонецОбласти

#Область Свойства

Функция Указатель(Свойства) Экспорт
	
	Возврат Свойства.Коллекция;
	
КонецФункции

Функция ЭтоФиксированнаяКоллекция(Свойства) Экспорт
	
	Возврат Свойства.Фиксированная;
	
КонецФункции

Функция ТипКоллекции(Свойства) Экспорт
	
	Возврат Свойства.Тип;
	
КонецФункции

Функция Количество(Свойства) Экспорт
	
	Возврат Свойства.Коллекция.Количество();
	
КонецФункции
	
#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область МетодыКласса

Функция СкопироватьКоллекцию(Свойства, пОбъект, пРекурсивно)
	
	Коллекция = ЭкземплярКлассаУниверсальнаяКоллекция(пОбъект);
	      
	Если Не Коллекция.ЭтоФиксированнаяКоллекция() Тогда 
		ТипКопии = Коллекция.ТипКоллекции();
	Иначе
		ТипКопии = ТипНеФиксАналогаКоллекции(Коллекция.ТипКоллекции());
	КонецЕсли;
	КопияКоллекции = ЭкземплярКлассаУниверсальнаяКоллекция(ТипКопии);
	
	Пока Коллекция.Следующий() Цикл
		Значение = СкопироватьЗначение(Свойства, Коллекция.Значение(), пРекурсивно);
		КопияКоллекции.Добавить(Значение, Коллекция.Ключ());
	КонецЦикла;
	
	Результат = КопияКоллекции.Указатель(); 
	Если Коллекция.ЭтоФиксированнаяКоллекция() Тогда
		// данные фикс коллекции копируются в обычной коллекции
		КопияКоллекции = ЭкземплярКлассаУниверсальнаяКоллекция(Результат);
		Результат = КопияКоллекции.СкопироватьКакЗафиксированныеДанные(пРекурсивно);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СкопироватьЗначение(Свойства, пЗначение, пРекурсивно)
	
	Результат = пЗначение;
	ТипЗначенияЭлемента = ТипЗнч(пЗначение);
	Если пРекурсивно Тогда
		Если ТаблицаЗначенийПоддерживается() И ТипЗначенияЭлемента = Тип("ТаблицаЗначений") Тогда
			Результат = ТаблицаЗначений_СкопироватьКоллекцию(Свойства, пЗначение, пРекурсивно);
		ИначеЕсли ЭтоТипПоддерживаемойКоллекции(Свойства, ТипЗначенияЭлемента) Тогда
			Результат = СкопироватьКоллекцию(Свойства, пЗначение, пРекурсивно); 
		КонецЕсли;
	ИначеЕсли ТаблицаЗначенийПоддерживается() И ТипЗначенияЭлемента = Тип("ТаблицаЗначений") Тогда
		Результат = пЗначение.Скопировать();
	ИначеЕсли ЭтоТипФиксированнойКоллекции(ТипЗначенияЭлемента) Тогда
		ФиксКоллекция = ЭкземплярКлассаУниверсальнаяКоллекция(пЗначение);
		Результат = ФиксКоллекция.СкопироватьКакДанныеБезФиксации(пРекурсивно);
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Функция ЗафиксироватьКоллекциюРекурсивно(пОбъект)
	
	Коллекция = ЭкземплярКлассаУниверсальнаяКоллекция(пОбъект);
	ТипКоллекции = Коллекция.ТипКоллекции();
	КопияКоллекции = ЭкземплярКлассаУниверсальнаяКоллекция(ТипКоллекции);
	
	Пока Коллекция.Следующий() Цикл
		Значение = Коллекция.Значение();
		ТипЗначенияЭлемента = ТипЗнч(Значение);
		ТипФиксАналогаЭлемента = ТипФиксАналогаКоллекции(ТипЗначенияЭлемента);
		Если ТипФиксАналогаЭлемента <> Неопределено Тогда
			Значение = ЗафиксироватьКоллекциюРекурсивно(Значение);
		КонецЕсли;
		КопияКоллекции.Добавить(Значение, Коллекция.Ключ());
	КонецЦикла;

	ТипФиксАналога = ТипФиксАналогаКоллекции(ТипКоллекции);
	ПараметрыКонструктора = Новый Массив;
	ПараметрыКонструктора.Добавить(КопияКоллекции.Указатель());
	Результат = Новый(ТипФиксАналога, ПараметрыКонструктора);
	
	Возврат Результат;
	
КонецФункции

Функция СнятьФиксациюКоллекцииРекурсивно(пОбъект)
	
	Коллекция = ЭкземплярКлассаУниверсальнаяКоллекция(пОбъект);
	ТипКоллекции = Коллекция.ТипКоллекции();
	ТипНеФиксАналога = ТипнеФиксАналогаКоллекции(ТипКоллекции);
	КопияКоллекции = ЭкземплярКлассаУниверсальнаяКоллекция(ТипНеФиксАналога);
	
	Пока Коллекция.Следующий() Цикл
		Значение = Коллекция.Значение();
		ТипЗначенияЭлемента = ТипЗнч(Значение);
		ТипНеФиксАналогаЭлемента = ТипНеФиксАналогаКоллекции(ТипЗначенияЭлемента);
		Если ТипНеФиксАналогаЭлемента <> Неопределено Тогда
			Значение = СнятьФиксациюКоллекцииРекурсивно(Значение);
		КонецЕсли;
		КопияКоллекции.Добавить(Значение, Коллекция.Ключ());
	КонецЦикла;
	
	Результат = КопияКоллекции.Указатель();
	
	Возврат Результат;
	
КонецФункции

Функция КонструкторКоллекции(пИсточник, пПараметрыКонструктора)
	
	ЕстьПараметрыКонструктора = Не пПараметрыКонструктора = Неопределено;
	ТипИсточника = ТипЗнч(пИсточник);
	
	Если ТипИсточника = Тип("Строка") Или ТипИсточника = Тип("Тип") Тогда
		Если ЕстьПараметрыКонструктора Тогда
			Параметры = Новый Массив;
			Параметры.Добавить(пПараметрыКонструктора);
			Результат = Новый(пИсточник, Параметры);
		Иначе
			Результат = Новый(пИсточник);
		КонецЕсли;
	Иначе
		Результат = пИсточник;
	КонецЕсли;
	
	Если ЕстьПараметрыКонструктора И ТипЗнч(Результат) = Тип("СписокЗначений") Тогда
		Результат.ЗагрузитьЗначения(пПараметрыКонструктора);
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Процедура ОбновитьИндексПоискаЗначений(Свойства, пПараметры)
	
	Если ТаблицаЗначенийПоддерживается() И Свойства.Тип = Тип("ТаблицаЗначений") Тогда
		ТаблицаЗначений_СоздатьИндекс(Свойства, пПараметры);
	Иначе
		Сбросить(Свойства);
		Пока Следующий(Свойства) Цикл
			ДобавитьЗначениеВПростойИндекс(Свойства, Значение(Свойства), Ключ(Свойства));
		КонецЦикла;
		Сбросить(Свойства);
	КонецЕсли;
	
	Свойства.ИндексПоискаДоступен = Истина;
	
КонецПроцедуры

Процедура ОчиститьИндексПоискаЗначений(Свойства)
	
	Если ТаблицаЗначенийПоддерживается() И Свойства.Тип = Тип("ТаблицаЗначений") Тогда
		Свойства.Коллекция.Индексы.Очистить();
	Иначе
		Свойства.ИндексПоиска.Очистить();
		Свойства.ИндексПоискаПоОтбору.Очистить();
	КонецЕсли;
	
	Свойства.ИндексПоискаДоступен = Ложь;
	
КонецПроцедуры

Процедура ДобавитьЗначениеВПростойИндекс(Свойства, пЗначение, пКлюч)
	
	ТекСодержимое = Свойства.ИндексПоиска[пЗначение];
	Если ТекСодержимое = Неопределено Тогда
		ТекСодержимое = Новый Массив;
		Свойства.ИндексПоиска[пЗначение] = ТекСодержимое;
	КонецЕсли;
	
	ТекСодержимое.Добавить(пКлюч);
	
КонецПроцедуры

Функция НайтиПоЗначениюВИндексе(Свойства, пЗначение, пЧислоЗначений = 0)
	
	ВернутьПервое = пЧислоЗначений = 1;
	БезОграничений = пЧислоЗначений = 0;
	
	Ключи = Свойства.ИндексПоиска[пЗначение];
	Если ЗначениеЗаполнено(Ключи) Тогда
		Если ВернутьПервое Тогда
			Результат = Ключи[0];
		ИначеЕсли БезОграничений Тогда
			Результат = Ключи; 
		Иначе
			Результат = Новый Массив;
			Для Сч = 0 По пЧислоЗначений - 1 Цикл
				Результат.Добавить(Ключи[Сч]);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ИтераторАктивен(Свойства)
	
	Возврат Свойства.ПозицияИтератора >=0 И Свойства.ПозицияИтератора <= Свойства.МаксИндекс;

КонецФункции

Процедура ОбновитьИндексКлючейПриНеобходимости(Свойства)
	
	Если Не Свойства.ИндексКлючейАктуален Тогда
		Свойства.КлючиКоллекции = СписокКлючейКоллекции(Свойства);
		Свойства.ИндексКлючейАктуален = Истина;
	КонецЕсли;

КонецПроцедуры

Функция ТаблицаЗначенийПоддерживается()
	
	#Если Сервер Или МобильноеПриложениеСервер Или ВнешнееСоединение Тогда
		Результат = Истина;
	#ИначеЕсли ТолстыйКлиентУправляемоеПриложение Или ТолстыйКлиентОбычноеПриложение Тогда
		Результат = Истина;
	#Иначе
		Результат = Ложь;
	#КонецЕсли
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоОтборUFL(пОтбор)
	
	
КонецФункции

Функция НайтиЗначенияЧерезКомпоновщик(Свойства, пОтбор, пТолькоУникальные)
	
	// Перед поиском привести отбор к UFL типу
	
	
КонецФункции

Функция НайтиЗначенияПоОтбору(Свойства, пОтбор, пТолькоУникальные)
	
	// Перед поиском привести отбор к UFL типу
	
	
	
КонецФункции




Процедура БроситьИсключение(пТекст)
	
	ЧастиСтроки = Новый Массив;
	ЧастиСтроки.Добавить("Класс: Универсальная коллекция. ");
	ЧастиСтроки.Добавить(пТекст);
	
	ТекстИсключения = СтрСоединить(ЧастиСтроки);
	ВызватьИсключение ТекстИсключения;
	
КонецПроцедуры

Процедура ОшибкаОбращениеКЭлементуПриНеактивномИтераторе(Свойства)
	
	ТекстОшибки = "Итератор коллекции не активирован. Обращение к текущему элементу невозможно";
	БроситьИсключение(ТекстОшибки);
	
КонецПроцедуры

Процедура ОшибкаНеПоддерживаемыйТипКоллекции(Свойства)
	
	ТекстОшибки = "Используется не поддерживаемый тип коллекции " + Свойства.Тип;
	БроситьИсключение(ТекстОшибки);

КонецПроцедуры

Процедура ОшибкаПопыткаМодифицироватьФиксированнуюКоллекцию(Свойства)
	
	ТекстОшибки = "Нельзя модифицировать фиксированную коллекцию " + Свойства.Тип;
	БроситьИсключение(ТекстОшибки);
	
КонецПроцедуры

Процедура ОшибкаКлючНеДолженБытьПустым(Свойства)
	
	ТекстОшибки = "Ключ для данного типа коллекции не должен быть пустым " + Свойства.Тип;
	БроситьИсключение(ТекстОшибки);
	
КонецПроцедуры

Процедура ОшибкаЗначениеНеДолжноБытьПустым(Свойства)
	
	ТекстОшибки = "Значение для данного типа коллекции не должно быть пустым " + Свойства.Тип;
	БроситьИсключение(ТекстОшибки);
	
КонецПроцедуры

Процедура ОшибкаФиксацияКоллекцииНедоступна(Свойства)
	
	ТекстОшибки = "Фиксация коллекции " + Свойства.Тип + " не поддерживается";
	БроситьИсключение(ТекстОшибки);

КонецПроцедуры

Процедура ОшибкаСнятиеФиксацииКоллекцииНедоступно(Свойства)
	
	ТекстОшибки = "Коллекция " + Свойства.Тип + "  не является фиксированной. Снятие фиксации невозможно";
	БроситьИсключение(ТекстОшибки);

КонецПроцедуры

Процедура ОшибкаШагИтератораНеМожетБытьРавенНулю(Свойства)
	
	ТекстОшибки = "Шаг итератора не может быть равен нулю";
	БроситьИсключение(ТекстОшибки);
	
КонецПроцедуры

Процедура ОшибкаТипКоллекцииНеПоддерживаетКонтекст(Свойства)
	
	ТекстОшибки = "Среда исполнения не поддерживает тип коллекции " + Свойства.Тип;
	БроситьИсключение(ТекстОшибки);

КонецПроцедуры


#КонецОбласти

#Область МетодыКоллекций

Функция КоличествоЗначенийКоллекции(Свойства)
	
	Возврат Свойства.Коллекция.Количество();
	
КонецФункции

Функция СписокКлючейКоллекции(Свойства)
	
	Результат = Новый Массив;
	
	Если Свойства.КлючЭтоИндекс Тогда
		Для Сч = 0 По Свойства.МаксИндекс Цикл
			Результат.Добавить(Сч);
		КонецЦикла;
	Иначе // На момент написания это структуры и соответствия
		Для Каждого Элемент Из Свойства.Коллекция Цикл
			Результат.Добавить(Элемент.Ключ);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СписокЗначенийКоллекции(Свойства, пТолькоУникальные)

	Результат = Новый Массив;
	
	Если Свойства.ДоступнаВыгрузкаЗначений Тогда
		Результат = Свойства.Коллекция.ВыгрузитьЗначения();
	ИначеЕсли Свойства.ЕстьПолеЗначение Тогда
		Для Каждого Элемент Из Свойства.Коллекция Цикл
			Результат.Добавить(Элемент.Значение);
		КонецЦикла;
	ИначеЕсли Свойства.Тип = Тип("Массив") Тогда
		Результат = Свойства.Коллекция;
	ИначеЕсли ТаблицаЗначенийПоддерживается() И Свойства.Тип = Тип("ТаблицаЗначений") Тогда
		Результат = Новый Массив;
		Для Каждого ТекСтрока Из Свойства.Коллекция Цикл
			Результат.Добавить(ТекСтрока);
		КонецЦикла;
		
	Иначе
		ОшибкаНеПоддерживаемыйТипКоллекции(Свойства);
	КонецЕсли;
	
	Если пТолькоУникальные Тогда
		// Методы класса здесь ещё недоступны, так как это метод инициализации
		Результат = СкопироватьМассив(Результат, пТолькоУникальные);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЗначениеЭлементаПоКлючу(Свойства, пКлюч)
	
	Результат = Свойства.Коллекция[пКлюч];
	Если Свойства.Тип = Тип("СписокЗначений") Тогда
		Результат = Результат.Значение;
	КонецЕсли;
	
	Возврат Результат;
		
КонецФункции

Процедура УдалитьПоСпискуКлючей(Свойства, пКлючи)
	
	// Числовые ключи отсортируем в убывании, чтобы удалять "с хвоста"
	Если ТипЗнч(пКлючи[0]) = Тип("Число") Тогда
		СортироватьМассив(пКлючи, "Убыв");
	КонецЕсли;
	
	Для Каждого Ключ Из пКлючи Цикл 
		Свойства.Коллекция.Удалить(Ключ);
	КонецЦикла;
	
	ПриИзмененииКоличества(Свойства);

КонецПроцедуры

Функция ТаблицаЗначений_ИменаПолей(пТаблица)
	
	Результат = Новый Массив;
	
	Для Каждого Колонка из пТаблица.Колонки Цикл
		Результат.Добавить(Колонка.Имя);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ТаблицаЗначений_КлючЭлемента(Свойства, пЭлемент)
	
	Если пЭлемент <> Неопределено Тогда
		Результат = Свойства.Коллекция.Индекс(пЭлемент);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ТаблицаЗначений_СоздатьИндекс(Свойства, пПараметры)
	
	ТипПараметра = ТипЗнч(пПараметры);
	Если ТипПараметра = Тип("Строка") Тогда
		Индексы = Новый Массив;
		Индексы.Добавить(пПараметры);
	ИначеЕсли ТипПараметра = Тип("Массив") Тогда
		Индексы = пПараметры;
	Иначе
		ТекстОшибки = "Тип переданного индекса для таблицы значений отличается от ожидаемого. Передан тип: " + ТипПараметра;
		БроситьИсключение(ТекстОшибки);
	КонецЕсли;
	
	Для Каждого ТекИндекс Из Индексы Цикл
		Свойства.Коллекция.Индексы.Добавить(ТекИндекс);
	КонецЦикла;
	
КонецПроцедуры

Функция ТаблицаЗначений_СкопироватьКоллекцию(Свойства, пОбъект, пРекурсивно)
	
	Коллекция = ЭкземплярКлассаУниверсальнаяКоллекция(пОбъект);
	// TODO: 2024.09.23 Сейчас норм, но в будущем подклассе должен быть отдельный метод для копирования структуры без данных
	КопияТаблицы = Коллекция.Указатель().СкопироватьКолонки();
	КопияКоллекции = ЭкземплярКлассаУниверсальнаяКоллекция(КопияТаблицы);
	ПоляТаблицы = ТаблицаЗначений_ИменаПолей(Коллекция.Указатель()); 
	
	Пока Коллекция.Следующий() Цикл
		ДанныеСтроки = Коллекция.Значение();
		Если Не пРекурсивно Тогда
			КопияКоллекции.Добавить(ДанныеСтроки);
		Иначе // обходим каждое поле строки и обрабатываем рекурсивно
			НоваяСтрока = КопияКоллекции.ПолучитьЗначение(КопияКоллекции.Добавить());
			Для Каждого КлючПоля Из ПоляТаблицы Цикл
				Значение = СкопироватьЗначение(Свойства, ДанныеСтроки[КлючПоля], пРекурсивно); 
				НоваяСтрока[КлючПоля] = Значение; 
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Возврат КопияКоллекции.Указатель();
	
КонецФункции

#Область ДобавитьЗначение

Функция ДобавитьЗначениеВКоллекцию(Свойства, пЗначение, пКлюч)
	
	Если Свойства.Тип = Тип("Массив") Тогда
		Результат = Массив_ДобавитьЗначение(Свойства, пЗначение, пКлюч);
	ИначеЕсли Свойства.Тип = Тип("СписокЗначений") Тогда
		Результат = Массив_ДобавитьЗначение(Свойства, пЗначение, пКлюч);
	ИначеЕсли ТаблицаЗначенийПоддерживается() И Свойства.Тип = Тип("ТаблицаЗначений") Тогда
		Результат = ТаблицаЗначений_ДобавитьЗначение(Свойства, пЗначение, пКлюч);
	ИначеЕсли Свойства.Тип = Тип("Структура") Или Свойства.Тип = Тип("Соответствие") Тогда
		Результат = Структура_ДобавитьЗначение(Свойства, пЗначение, пКлюч);
	Иначе
		ОшибкаНеПоддерживаемыйТипКоллекции(Свойства);
	КонецЕсли;
	
	ПриИзмененииКоличества(Свойства);
	
	Возврат Результат;
	
КонецФункции

Функция Массив_ДобавитьЗначение(Свойства, пЗначение, пКлюч)
	
	Если пЗначение = Свойства.ПустоеЗначение Тогда
		ОшибкаЗначениеНеДолжноБытьПустым(Свойства);
	КонецЕсли;
	
	Если пКлюч = Свойства.ПустоеЗначение Тогда
		Свойства.Коллекция.Добавить(пЗначение);
		Результат = Свойства.ЧислоЗначений;
	Иначе
		Свойства.Коллекция.Вставить(пКлюч, пЗначение);
		Результат = пКлюч;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ТаблицаЗначений_ДобавитьЗначение(Свойства, пЗначение, пКлюч)
	
	Если пКлюч = Свойства.ПустоеЗначение Тогда
		СтрокаТаблицы = Свойства.Коллекция.Добавить();
		Результат = Свойства.ЧислоЗначений;
	Иначе
		СтрокаТаблицы = Свойства.Коллекция.Вставить(пКлюч);
		Результат = пКлюч;
	КонецЕсли;
	
	Если Не пЗначение = Свойства.ПустоеЗначение Тогда
		ЗаполнитьЗначенияСвойств(СтрокаТаблицы, пЗначение);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция Структура_ДобавитьЗначение(Свойства, пЗначение, пКлюч)
	
	Если пКлюч = Свойства.ПустоеЗначение Тогда
		ОшибкаКлючНеДолженБытьПустым(Свойства);
	КонецЕсли;
	Если пЗначение = Свойства.ПустоеЗначение Тогда
		ЗначениеКДобавлению = Неопределено;
	Иначе
		ЗначениеКДобавлению = пЗначение;
	КонецЕсли;
	
	Свойства.Коллекция.Вставить(пКлюч, ЗначениеКДобавлению);
	Результат = пКлюч;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область НайтиПоЗначению

Функция НайтиПоЗначениюВКоллекции(Свойства, пЗначение, пПараметрыПоиска, пЧислоЗначений = 0)
	
	ОбновитьИндексКлючейПриНеобходимости(Свойства);
	
	Если Свойства.ИндексПоискаДоступен И Не Свойства.ЕстьВстроенныйИндекс Тогда
		Результат = НайтиПоЗначениюВИндексе(Свойства, пЗначение, пЧислоЗначений);
	Иначе
		Если Свойства.Тип = Тип("Массив") Тогда
			Результат = Массив_НайтиПоЗначению(Свойства, пЗначение, пПараметрыПоиска, пЧислоЗначений);
		ИначеЕсли Свойства.Тип = Тип("СписокЗначений") Тогда
			Результат = СписокЗначений_НайтиПоЗначению(Свойства, пЗначение, пПараметрыПоиска, пЧислоЗначений);
		ИначеЕсли ТаблицаЗначенийПоддерживается() И Свойства.Тип = Тип("ТаблицаЗначений") Тогда
			Результат = ТаблицаЗначений_НайтиПоЗначению(Свойства, пЗначение, пПараметрыПоиска, пЧислоЗначений);
		ИначеЕсли Свойства.Тип = Тип("Структура") Или Свойства.Тип = Тип("Соответствие")
			Или Свойства.Тип = Тип("ФиксированнаяСтруктура") 
			Или Свойства.Тип = Тип("ФиксированноеСоответствие") Тогда
			Результат = Структура_НайтиПоЗначению(Свойства, пЗначение, пПараметрыПоиска, пЧислоЗначений);
		Иначе
			ОшибкаНеПоддерживаемыйТипКоллекции(Свойства);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция Массив_НайтиПоЗначению(Свойства, пЗначение, пПараметрыПоиска, пЧислоЗначений = 0)
	
	ВернутьПервое = пЧислоЗначений = 1;
	
	Если ВернутьПервое Тогда
		Результат = Свойства.Коллекция.Найти(пЗначение);
	Иначе
		БезОграничений = пЧислоЗначений = 0;
		МаксИндекс = ?(БезОграничений, Свойства.МаксИндекс, пЧислоЗначений - 1);
		Результат = Новый Массив;
		Для Сч = 0 По МаксИндекс Цикл
			Если Свойства.Коллекция[Сч] = пЗначение Тогда
				Результат.Добавить(Сч);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СписокЗначений_НайтиПоЗначению(Свойства, пЗначение, пПараметрыПоиска, пЧислоЗначений = 0)
	
	ВернутьПервое = пЧислоЗначений = 1;
	
	Если ВернутьПервое Тогда
		Элемент = Свойства.Коллекция.НайтиПоЗначению(пЗначение);
		Результат = ?(Элемент <> Неопределено, Свойства.Коллекция.Индекс(Элемент), Элемент);
	Иначе
		БезОграничений = пЧислоЗначений = 0;
		МаксИндекс = ?(БезОграничений, Свойства.МаксИндекс, пЧислоЗначений - 1);
		Результат = Новый Массив;
		Для Сч = 0 По МаксИндекс Цикл
			Если Свойства.Коллекция[Сч].Значение = пЗначение Тогда
				Результат.Добавить(Сч);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

Функция ТаблицаЗначений_НайтиПоЗначению(Свойства, пЗначение, пПараметрыПоиска, пЧислоЗначений = 0)
	
	//!!! При нахождении приводим результат к ключу элемента для единой логики работы класса
	
	ИменаПолейСтрокой = ?(ЗначениеЗаполнено(пПараметрыПоиска), пПараметрыПоиска, "");
	ВернутьПервое = пЧислоЗначений = 1;
	// При поиске одиночного значения не заморачиваемся и пользуемся штатным методом
	Если ВернутьПервое Тогда
		Результат =  Свойства.Коллекция.Найти(пЗначение, ИменаПолейСтрокой);
		Возврат ТаблицаЗначений_КлючЭлемента(Свойства, Результат);
	КонецЕсли;
	
	Если Не ПустаяСтрока(ИменаПолейСтрокой) Тогда
		ИменаПолей = СтрРазделить(ИменаПолейСтрокой, ",", Ложь);
	Иначе
		ИменаПолей = ТаблицаЗначений_ИменаПолей(Свойства.Коллекция);
	КонецЕсли;
	
	// Сначала найдём все строки независимо от ожидаемого количества
	УникальныеКлючи = ЭкземплярКлассаУниверсальнаяКоллекция("Соответствие");
 	БезОграничений = пЧислоЗначений = 0;
	Для Каждого ИмяПоля Из ИменаПолей Цикл
		Отбор = Новый Структура(ИмяПоля, пЗначение);
		НайденныеСтроки = Свойства.Коллекция.НайтиСтроки(Отбор);
		Для Каждого ТекСтрока Из НайденныеСтроки Цикл
			УникальныеКлючи.Добавить(,ТаблицаЗначений_КлючЭлемента(Свойства, ТекСтрока));
		КонецЦикла;
	КонецЦикла;
	
	ВсеНайденныеКлючи = УникальныеКлючи.ВыгрузитьКлючи();
	МаксЧисло = ?(БезОграничений, Свойства.ЧислоЗначений, пЧислоЗначений);
	// Если ожидается меньшее число результатов, чем получено, то обрезаем результат
	Если Результат.Количество() <= МаксЧисло Тогда
		Результат = ВсеНайденныеКлючи;
	Иначе
		СортироватьМассив(ВсеНайденныеКлючи);
		Результат = Новый Массив;
		Для Сч = 0 По МаксЧисло - 1 Цикл
			Результат.Добавить(ВсеНайденныеКлючи[Сч]);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция Структура_НайтиПоЗначению(Свойства, пЗначение, пПараметрыПоиска, пЧислоЗначений = 0)
	
	ВернутьПервое = пЧислоЗначений = 1;
	БезОграничений = пЧислоЗначений = 0;
	МаксКоличество = ?(БезОграничений, Свойства.ЧислоЗначений, пЧислоЗначений);
	Результат = ?(ВернутьПервое, Неопределено, Новый Массив);
	
	Сч = 0;
	Для Каждого Элем Из Свойства.Коллекция Цикл
		Если Элем.Значение = пЗначение Тогда
			Если ВернутьПервое Тогда
				Результат = Элем.Ключ;
				Прервать;
			Иначе
				Результат.Добавить(Элем.Ключ);
				Сч = Сч + 1;
				Если Сч = МаксКоличество Тогда
					Прервать;
				КонецЕсли;
			КонецЕсли;	
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ОбщегоНазначения

Процедура СортироватьМассив(пМассив, пНаправление = "ВОЗР")

	КоллекцииКлиентСервер_бук.СортироватьМассив(пМассив, пНаправление);
	
КонецПроцедуры

Функция СкопироватьМассив(пМассив, пТолькоУникальные = Ложь)
	
	Результат = КоллекцииКлиентСервер_бук.СкопироватьМассив(пМассив, пТолькоУникальные);
	
	Возврат Результат;
	
КонецФункции

Функция КлючЭтоИндекс(пТипКоллекции)
	
	КоллекцииСИндексом = Новый Соответствие;
	КоллекцииСИндексом.Вставить(Тип("Массив"), Истина);
	КоллекцииСИндексом.Вставить(Тип("СписокЗначений"), Истина); 
	Если ТаблицаЗначенийПоддерживается() Тогда
		КоллекцииСИндексом.Вставить(Тип("ТаблицаЗначений"), Истина);
	КонецЕсли;
	КоллекцииСИндексом.Вставить(Тип("ФиксированныйМассив"), Истина);
	
	Результат = КоллекцииСИндексом[пТипКоллекции] = Истина; 
	
	Возврат Результат;
	
КонецФункции

Функция ЕстьПолеЗначение(пТипКоллекции)
	
	КоллекцияСПолем = Новый Соответствие;
	КоллекцияСПолем.Вставить(Тип("Структура"), Истина);
	КоллекцияСПолем.Вставить(Тип("Соответствие"), Истина);
	КоллекцияСПолем.Вставить(Тип("СписокЗначений"), Истина);
	КоллекцияСПолем.Вставить(Тип("ФиксированнаяСтруктура"), Истина);
	КоллекцияСПолем.Вставить(Тип("ФиксированноеСоответствие"), Истина);
	
	Результат = КоллекцияСПолем[пТипКоллекции] = Истина; 
	
	Возврат Результат;
	
КонецФункции

Функция ДоступнаВыгрузкаЗначения(пТипКоллекции)
	
	Результат = пТипКоллекции = Тип("СписокЗначений"); 
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоТипФиксированнойКоллекции(пТипКоллекции)
	
	ФиксКоллекции = Новый Соответствие;
	ФиксКоллекции.Вставить(Тип("ФиксированныйМассив"), Истина);
	ФиксКоллекции.Вставить(Тип("ФиксированнаяСтруктура"), Истина);
	ФиксКоллекции.Вставить(Тип("ФиксированноеСоответствие"), Истина);
	
	Результат = ФиксКоллекции[пТипКоллекции] = Истина; 
	
	Возврат Результат;
	
КонецФункции

Функция ЕстьВстроенныйИндекс(пТипКоллекции)
	
	Если ТаблицаЗначенийПоддерживается() И пТипКоллекции = Тип("ТаблицаЗначений") Тогда
		Результат = Истина;
	Иначе
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЕстьФиксАналог(пТипКоллекции)
	
	Результат = ТипФиксАналогаКоллекции(пТипКоллекции) <> Неопределено;
	
	Возврат Результат;
	
КонецФункции

Функция ЕстьНеФиксАналогКоллекции(пТипКоллекции)
	
	Результат = ТипНеФиксАналогаКоллекции(пТипКоллекции) <> Неопределено;
	
	Возврат Результат;
	
КонецФункции

Функция ТипФиксАналогаКоллекции(пТипКоллекции)
	
	Если пТипКоллекции = Тип("Массив") Тогда
		Результат = Тип("ФиксированныйМассив");
	ИначеЕсли пТипКоллекции = Тип("Структура") Тогда
		Результат = Тип("ФиксированнаяСтруктура");
	ИначеЕсли пТипКоллекции = Тип("Соответствие") Тогда
		Результат = Тип("ФиксированноеСоответствие");
	Иначе
		Результат = Неопределено;
	КонецЕсли;
		
	Возврат Результат;

КонецФункции

Функция ТипНеФиксАналогаКоллекции(пТипКоллекции)
	
	Если пТипКоллекции = Тип("ФиксированныйМассив") Тогда
		Результат = Тип("Массив");
	ИначеЕсли пТипКоллекции = Тип("ФиксированнаяСтруктура") Тогда
		Результат = Тип("Структура");
	ИначеЕсли пТипКоллекции = Тип("ФиксированноеСоответствие") Тогда
		Результат = Тип("Соответствие");
	Иначе
		Результат = Неопределено;
	КонецЕсли;
		
	Возврат Результат;

КонецФункции

Функция ЭтоТипПоддерживаемойКоллекции(Свойства, пТипКоллекции)
	
	Результат = Свойства.ТипыПоддерживаемыхКоллекций[пТипКоллекции] <> Неопределено;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область Константы

Функция ИменаПоддерживаемыхКоллекций()
	
	Результат = Новый Соответствие;
	Результат.Вставить("Массив", Истина);
	Результат.Вставить("Структура", Истина);
	Результат.Вставить("Соответствие", Истина);
	Результат.Вставить("СписокЗначений", Истина);
	Если ТаблицаЗначенийПоддерживается() Тогда
		Результат.Вставить("ТаблицаЗначений", Истина); 
	КонецЕсли;
	Результат.Вставить("ФиксированныйМассив", Истина);
	Результат.Вставить("ФиксированнаяСтруктура", Истина);
	Результат.Вставить("ФиксированноеСоответствие", Истина);
	
	Возврат Результат;
	
КонецФункции

Функция ТипыПоддерживаемыхКоллекций()
	
	Результат = Новый Соответствие;
	Для Каждого ИмяКоллекции Из ИменаПоддерживаемыхКоллекций() Цикл 
		Результат.Вставить(Тип(ИмяКоллекции), Истина); 
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

	
#КонецОбласти

#КонецОбласти


