
&НаСервере
Процедура ПодпискаМаркетПрайсНаСервере()
	
	СтруктураПараметров = биг_ВебСокет_КлиентСервер.Опис_МаркетЦены();
	СтруктураПараметров.Операция 	= Перечисления.биг_ВидыОперацийКлиентовВебСокета.subscribe;
	СтруктураПараметров.Слушатель 	= биг_ОКХ_Сервер.Биржа();
	
	МассивАргументов = Новый Массив();
	Аргумент = биг_ВебСокет_КлиентСервер.Опис_МаркетЦеныАргументы();
	Аргумент.ИнструментИД = МаркетПрайс_Инструмент.instId;
	МассивАргументов.Добавить(Аргумент);
	
	СтруктураПараметров.Аргументы = МассивАргументов;
	
	биг_ВебСокет_Сервер.Подпис_МаркетЦены(СтруктураПараметров);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодпискаМаркетПрайс(Команда)
	ПодпискаМаркетПрайсНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПодпискаМаркетПрайсДваНаСервере()
	
	СтруктураПараметров = биг_ВебСокет_КлиентСервер.Опис_МаркетЦены();
	СтруктураПараметров.Операция 	= Перечисления.биг_ВидыОперацийКлиентовВебСокета.subscribe;
	СтруктураПараметров.Слушатель 	= биг_ОКХ_Сервер.Биржа();
	
	МассивАргументов = Новый Массив();
	Аргумент = биг_ВебСокет_КлиентСервер.Опис_МаркетЦеныАргументы();
	Аргумент.ИнструментИД = МаркетПрайс_ИнструментДва.instId;
	МассивАргументов.Добавить(Аргумент);
	
	СтруктураПараметров.Аргументы = МассивАргументов;
	
	биг_ВебСокет_Сервер.Подпис_МаркетЦены(СтруктураПараметров);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодпискаМаркетПрайсДва(Команда)
	ПодпискаМаркетПрайсДваНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОткрытьСоединениеНаСервере()
		
	биг_ВебСокет_Сервер.СоздатьКлиентовИСессии_Паблик(биг_ОКХ_Сервер.Биржа());
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСоединение(Команда)
	ОткрытьСоединениеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗакрытьСоединениеНаСервере()
	
	Клиент = WebSocketКлиенты.НайтиПредопределенный(Метаданные.WebSocketКлиенты.биг_ОКХ_WS_Паблик);
	биг_ОКХ_ВебСокет_Сервер.ЗакрытьСессиюСлушателя(биг_ОКХ_Сервер.Биржа(), Клиент);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьСоединение(Команда)
	ЗакрытьСоединениеНаСервере();
КонецПроцедуры

&НаСервере
Процедура Подписка_ОбновлениеОрдеров_Акк1НаСервере()
	
	СтруктураПараметров = биг_ВебСокет_КлиентСервер.Опис_ИзмененияОрдеров();
	СтруктураПараметров.Операция 	= Перечисления.биг_ВидыОперацийКлиентовВебСокета.subscribe;
	СтруктураПараметров.Слушатель 	= ОбновлениеОрдеров_Аккаунт1;
	
	МассивАргументов = Новый Массив();
	Аргумент = биг_ВебСокет_КлиентСервер.Опис_ИзмененияОрдеров_Аргументы();
	Аргумент.ИнструментТип = "SPOT";
	МассивАргументов.Добавить(Аргумент);
	
	СтруктураПараметров.Аргументы = МассивАргументов;
	
	биг_ВебСокет_Сервер.Подпис_ИзмененияОрдеров(СтруктураПараметров);
	
КонецПроцедуры

&НаКлиенте
Процедура Подписка_ОбновлениеОрдеров_Акк1(Команда)
	Подписка_ОбновлениеОрдеров_Акк1НаСервере();
КонецПроцедуры

&НаСервере
Процедура Подписка_ОбновлениеОрдеров_Акк2НаСервере()
	
	СтруктураПараметров = биг_ВебСокет_КлиентСервер.Опис_ИзмененияОрдеров();
	СтруктураПараметров.Операция 	= Перечисления.биг_ВидыОперацийКлиентовВебСокета.subscribe;
	СтруктураПараметров.Слушатель 	= ОбновлениеОрдеров_Аккаунт2;
	
	МассивАргументов = Новый Массив();
	Аргумент = биг_ВебСокет_КлиентСервер.Опис_ИзмененияОрдеров_Аргументы();
	Аргумент.ИнструментТип = "SPOT";
	МассивАргументов.Добавить(Аргумент);
	
	СтруктураПараметров.Аргументы = МассивАргументов;
	
	биг_ВебСокет_Сервер.Подпис_ИзмененияОрдеров(СтруктураПараметров);
	
КонецПроцедуры

&НаКлиенте
Процедура Подписка_ОбновлениеОрдеров_Акк2(Команда)
	Подписка_ОбновлениеОрдеров_Акк2НаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновлениеОрдеров_Соединение_1НаСервере()
		
	биг_ВебСокет_Сервер.СоздатьКлиентовИСессии_Приват(ОбновлениеОрдеров_Аккаунт1);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеОрдеров_Соединение_1(Команда)
	ОбновлениеОрдеров_Соединение_1НаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновлениеОрдеров_ЗакрытьСоединение_1НаСервере()
	Клиент = WebSocketКлиенты.НайтиПредопределенный(Метаданные.WebSocketКлиенты.биг_ОКХ_WS_Приват_Демо);
	биг_ОКХ_ВебСокет_Сервер.ЗакрытьСессиюСлушателя(ОбновлениеОрдеров_Аккаунт1, Клиент);
КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеОрдеров_ЗакрытьСоединение_1(Команда)
	ОбновлениеОрдеров_ЗакрытьСоединение_1НаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновлениеОрдеров_Соединение_2НаСервере()
	
	биг_ВебСокет_Сервер.СоздатьКлиентовИСессии_Приват(ОбновлениеОрдеров_Аккаунт2);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеОрдеров_Соединение_2(Команда)
	ОбновлениеОрдеров_Соединение_2НаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновлениеОрдеров_ЗакрытьСоединение_2НаСервере()
	Клиент = WebSocketКлиенты.НайтиПредопределенный(Метаданные.WebSocketКлиенты.биг_ОКХ_WS_Приват_Демо);
	биг_ОКХ_ВебСокет_Сервер.ЗакрытьСессиюСлушателя(ОбновлениеОрдеров_Аккаунт2, Клиент);
КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеОрдеров_ЗакрытьСоединение_2(Команда)
	ОбновлениеОрдеров_ЗакрытьСоединение_2НаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗапуститьПоддержкуВебСокетаНаСервере()
	
	биг_ВебСокет_Сервер.МенеджерЗапускаИПоддержанияСоединений();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьПоддержкуВебСокета(Команда)
	ЗапуститьПоддержкуВебСокетаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗакрытьВсеВебСокетыНаСервере()
	
	Соединения = WebSocketКлиентСоединения.ПолучитьСоединения();
	Для каждого Соединение Из Соединения Цикл
		Соединение.Закрыть();
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьВсеВебСокеты(Команда)
	ЗакрытьВсеВебСокетыНаСервере();
КонецПроцедуры
