
Функция ПолучитьДанныеСвечейПоТочке(Биржа, ИнструментИД, Бар, ТочкаВремениТС_НачалоПериода, ТочкаВремениТС_ЗавершениеПериода, 
									КоличествоСвечей, ИсключаяПереданнуюТочку, ТолькоЗавершенные, ОграничениеПериода, СортировкаПоУбыванию, ВыбратьПервые) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ %Условие_Первые%
	|	биг_ДанныеСвечей.Биржа КАК Биржа,
	|	биг_ДанныеСвечей.ИнструментИД КАК ИнструментИД,
	|	биг_ДанныеСвечей.Бар КАК Бар,
	|	биг_ДанныеСвечей.TimeStamp КАК TimeStamp,
	|	биг_ДанныеСвечей.TimeStamp13 КАК TimeStamp13,
	|	биг_ДанныеСвечей.TimeStamp10 КАК TimeStamp10,
	|	биг_ДанныеСвечей.ДатаОткрытия КАК ДатаОткрытия,
	|	биг_ДанныеСвечей.ЦенаОткрытия КАК ЦенаОткрытия,
	|	биг_ДанныеСвечей.ЦенаМаксимум КАК ЦенаМаксимум,
	|	биг_ДанныеСвечей.ЦенаМинимум КАК ЦенаМинимум,
	|	биг_ДанныеСвечей.ЦенаЗакрытия КАК ЦенаЗакрытия,
	|	биг_ДанныеСвечей.Объем КАК Объем,
	|	биг_ДанныеСвечей.volCcy КАК volCcy,
	|	биг_ДанныеСвечей.volCcyQuote КАК volCcyQuote,
	|	биг_ДанныеСвечей.confirm КАК confirm
	|ИЗ
	|	РегистрСведений.биг_ДанныеСвечей КАК биг_ДанныеСвечей
	|ГДЕ
	|	биг_ДанныеСвечей.Биржа = &Биржа
	|	И биг_ДанныеСвечей.ИнструментИД = &ИнструментИД
	|	И биг_ДанныеСвечей.Бар = &Бар
	|	И биг_ДанныеСвечей.TimeStamp МЕЖДУ &НачалоПериода И &ЗавершениеПериода
	|	%УсловиеТолькоЗавершенная%	
	|	И биг_ДанныеСвечей.TimeStamp <= &ОграничениеПериода
	|УПОРЯДОЧИТЬ ПО
	|	TimeStamp %УсловиеСортировки%";
		
	ПараметрыЗапроса = биг_ОбщегоНазначения.ПолучитьСтруктуруПараметровЗапросаДанныхПоСвечам();
	ПараметрыЗапроса.Биржа 								= Биржа ;
	ПараметрыЗапроса.ИнструментИД 						= ИнструментИД;
	ПараметрыЗапроса.Бар 								= Бар;
	ПараметрыЗапроса.ТочкаВремениТС_НачалоПериода 		= ТочкаВремениТС_НачалоПериода;
	ПараметрыЗапроса.ТочкаВремениТС_ЗавершениеПериода 	= ТочкаВремениТС_ЗавершениеПериода;
	ПараметрыЗапроса.КоличествоСвечей 					= КоличествоСвечей;
	ПараметрыЗапроса.ИсключаяПереданнуюТочку 			= ИсключаяПереданнуюТочку;
	ПараметрыЗапроса.ТолькоЗавершенные 					= ТолькоЗавершенные;
	ПараметрыЗапроса.ОграничениеПериода 				= ОграничениеПериода;
	ПараметрыЗапроса.СортировкаПоУбыванию 				= СортировкаПоУбыванию;
	ПараметрыЗапроса.ВыбратьПервые 						= ВыбратьПервые;
	
	биг_ОбщегоНазначения.ПолучитьДанныеСвечейПоТочке_УстановитьПараметрыЗапроса(Запрос, ПараметрыЗапроса);
	
	ДанныеСвечей = Запрос.Выполнить().Выгрузить();
	
	Возврат ДанныеСвечей;
	
КонецФункции


// Описание:
//
//
// Параметры (название, тип, дифференцированное значение)
//
// Возвращаемое значение: 
//
Функция ДетальнаяИнформацияОСвече(Биржа, ИнструментИД, Бар, TimeStamp) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	биг_ДанныеСвечей.Биржа КАК Биржа,
	|	биг_ДанныеСвечей.ИнструментИД КАК ИнструментИД,
	|	биг_ДанныеСвечей.Бар КАК Бар,
	|	биг_ДанныеСвечей.TimeStamp КАК TimeStamp,
	|	биг_ДанныеСвечей.TimeStamp13 КАК TimeStamp13,
	|	биг_ДанныеСвечей.TimeStamp10 КАК TimeStamp10,
	|	биг_ДанныеСвечей.ДатаОткрытия КАК ДатаОткрытия,
	|	биг_ДанныеСвечей.ЦенаОткрытия КАК ЦенаОткрытия,
	|	биг_ДанныеСвечей.ЦенаМаксимум КАК ЦенаМаксимум,
	|	биг_ДанныеСвечей.ЦенаМинимум КАК ЦенаМинимум,
	|	биг_ДанныеСвечей.ЦенаЗакрытия КАК ЦенаЗакрытия,
	|	биг_ДанныеСвечей.Объем КАК Объем,
	|	биг_ДанныеСвечей.volCcy КАК volCcy,
	|	биг_ДанныеСвечей.volCcyQuote КАК volCcyQuote,
	|	биг_ДанныеСвечей.confirm КАК confirm
	|ИЗ
	|	РегистрСведений.биг_ДанныеСвечей КАК биг_ДанныеСвечей
	|ГДЕ
	|	биг_ДанныеСвечей.Биржа = &Биржа
	|	И биг_ДанныеСвечей.ИнструментИД = &ИнструментИД
	|	И биг_ДанныеСвечей.Бар = &Бар
	|	И биг_ДанныеСвечей.TimeStamp = &TimeStamp";
	
	Запрос.УстановитьПараметр("Биржа", 		Биржа);
	Запрос.УстановитьПараметр("ИнструментИД", ИнструментИД);
	Запрос.УстановитьПараметр("Бар", 		Бар);
	Запрос.УстановитьПараметр("TimeStamp", 	TimeStamp);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Свеча = биг_ОбщегоНазначенияКлиентСервер.ОписаниеСвечи();
	ЗаполнитьЗначенияСвойств(Свеча, Выборка);
	
	Возврат Свеча;
	
КонецФункции 

Функция ПолучитьЗначениеПоИмениСервер(Имя, СообщитьОбОтсутствии = Истина, ЗначениеПоУмолчанию = Неопределено) Экспорт
	
	Возврат биг_ОбщегоНазначения.ПолучитьЗначениеПоИмениСервер(Имя, СообщитьОбОтсутствии, ЗначениеПоУмолчанию);
	
КонецФункции  

Функция ПолучитьМассивЗначенийПоИмени(Имя, СообщитьОбОтсутствии = Истина, ЗначениеПоУмолчанию = Неопределено) Экспорт

	Возврат биг_ОбщегоНазначения.ПолучитьМассивЗначенийПоИмени(Имя, СообщитьОбОтсутствии, ЗначениеПоУмолчанию);
	
КонецФункции