
Функция ЗначениеУровняПоИмени(НаименованиеКонтрольногоУровня, НастройкаСтратегии) Экспорт
	
	Значение = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	биг_ЗначенияКонтрольныхУровней.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.биг_ЗначенияКонтрольныхУровней КАК биг_ЗначенияКонтрольныхУровней
	|ГДЕ
	|	биг_ЗначенияКонтрольныхУровней.КонтрольныйУровень.Наименование = &НаименованиеКонтрольногоУровня
	|	И биг_ЗначенияКонтрольныхУровней.НастройкаСтратегии = &НастройкаСтратегии";
	
	Запрос.УстановитьПараметр("НаименованиеКонтрольногоУровня", НаименованиеКонтрольногоУровня);
	Запрос.УстановитьПараметр("НастройкаСтратегии", 			НастройкаСтратегии);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		Значение = Выборка.Значение;
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции 

Функция ЗаписатьЗначениеКонтрольногоУровня(НаименованиеКонтрольногоУровня, Бар, Значение) Экспорт

	Запись 						= РегистрыСведений.биг_ЗначенияКонтрольныхУровней.СоздатьМенеджерЗаписи();
	Запись.КонтрольныйУровень 	= Справочники.big_КонтрольныеУровни.НайтиПоНаименованию(НаименованиеКонтрольногоУровня, Истина); 
	Запись.Бар					= Бар;
	Запись.Значение				= Значение;
	
	Запись.Записать(Истина);
	
КонецФункции



