
#Область ПрограммныйИнтерфейс

// Получает список обработчиков сообщений, которые обрабатывает данная информационная система.
// @skip-warning ПустойМетод - переопределяемый метод.
// 
// Параметры:
//  Обработчики - ТаблицаЗначений - с колонками:
//    * Канал - Строка - Канал сообщения.
//    * Обработчик - ОбщийМодуль - Обработчик сообщения.
//
Процедура ПолучитьОбработчикиКаналовСообщений(Обработчики) Экспорт	
КонецПроцедуры

// Обработчик получения динамического списка конечных точек сообщений.
// @skip-warning ПустойМетод - переопределяемый метод.
//
// Параметры:
//  КаналСообщений - Строка - Идентификатор канала сообщений, для которого необходимо определить 
//   конечные точки.
//  Получатели - Массив - Массив конечных точек, в которые следует адресовать сообщение,
//                            должен быть заполнен элементами типа ПланОбменаСсылка.ОбменСообщениями.
//                            Этот параметр необходимо определить в теле обработчика.
//
Процедура ПолучателиСообщения(Знач КаналСообщений, Получатели) Экспорт
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий отправки и получения сообщений.

// Обработчик события при отправке сообщения.
// Обработчик данного события вызывается перед помещением сообщения в XML-поток.
// Обработчик вызывается для каждого отправляемого сообщения.
// @skip-warning ПустойМетод - переопределяемый метод.
//
// Параметры:
//  КаналСообщений - Строка - Идентификатор канала сообщений, в который отправляется сообщение.
//  ТелоСообщения - Произвольный - Тело отправляемого сообщения. В обработчике события тело сообщения
//                                может быть изменено, например, дополнено информацией.
//
Процедура ПриОтправкеСообщения(КаналСообщений, ТелоСообщения) Экспорт	
КонецПроцедуры

// Обработчик события при получении сообщения.
// Обработчик данного события вызывается при получении сообщения из XML-потока.
// Обработчик вызывается для каждого получаемого сообщения.
// @skip-warning ПустойМетод - переопределяемый метод.
//
// Параметры:
//  КаналСообщений - Строка - Идентификатор канала сообщений, из которого получено сообщение.
//  ТелоСообщения - Произвольный - Тело полученного сообщения. В обработчике события тело сообщения
//                                 может быть изменено, например, дополнено информацией.
//
Процедура ПриПолученииСообщения(КаналСообщений, ТелоСообщения) Экспорт	
КонецПроцедуры

// см. ОбменСообщениямиВнутренний.ПриИсчерпанииПопытокОбработкиСообщения
// @skip-check module-empty-method - особенность реализации.
Процедура ПриИсчерпанииПопытокОбработкиСообщения(КаналСообщений, ТелоСообщения, Отправитель, ПодробноеПредставлениеОшибки) Экспорт
КонецПроцедуры

#КонецОбласти
