#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Загружает настройки пользователей информационной базы.
//
// Параметры:
//	Контейнер - ОбработкаОбъект.ВыгрузкаЗагрузкаДанныхМенеджерКонтейнера - менеджер
//		контейнера, используемый в процессе выгрузи данных. Подробнее см. комментарий
//		к программному интерфейсу обработки ВыгрузкаЗагрузкаДанныхМенеджерКонтейнера.
//	Обработчики - ОбработкаОбъектИмяОбработки
//	ПотокЗаменыСсылок - ОбработкаОбъект.ВыгрузкаЗагрузкаДанныхПотокЗаменыСсылок
//  ЗаменитьПользователяВНастройках - Соответствие - соответствие старого и нового имени пользователя ИБ.
//
Процедура ЗагрузитьНастройкиПользователейИнформационнойБазы(Контейнер, Обработчики, ПотокЗаменыСсылок, 
	ЗаменитьПользователяВНастройках = Неопределено) Экспорт
	
	ТипыХранилищ = ВыгрузкаЗагрузкаДанныхСлужебный.ТипыСтандартныхХранилищНастроек();
	
	Для Каждого ТипХранилища Из ТипыХранилищ Цикл
		
		МенеджерЗагрузки = Создать();
		МенеджерЗагрузки.Инициализировать(Контейнер, ТипХранилища, Обработчики, ПотокЗаменыСсылок);
		МенеджерЗагрузки.ЗагрузитьДанные(ЗаменитьПользователяВНастройках);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
