
#Область ПрограммныйИнтерфейс

// При добавлении обработчиков оповещений пользователей БТС.
// @skip-warning ПустойМетод - особенность реализации.
// 
// Параметры:
//  ОбработчикиОповещений - Соответствие - Ключ, идентификатор вида оповещения,
//  	Значение, клиентский модуль содержащий метод ОбработатьОповещение 
//  	с параметром ОповещениеПользователя. Метод данного модуля будет вызван при получении оповещения
//  	с указаным идентификатором вида оповещения.
//  	
// Пример:
//  МодульОбработчиков = ОбщегоНазначенияКлиент.ОбщийМодуль("ОповещениеПользователейОНовостях");
//  ОбработчикиОповещений.Вставить(
//		"ОповещениеОНовыхНовостяхСайта",
//		МодульОбработчиков);
//		
//  Модуль ОповещениеПользователейОНовостях содержит следующий код:
//		Процедура ОбработатьОповещение(ОповещениеПользователя) Экспорт
//	
//			Если ОповещениеПользователя.ВидОповещения = "ОповещениеОНовыхНовостяхСайта" Тогда
//				ОбработатьНовыеНовостиССайта(ОповещениеПользователя); - процедура реализующая логику обработки
//			КонецЕсли;
//			
//		КонецПроцедуры.
//		
Процедура ПриДобавленииОбработчиковОповещенийПользователейБТС(ОбработчикиОповещений) Экспорт 
КонецПроцедуры

#КонецОбласти