

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// передать стратегию
	// по ней отобрать все ключевые уровни и заполнить таблицу (Только те, у которых есть краткое представление)
	// в будущем Мин-Макс не плохо бы хранить сразу в ключевых уровнях
	Если Параметры.Свойство("Стратегия") Тогда
		Стратегия = Параметры.Стратегия;
		ЗаполнитьКлючевыеУровниСтратегии();
	КонецЕсли;
		
	// в таблице устанвливаем интересуемый интервал
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВыводитьВсеПриИзменении(Элемент)
	
	ЗаполнитьКлючевыеУровниСтратегии()
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПодобратьКлюч(Команда)
	
	СоздатьНедостающиеКлючиНаСервере();
	
	МассивКлючей = ПодобратьКлючНаСервере();
	ЭтаФорма.Закрыть(МассивКлючей);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоКлючу(Команда)
	
	Ключ = Неопределено;
	Оповещение = Новый ОписаниеОповещения("ВыборКлючаЗавершение", ЭтаФорма);
	
	ПоказатьВводЗначения(Оповещение, Ключ, , Тип("СправочникСсылка.биг_КлючиНастроекСтратегии"));	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПодобратьКлючНаСервере()
	
	// динамически формируем запрос.
	// блок условий ГДЕ (по три условия на строку ТЧ)
		
	Запрос = Новый Запрос;
	Текст = 
	"ВЫБРАТЬ
	|	биг_ЗначенияКонтрольныхУровней.НастройкаСтратегии КАК НастройкаСтратегии,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ биг_ЗначенияКонтрольныхУровней.КонтрольныйУровень) КАК КонтрольныйУровень
	|ИЗ
	|	РегистрСведений.биг_ЗначенияКонтрольныхУровней КАК биг_ЗначенияКонтрольныхУровней
	|ГДЕ";
	
	Сч = 0;
	Для каждого Строка Из ТаблицаПараметров Цикл
		
		Текст = Текст + "
		|";
		Сч = Сч+1;
		Если Сч <> 1 Тогда
			Текст = Текст + "ИЛИ ";	
		КонецЕсли;       
		
		Текст = Текст + "(биг_ЗначенияКонтрольныхУровней.КонтрольныйУровень = &" + Строка.Наименование + "
			| И (биг_ЗначенияКонтрольныхУровней.Значение МЕЖДУ &" + Строка.Наименование + "_Мин И &" + Строка.Наименование + "_Макс))"; 
	КонецЦикла;
	
	Текст = Текст + "
			| СГРУППИРОВАТЬ ПО
			|	биг_ЗначенияКонтрольныхУровней.НастройкаСтратегии
			|ИМЕЮЩИЕ
			| КОЛИЧЕСТВО(РАЗЛИЧНЫЕ биг_ЗначенияКонтрольныхУровней.КонтрольныйУровень) = " + ТаблицаПараметров.Количество();
	
	Запрос.Текст = Текст;
	
	// в цикле устанавливаем значения параметров запроса. названия параметров должно совпадать с названием ключуровня (&КлючУровеньАБВ)
	Для каждого Строка Из ТаблицаПараметров Цикл
		
		Запрос.УстановитьПараметр(Строка.Наименование, 				Строка.КонтрольныйУровень);
		Запрос.УстановитьПараметр(Строка.Наименование + "_Мин", 	Строка.ЗначениеМинимум);
		Запрос.УстановитьПараметр(Строка.Наименование + "_Макс", 	Строка.ЗначениеМаксимум);		
	КонецЦикла;
	
	МассивКлючей = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("НастройкаСтратегии");
	
	Возврат МассивКлючей;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьКлючевыеУровниСтратегии()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	big_КонтрольныеУровни.Ссылка КАК КонтрольныйУровень,
	|	big_КонтрольныеУровни.Наименование КАК Наименование,
	|	big_КонтрольныеУровни.ЗначениеПоУмолчанию КАК ЗначениеМинимум,
	|	big_КонтрольныеУровни.ЗначениеПоУмолчанию КАК ЗначениеМаксимум,
	|	big_КонтрольныеУровни.ЗначениеПоУмолчанию КАК ТекущееЗначение,
	|	big_КонтрольныеУровни.КраткоеПредставление КАК КраткоеПредставление
	|ИЗ
	|	Справочник.big_КонтрольныеУровни КАК big_КонтрольныеУровни
	|ГДЕ
	|	НЕ big_КонтрольныеУровни.ПометкаУдаления
	|	И big_КонтрольныеУровни.Владелец = &Стратегия
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";
	Запрос.УстановитьПараметр("Стратегия", Стратегия);
	
	ТаблицаПараметров.Очистить();
	ТаблицаПараметров.Загрузить(Запрос.Выполнить().Выгрузить());	
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПараметровМинимумПриИзменении(Элемент)
	
	ТекДанные = Элементы.ТаблицаПараметров.ТекущиеДанные;
	Если НЕ ЗначениеЗаполнено(ТекДанные.ЗначениеМаксимум) Тогда
		ТекДанные.ЗначениеМаксимум = ТекДанные.ЗначениеМинимум;	
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура ВыборКлючаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		ВыборКлючаЗавершениеНаСервере(Результат);		
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВыборКлючаЗавершениеНаСервере(Результат)
	
	ТаблицаПараметров.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	биг_ЗначенияКонтрольныхУровней.КонтрольныйУровень КАК КонтрольныйУровень,
	|	биг_ЗначенияКонтрольныхУровней.Значение КАК ЗначениеМинимум,
	|	биг_ЗначенияКонтрольныхУровней.Значение КАК ЗначениеМаксимум,
	|	биг_ЗначенияКонтрольныхУровней.Значение КАК ТекущееЗначение,
	|	биг_ЗначенияКонтрольныхУровней.КонтрольныйУровень.Наименование КАК Наименование,
	|	биг_ЗначенияКонтрольныхУровней.КонтрольныйУровень.КраткоеПредставление КАК КраткоеПредставление
	|ИЗ
	|	РегистрСведений.биг_ЗначенияКонтрольныхУровней КАК биг_ЗначенияКонтрольныхУровней
	|ГДЕ
	|	биг_ЗначенияКонтрольныхУровней.НастройкаСтратегии = &НастройкаСтратегии
	|	И биг_ЗначенияКонтрольныхУровней.КонтрольныйУровень.Владелец = &Стратегия
	|	И биг_ЗначенияКонтрольныхУровней.КонтрольныйУровень.КраткоеПредставление <> """"
	|	И НЕ биг_ЗначенияКонтрольныхУровней.КонтрольныйУровень.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";
	Запрос.УстановитьПараметр("Стратегия", Стратегия);
	Запрос.УстановитьПараметр("НастройкаСтратегии", Результат);
	
	ТаблицаПараметров.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаСервере
Процедура СоздатьНедостающиеКлючиНаСервере()
	
	ГенераторКлючей = Обработки.биг_МастерГрупповогоСозданияНастроек.Создать();
	ГенераторКлючей.ЗначенияКонтрольныхУровней.Загрузить(ТаблицаПараметров.Выгрузить());
	ГенераторКлючей.Стратегия = Стратегия;
	ГенераторКлючей.СформироватьКомбинации();
	
КонецПроцедуры



#КонецОбласти



