

// код вычисления индикаторов реализован в общих модулях "ta" и "math"
// модули одноименные с объектами из PineScript (https://www.tradingview.com/pine-script-docs/welcome/ ; https://www.tradingview.com/pine-script-reference/v5/)
// код показателя берется с главной страницы:
// добавить индикатор, список объектов, ПКМ - показать исходный код.

// Названия многих параметров на английском, что не по стандартам 1С, но это нужно для облегчения "состыковки" кода 1С с кодом PineScript

// TODO: вообще бы не хранить бы индикаторы, а вычислять. Это решит проблему с указанием источника для "сложных" индикаторов
// когда последовательно применяются различные вычисления к данным (не понятно как хранить результат)
// однако в таком случае нужно дописывать более сложную логику сбора данных, ведь если нужно рассчитать индикаторы на 70 свечей с длинной 20, 
// то к имеющимся 70 нужно получить еще 20 слева, а после вычислений их удалить (вернуть исходную таблиу с добавленными индикаторами)
// но пока таких индикаторов нет - используем простую модель

#Область ПрограммныйИнтерфейс

// Индикатор_1 и Индикатор_2 применяются последовательно к данным, т.е. Индикатор_2 обрабатывает результаты вычислений Индикатора_1
Процедура ВычислитьПоказатель(Биржа, ИнструментИД, Бар, Индикатор_1, ПараметрИндикатора_1, Индикатор_2 = Неопределено, ПараметрИндикатора_2 = Неопределено, ИсточникДанных, НачалоПериодаТС = 0, ЗавершениеПериодаТС = 9999999999) Экспорт
	
	Если ОшибкаВходныхПараметров(Биржа, ИнструментИД, Бар) Тогда
		ВызватьИсключение "Ошибка входных параметров";	
	КонецЕсли;
	
	ДанныеСвечей 			= ПолучитьДанныеСвечей(Биржа, ИнструментИД, Бар, НачалоПериодаТС, ЗавершениеПериодаТС);
	indicatorSourceInput 	= ДанныеСвечей.ВыгрузитьКолонку(Строка(ИсточникДанных));
	
	indicatorData = ВыполнитьВычислениеИндикатора(Индикатор_1, indicatorSourceInput, ПараметрИндикатора_1);
    Если ЗначениеЗаполнено(Индикатор_2) Тогда
		indicatorData = ВыполнитьВычислениеИндикатора(Индикатор_2, indicatorData, ПараметрИндикатора_2);	
	КонецЕсли;
	
	Если indicatorData <> Неопределено Тогда
		
		Количество 				= ДанныеСвечей.Количество();
		КоличествоПоказателя	= indicatorData.Количество();
		
		Если КоличествоПоказателя < Количество Тогда
			ВызватьИсключение "Данных индикатора меньше переданного массива. Ошибка";
		Иначе
			
			LengthInput = ?(ЗначениеЗаполнено(ПараметрИндикатора_2), ПараметрИндикатора_2, ПараметрИндикатора_1);
			Для Индекс = LengthInput По Количество - 1 Цикл
				
				ВыполнитьЗаписьЗначенияИндикатора(ДанныеСвечей[Индекс], ИсточникДанных, Индикатор_1, ПараметрИндикатора_1, Индикатор_2, ПараметрИндикатора_2, indicatorData[Индекс]);	
			КонецЦикла;			
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

Функция ВыполнитьВычислениеИндикатора(indicator, indicatorSourceInput, lengthInput)
	
	indicatorData = Неопределено;
	
	Если indicator = Перечисления.биг_ВидыИндикаторов.SMA Тогда		
		indicatorData = ta.sma(indicatorSourceInput, lengthInput);
		
	ИначеЕсли indicator = Перечисления.биг_ВидыИндикаторов.EMA Тогда		
		indicatorData = ta.ema(indicatorSourceInput, lengthInput);
		
	ИначеЕсли indicator = Перечисления.биг_ВидыИндикаторов.RMA Тогда		
		indicatorData = ta.rma(indicatorSourceInput, lengthInput);
		
	ИначеЕсли indicator = Перечисления.биг_ВидыИндикаторов.WMA Тогда		
		indicatorData = ta.wma(indicatorSourceInput, lengthInput);
		
	ИначеЕсли indicator = Перечисления.биг_ВидыИндикаторов.VWMA Тогда		
		indicatorData = ta.vwma(indicatorSourceInput, lengthInput);
		
	ИначеЕсли indicator = Перечисления.биг_ВидыИндикаторов.RSI Тогда		
		indicatorData = ta.rsi(indicatorSourceInput, lengthInput);
		
	ИначеЕсли indicator = Перечисления.биг_ВидыИндикаторов.MA Тогда		
		indicatorData = ta.ma(indicatorSourceInput, lengthInput);
		
	Иначе		
		ВызватьИсключение "Переданный инидкатор отсутствует";
	КонецЕсли;
	
	Возврат indicatorData;
	
КонецФункции


Процедура ВычислитьПоказательRSISMA(Биржа, ИнструментИД, Бар, НачалоПериодаТС = 0, ЗавершениеПериодаТС = 9999999999) Экспорт

	Если ОшибкаВходныхПараметров(Биржа, ИнструментИД, Бар) Тогда
		Возврат;	
	КонецЕсли;	
	
	ДанныеСвечей = ПолучитьДанныеСвечей(Биржа, ИнструментИД, Бар, НачалоПериодаТС, ЗавершениеПериодаТС);
	РассчитатьЗначенияИндикатора_RSISMA(ДанныеСвечей);
	
КонецПроцедуры

#КонецОбласти //ПрограммныйИнтерфейс 


#Область Вычисления

Процедура ВыполнитьЗаписьЗначенияИндикатора(SourceInput, ИсточникДанных, Индикатор_1, Параметр_1, Индикатор_2, Параметр_2, Значение)
	
	Если Значение = Неопределено Тогда
		Возврат;
	КонецЕсли;  
	
	Запись = РегистрыСведений.биг_ЗначенияИндикаторов.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(Запись, SourceInput); // Биржа, ИнструментИД, Бар, TimeStamp, TimeStamp10
	Запись.Источник				= ИсточникДанных;
	Запись.Индикатор1 			= Индикатор_1;
	Запись.Параметр1 			= Параметр_1;
	Запись.Индикатор2 			= Индикатор_2;
	Запись.Параметр2 			= Параметр_2;
	Запись.Значение 			= Значение;
	Запись.ДатаВремя			= биг_ОбщегоНазначенияКлиентСервер.TimestampВДату(SourceInput.TimeStamp);
	Запись.Записать(Истина);
	
КонецПроцедуры
        
Процедура РассчитатьЗначенияИндикатора_RSISMA(SourceInput)
	
	rsiLengthInput 	= 14;
	maLengthInput	= 14;
	
	rsiSourceInput = SourceInput.ВыгрузитьКолонку("ЦенаЗакрытия");
	
	rsi 	= ta.rsi(rsiSourceInput, rsiLengthInput);
	rsiMA 	= ta.sma(rsi, maLengthInput);
	
	ЗаписатьЗначенияИндикаторовRSISMA(SourceInput, rsi, rsiLengthInput, rsiMA, maLengthInput); 
	
КонецПроцедуры

Процедура ЗаписатьЗначенияИндикаторовRSISMA(SourceInput, rsi, rsiLengthInput, rsiSMA, maLengthInput)
	
	Количество 		= SourceInput.Количество();
	КоличествоRSI	= rsi.Количество();
	КоличествоRsiMA	= rsiSMA.Количество();

	Если КоличествоRSI < Количество Тогда
		Сообщить("Ошибка. Количество результатов rsi меньше количества SourceInpit");
		Возврат;	
	КонецЕсли;
	
	Если КоличествоRsiMA < Количество Тогда
		Сообщить("Ошибка. Количество результатов rsiMA меньше количества SourceInpit");
		Возврат;	
	КонецЕсли;

	ИндикаторRSI 	= РегистрыСведений.биг_ПредопределенныеЭлементы.ПолучитьЗначениеПоИмени("ИндикаторRSI");
	ПараметрыRSI	= "RSI" + rsiLengthInput;
	ПараметрыRsiMA	= ПараметрыRSI + "SMA" + maLengthInput;
	
	Для Индекс = maLengthInput По Количество - 1 Цикл
		//ВыполнитьЗаписьЗначенияИндикатораRSISMA(SourceInput[Индекс], ИндикаторRSI, rsi[Индекс], 	ПараметрыRSI);
		//ВыполнитьЗаписьЗначенияИндикатораRSISMA(SourceInput[Индекс], ИндикаторRSI, rsiMA[Индекс], 	ПараметрыRsiMA);
		
		Источник = Перечисления.биг_ИсточникиДанныхТехническихИндикаторов.ЦенаЗакрытия;
		Индикатор_1 = Перечисления.биг_ВидыИндикаторов.RSI;
		Параметр_1	= 14;
		Индикатор_2	= Перечисления.биг_ВидыИндикаторов.SMA;
		Параметр_2	= 14;
		
		ВыполнитьЗаписьЗначенияИндикатора(SourceInput[Индекс], Источник, Индикатор_1, Параметр_1,,, rsi[Индекс]);
		ВыполнитьЗаписьЗначенияИндикатора(SourceInput[Индекс], Источник, Индикатор_1, Параметр_1, Индикатор_2, Параметр_2, rsiSMA[Индекс]);
	КонецЦикла;
	
КонецПроцедуры

Процедура ВыполнитьЗаписьЗначенияИндикатораRSISMA(SourceInput, Индикатор, Значение, ПараметрыИндикатора)
	
	Если Значение = Неопределено Тогда
		Возврат;
	КонецЕсли;  
	
	Запись = РегистрыСведений.биг_ЗначенияИндикаторов.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(Запись, SourceInput);
	Запись.Индикатор 			= Индикатор; 
	Запись.Значение 			= Значение;
	Запись.ДатаВремя			= биг_ОбщегоНазначенияКлиентСервер.TimestampВДату(SourceInput.TimeStamp);
	Запись.Источник				= "ЦенаЗакрытия";
	Запись.Индикатор1           = Перечисления.биг_ВидыИндикаторов.RSI;
	Запись.Параметр1			= 14;
	Запись.Записать(Истина);
	
КонецПроцедуры

#КонецОбласти //Вычисления

#Область Служебные

Функция ПолучитьДанныеСвечей(Биржа, ИнструментИД, Бар, НачалоПериодаТС, ЗавершениеПериодаТС)

	ПараметрыЗапроса 	= биг_ОбщегоНазначения.ПолучитьСтруктуруПараметровЗапросаДанныхПоСвечам();
	ПараметрыЗапроса.Биржа 								= Биржа;
	ПараметрыЗапроса.ИнструментИД 						= ИнструментИД;
	ПараметрыЗапроса.Бар 								= Бар;	
	ПараметрыЗапроса.ТочкаВремениТС_НачалоПериода 		= НачалоПериодаТС;
	ПараметрыЗапроса.ТочкаВремениТС_ЗавершениеПериода	= ЗавершениеПериодаТС;
	
	ДанныеСвечей = биг_ОбщегоНазначения.ПолучитьДанныеСвечейПоТочке(ПараметрыЗапроса);
	Возврат ДанныеСвечей;
	
КонецФункции

Функция ОшибкаВходныхПараметров(Биржа, ИнструментИД, Бар)

	ЕстьОшибка = Ложь;
	
	Если НЕ ЗначениеЗаполнено(Биржа) Тогда
		Сообщить("Не заполнена Биржа");
		ЕстьОшибка = Истина;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ИнструментИД) Тогда
		Сообщить("Не заполнен ИнструментИД");
		ЕстьОшибка = Истина;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Бар) Тогда
		Сообщить("Не заполнен Бар");
		ЕстьОшибка = Истина;
	КонецЕсли;
	
	Возврат ЕстьОшибка;
	
КонецФункции

#КонецОбласти //Служебные

