////////////////////////////////////////////////////////////////////////////////
// <Заголовок модуля: краткое описание и условия применения модуля.>
//  
////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура СформироватьИнтеграционныйДокумент(Операция, Аккаунт) Экспорт
	
	ОперацияТейкСтоп = Операция.ПолучитьОбъект();
	
	ЭтоИзменение = Ложь;
	Если ЗначениеЗаполнено(ОперацияТейкСтоп.СтопЛосс_ЦенаНовая) ИЛИ ЗначениеЗаполнено(ОперацияТейкСтоп.СтопЛосс_ТриггерНовый)
		ИЛИ ЗначениеЗаполнено(ОперацияТейкСтоп.ТейкПрофит_ТриггерНовый) ИЛИ ЗначениеЗаполнено(ОперацияТейкСтоп.ТейкПрофит_ЦенаНовая) 
		ИЛИ ЗначениеЗаполнено(ОперацияТейкСтоп.ОбъемНовый) Тогда
		
		ЭтоИзменение = Истина;
	КонецЕсли;
		
	Если ЭтоИзменение Тогда
		
		СтруктураАлго = биг_МаркетАпиКлиентСервер.СтруктураОперации_ИзменитьАлгоОрдер();
		СтруктураАлго.Биржа 					= ОперацияТейкСтоп.Биржа;
		СтруктураАлго.Аккаунт 					= Аккаунт;
		СтруктураАлго.ИнструментИД				= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОперацияТейкСтоп.Инструмент, "instId");
		
		ДанныеИнтеграционногоДокумента			= НайтиИнтеграционныйДокумент(ОперацияТейкСтоп.ОперацияОснование, Аккаунт, ОперацияТейкСтоп.Сделка, ОперацияТейкСтоп.Портфель);
		ИнтеграционныйОбъект = ДанныеИнтеграционногоДокумента.ИнтеграционныйДокумент.ПолучитьОбъект();
		ИнтеграционныйОбъект.ОперацияИзменить 	= Операция;
		ИнтеграционныйОбъект.Записать(РежимЗаписиДокумента.Запись);
		
		СтруктураАлго.АлгоОрдерИД 				= ДанныеИнтеграционногоДокумента.АлгоОрдерИД;
		СтруктураАлго.КлиентАлгоОрдерИД         = ДанныеИнтеграционногоДокумента.КлиентАлгоОрдерИД;
		СтруктураАлго.НовыйТриггерСтопЛос 		= ОперацияТейкСтоп.СтопЛосс_ТриггерНовый;
		СтруктураАлго.НовыйЦенаСтопЛос 			= ОперацияТейкСтоп.СтопЛосс_ЦенаНовая;
		СтруктураАлго.НовыйТриггерТейкПрофит	= ОперацияТейкСтоп.ТейкПрофит_ТриггерНовый;
		СтруктураАлго.НовыйЦенаТейкПрофит 		= ОперацияТейкСтоп.ТейкПрофит_ЦенаНовая;
		СтруктураАлго.НовыйОбъем 				= ОперацияТейкСтоп.ОбъемНовый;				
		
		Если НЕ ЗначениеЗаполнено(СтруктураАлго.АлгоОрдерИД) Тогда
			Сообщить("Не найден АлгоОрдер основание");
			Возврат;
		КонецЕсли;
		
		Результат = биг_МаркетАпи.ИзменитьАлгоОрдер(ДанныеИнтеграционногоДокумента.ИнтеграционныйДокумент, СтруктураАлго);
	Иначе 	
		
		СтруктураАлго = биг_МаркетАпиКлиентСервер.СтруктураОперации_СоздатьАлгоОрдер();
		СтруктураАлго.Биржа 					= ОперацияТейкСтоп.Биржа;
		СтруктураАлго.Аккаунт 					= Аккаунт;
		СтруктураАлго.Сигнал 					= ОперацияТейкСтоп.Сигнал;
		СтруктураАлго.Операция 					= Операция;
		СтруктураАлго.Сделка 					= ОперацияТейкСтоп.Сделка;
		СтруктураАлго.ИнструментИД 				= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОперацияТейкСтоп.Инструмент, "instId");		
		СтруктураАлго.ТриггерСтопЛос 			= ОперацияТейкСтоп.СтопЛосс_Триггер;
		СтруктураАлго.ЦенаСтопЛос 				= ОперацияТейкСтоп.СтопЛосс_Цена;
		СтруктураАлго.ТриггерТейкПрофит 		= ОперацияТейкСтоп.ТейкПрофит_Триггер;
		СтруктураАлго.ЦенаТейкПрофит 			= ОперацияТейкСтоп.ТейкПрофит_Цена;
		СтруктураАлго.Объем						= ОперацияТейкСтоп.Объем;
			
		// Создание ордера через API
		Результат = биг_МаркетАпи.СоздатьАлгоОрдер(, СтруктураАлго);	
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НайтиИнтеграционныйДокумент(Операция, Аккаунт, Сделка, Портфель)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	биг_ОперацииПортфеля.ИнтеграционныйДокумент КАК ИнтеграционныйДокумент,
	|	биг_ОперацииПортфеля.ИнтеграционныйДокумент.algoId КАК АлгоОрдерИД,
	|	биг_ОперацииПортфеля.ИнтеграционныйДокумент.algoClOrdId КАК КлиентАлгоОрдерИД
	|ИЗ
	|	РегистрСведений.биг_ОперацииПортфеля КАК биг_ОперацииПортфеля
	|ГДЕ
	|	биг_ОперацииПортфеля.Портфель = &Портфель
	|	И биг_ОперацииПортфеля.Сделка = &Сделка
	|	И биг_ОперацииПортфеля.Операция = &Операция
	|	И биг_ОперацииПортфеля.Аккаунт = &Аккаунт";
	Запрос.УстановитьПараметр("Портфель", Портфель);
	Запрос.УстановитьПараметр("Сделка", Сделка);
	Запрос.УстановитьПараметр("Операция", Операция);
	Запрос.УстановитьПараметр("Аккаунт", Аккаунт);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка;	
	
КонецФункции


#КонецОбласти

#КонецЕсли
