

////////////////////////////////////////////////////////////////////////////////
// <Заголовок модуля: краткое описание и условия применения модуля.>
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#КонецОбласти


#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ОтразитьДвиженияВОчередьОпераций(Отказ, РежимПроведения);
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиПроведения

Процедура ОтразитьДвиженияВОчередьОпераций(Отказ, РежимПроведения)
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.биг_ОперацииПортфеля");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("Портфель", 	Портфель);
	ЭлементБлокировки.УстановитьЗначение("Сделка", 		Сделка);
	ЭлементБлокировки.УстановитьЗначение("Операция", 	Ссылка);
	Блокировка.Заблокировать(); 
		
	ОчередьОпераций = РегистрыСведений.биг_ОперацииПортфеля.СоздатьНаборЗаписей();
	ОчередьОпераций.Отбор.Портфель.Установить(Портфель);
	ОчередьОпераций.Отбор.Сделка.Установить(Сделка);
	ОчередьОпераций.Отбор.Операция.Установить(Ссылка);
	ОчередьОпераций.Прочитать();
	
	// ставим в очередь, если нет записей (т.е. ранее не ставили док в очередь)
    Если ОчередьОпераций.Количество() = 0 Тогда
		Если НЕ Отказ Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	биг_УчастникиПортфелейСрезПоследних.Аккаунт КАК Аккаунт
			|ИЗ
			|	РегистрСведений.биг_УчастникиПортфелей.СрезПоследних(
			|			&ДатаДокумента,
			|			Портфель = &Портфель
			|				И Участник = ИСТИНА) КАК биг_УчастникиПортфелейСрезПоследних";
			
			Запрос.УстановитьПараметр("Портфель", 		Портфель);
			Запрос.УстановитьПараметр("ДатаДокумента", 	Дата);
			
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				
				НС = ОчередьОпераций.Добавить();
				НС.Портфель = Портфель;
				НС.Сделка	= Сделка;
				НС.Операция	= Ссылка;
				НС.Аккаунт	= Выборка.Аккаунт;
				
				ПодчиненныйОрдер = ДополнительныеСвойства.Свойство("ПодчиненныйОрдер");
				Если ПодчиненныйОрдер Тогда 
					// это немного костыль. Ставим такой статус, что бы менеджер обработки операций не захватывал АлгоОрдер,
					// привязанный к ордеру, т.к. при обработке Ордера обрабатывается сразу и его АлгоОрдер
					// А вот если это самостоятельный АлгоОрдер, то он должен быть обработан менеджером "стандартным порядком"
					НС.Статус	= Перечисления.big_СтатусыТорговыхОбъектов.Активный;
				Иначе				
					НС.Статус	= Перечисления.big_СтатусыТорговыхОбъектов.Новый;	
				КонецЕсли;
						
			КонецЦикла;		
		КонецЕсли;
		
		ОчередьОпераций.Записать(Истина);
	КонецЕсли;		
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

#КонецОбласти


