// @strict-types

#Область ПрограммныйИнтерфейс

// Устарела. Выбирает справочник для добавляемого задания очереди заданий.
//
// Параметры:
//	ПараметрыЗадания - Структура - Параметры добавляемого задания, возможные ключи:
//	 * ОбластьДанных - Число - область данных
//	 * Использование - Булево - факт использования
//	 * ЗапланированныйМоментЗапуска - Дата - дата начала запуска
//	 * ЭксклюзивноеВыполнение - Булево - факт эксклюзивного выполнения
//	 * ИмяМетода - Строка - имя метода для задания (обязательно для указания.)
//	 * Параметры - Массив - массив параметров задания
//	 * Ключ - Строка - ключ задания
//	 * ИнтервалПовтораПриАварийномЗавершении - Число - указывается в секундах
//	 * Расписание - РасписаниеРегламентногоЗадания - расписания выполнения задания
//	 * КоличествоПовторовПриАварийномЗавершении - Число - количество повторов.
//	 
// Возвращаемое значение:
//	СправочникМенеджер.ОчередьЗаданий - менеджер.
Функция ПриВыбореСправочникаДляЗадания(Знач ПараметрыЗадания) Экспорт
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти
