///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

//////////////////////////////////////////////////////////////////////////////////
// Подсистема "Настройки программы".
// ОбщийМодуль.НастройкиПрограммыБИППереопределяемый.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Предназначена для внесения изменений в форму ИнтернетПоддержкаИСервисы обработки ПанельАдминистрированияБИП без
// снятия формы с поддержки.
//
// Параметры:
//  Форма - см. Обработка.ПанельАдминистрированияБИП.Форма.ИнтернетПоддержкаИСервисы
//
Процедура ПриСозданииФормыИнтернетПоддержкаИСервисы(Форма) Экспорт
	
КонецПроцедуры

#КонецОбласти