#Область СлужебныйПрограммныйИнтерфейс

// Возвращаемое значение: 
//  Строка - Текст предупреждения об активных расширениях изменяющих структуру данных
Функция ТекстПредупрежденияОбАктивныхРасширенияхИзменяющихСтруктуруДанных() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	АктивныеРасширенияИзменяющиеСтруктуруДанных = ОбщегоНазначенияБТС.АктивныеРасширенияИзменяющиеСтруктуруДанных();

	Если Не ЗначениеЗаполнено(АктивныеРасширенияИзменяющиеСтруктуруДанных) Тогда
		Возврат "";
	КонецЕсли;

	ЧастиТекстаПредупреждения = Новый Массив;
	ЧастиТекстаПредупреждения.Добавить(
		НСтр("ru = 'В приложении установлены и активны расширения конфигурации, изменяющие структуру данных:'"));

	ЧастиТекстаПредупреждения.Добавить(Символы.ПС);
	ЧастиТекстаПредупреждения.Добавить(Символы.ПС);
	
	Для Каждого Расширение Из АктивныеРасширенияИзменяющиеСтруктуруДанных Цикл
		ЧастиТекстаПредупреждения.Добавить("● ");
		ЧастиТекстаПредупреждения.Добавить(Расширение.Синоним);
		ЧастиТекстаПредупреждения.Добавить(Символы.ПС);
	КонецЦикла;
	
	Возврат СтрСоединить(ЧастиТекстаПредупреждения);		
		
КонецФункции

// Загрузка прервана
// 
// Возвращаемое значение:
//  Булево
Функция ЗагрузкаПрервана() Экспорт
	Если Не РаботаВМоделиСервиса.ДоступноИспользованиеРазделенныхДанных() Тогда
		Возврат Ложь;
	КонецЕсли;	
	УстановитьПривилегированныйРежим(Истина);
	Возврат ВыгрузкаЗагрузкаДанныхСлужебный.ЗагрузкаПрервана();
КонецФункции
	
#КонецОбласти