///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Подсистема "ИнтернетПоддержкаПользователей.ПолучениеВнешнихКомпонент".
// ОбщийМодуль.ПолучениеВнешнихКомпонентВызовСервера.
//
// Серверные процедуры и функции загрузки внешних компонент:
//  - настройка режима обновления внешних компонент.
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

// Определяет расписание регламентного задания обновления внешних компонент.
//
// Возвращаемое значение:
//  Структура - Настройки регламентного задания обновления внешних компонент.
//              См ПолучениеВнешнихКомпонент.НастройкиОбновленияВнешнихКомпонент.
//
Функция НастройкиОбновленияВнешнихКомпонент() Экспорт
	
	Возврат ПолучениеВнешнихКомпонент.НастройкиОбновленияВнешнихКомпонент();
	
КонецФункции

// Изменяет настройки обновления внешних компонент.
//
// Параметры:
//  Настройки - Структура - Настройки регламентного задания обновления внешних компонент.
//    **ВариантОбновления - Число - вариант обновления внешних компонент;
//    **ФайлВнешнихКомпонент - Строка - путь к файлу внешних компонент;
//    **Расписание - РасписаниеРегламентногоЗадания - расписание обновления внешних компонент.
//
Процедура ИзменитьНастройкиОбновленияВнешнихКомпонент(Знач Настройки) Экспорт
	
	ПолучениеВнешнихКомпонент.ИзменитьНастройкиОбновленияВнешнихКомпонент(Настройки);
	
КонецПроцедуры

#КонецОбласти