
#Область ПрограммныйИнтерфейс

#Область Общее

// Преобразование некого значения в массив
//
// Параметры:
//  
//  пЗначение  - Строка,Массив,СписокЗначений,Структура,Соответствие - Список значений в поддерживаемом формате
//                 Для строки предполагается формат строки с разделителем
//  пПоЗначению  - Булево - Признак способо получения значения 
//                 Параметр имеет смысл для структуры, соответствия и списка значений
//  пРазделитель  - Строка - Разделитель значений
//                 Параметр имеет смысл для строки с разделителем
//  пПомещатьНеобрабатываемыеВМассив  - Булево - Указание что делать с неподдерживаемыми типами
//                 Если истина, то переданный параметр будет помещен в массив и функция вернет массив с одним элементом
//  пТолькоУникальные - Булево - Если истина, то в массив попадут только уникальные значения
//
// Возвращаемое значение:
//   Массив   - Извлеченные и помещенные в массив значения
//
Функция ПреобразоватьВМассив(пЗначение, пПоЗначению = Истина, пРазделитель = ",", пПомещатьНеобрабатываемыеВМассив = Ложь, пТолькоУникальные = Ложь) Экспорт
	
	Результат = КоллекцииКлиентСервер_бук.ПреобразоватьВМассив(пЗначение, 
	пПоЗначению, пРазделитель, пПомещатьНеобрабатываемыеВМассив, пТолькоУникальные);
	
	Возврат Результат;
	
КонецФункции

// Возвращает универсальную коллекцию
// Это полиморфная функция чей результат зависит от типа параметра
//
// Параметры:
//  
//  пИсточник - Строка,Тип,Массив,Структура,Соответствие,СписокЗначений,ТаблицаЗначений,ДеревоЗначений,ФиксированныйМассив,ФиксированнаяСтруктура,ФиксированноеСоответствие - описание коллекции
//                 Если передана строка, то ожидается имя универсальной коллекции
//                 В этом случае будет создана новая коллекция указанного типа
//                 В иных случаях вернётся та же самая коллекция, что передана в параметр
//  пПараметрыКонструктора - Массив,Структура,Соответствие,Неопределено - Если задано, то передаст параметры для конструктора
//                Используется для инициализации фиксированных коллекций
//
// Возвращаемое значение:
//   Массив,СписокЗначений,Структура,Соответствие,ТаблицаЗначений,ДеревоЗначений,ФиксированныйМассив,ФиксированнаяСтруктура,ФиксированноеСоответствие - универсальная коллекция
//
Функция УниверсальнаяКоллекция(пИсточник, пПараметрыКонструктора = Неопределено) Экспорт
	
	Результат = КоллекцииКлиентСервер_бук.УниверсальнаяКоллекция(пИсточник, пПараметрыКонструктора);
	
	Возврат Результат;

КонецФункции

// Копирование коллекцию в другую коллекцию аналогичного типа
//
// Параметры:
//  
//  пКоллекция - Массив,Структура,Соответствие,СписокЗначений,ТаблицаЗначений,ФиксированныйМассив,ФиксированнаяСтруктура,ФиксированноеСоответствие - коллекция для копирования
//  пРекурсивно - Булево - Если истина, то все коллекции содержащиеся в исходной коллекции будут так-же скопированы
//                 Иначе, наличные коллекции попадут в копию родительской коллекции как указатели на исходные
//
// Возвращаемое значение:
//   Массив,Структура,Соответствие,СписокЗначений,ТаблицаЗначений,ФиксированныйМассив,ФиксированнаяСтруктура,ФиксированноеСоответствие - копия коллекции
//
Функция Скопировать(пКоллекция, пРекурсивно = Истина) Экспорт
	
	Коллекция = Обработки.УниверсальнаяКоллекция_бук.Создать();
	Коллекция.Инициализировать(пКоллекция);
	
	Результат = Коллекция.Скопировать(пРекурсивно);
	
	Возврат Результат;
	
КонецФункции

// Формирование фиксированной копии переданной коллекции
//
// Параметры:
//  
//  пКоллекция - Массив,Структура,Соответствие - коллекция, данные которой нужно зафиксировать
//  пРекурсивно - Булево - данные коллекции по возможности будут скопированы и зафиксированы рекурсивно
//
// Возвращаемое значение:
//   ФиксированныйМассив,ФиксированнаяСтруктура,ФиксированноеСоответствие - зафиксированные данные
//
Функция Зафиксировать(пКоллекция, пРекурсивно = Истина) Экспорт 
	
	Коллекция = Обработки.УниверсальнаяКоллекция_бук.Создать();
	Коллекция.Инициализировать(пКоллекция);
	
	Результат = Коллекция.СкопироватьКакЗафиксированныеДанные(пРекурсивно);
	
	Возврат Результат;
	
КонецФункции

// Формирование копии фиксированной коллекции без фиксации
//
// Параметры:
//  
//  пКоллекция - ФиксированныйМассив,ФиксированнаяСтруктура,ФиксированноеСоответствие - коллекция для обработки
//  пРекурсивно - Булево - данные коллекции будут скопированы и по необходимости зафиксированы рекурсивно
//
// Возвращаемое значение:
//   Массив,Структура,Соответствие - не зафиксированные данные
//
Функция СнятьФиксацию(пКоллекция, пРекурсивно = Истина) Экспорт
	
	Коллекция = Обработки.УниверсальнаяКоллекция_бук.Создать();
	Коллекция.Инициализировать(пКоллекция);
	
	Результат = Коллекция.СкопироватьКакДанныеБезФиксации(пРекурсивно);
	
	Возврат Результат;
	
	
КонецФункции

#КонецОбласти

#Область Массив

#Область Массивы_Совместимость

// Помещение значений массива в строку с разделителем
// Устарела. Сохранена для Для версий платформы ниже 8.3.6
//
// Параметры:
//  
//  пМассив  - Массив - массив для помещения в строку
//  пРазделитель  - Строка - разделитель значений в строке
//
// Возвращаемое значение:
//   Строка   - Значения массива приведенные к строке и разделенные символом разделителем
//
Функция МассивВСтрокуСРазделителями(пМассив, пРазделитель = ",") Экспорт 
	
	Результат = КоллекцииКлиентСервер_бук.МассивВСтрокуСРазделителями(пМассив, пРазделитель);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

// Копирование значений массив в новый экземпляр массива
//
// Параметры:
//  
//  пМассив - Массив - исходный массив, который необходимо скопировать
//  пТолькоУникальные - Булево - Если истина, то будут скопированы только уникальные значения
//                 фактически это будет группировкой массива по значению
//
// Возвращаемое значение:
//   Массив - новый массив со скопированными значениями
//
Функция СкопироватьМассив(пМассив, пТолькоУникальные = Ложь) Экспорт
	
	Результат = КоллекцииКлиентСервер_бук.СкопироватьМассив(пМассив, пТолькоУникальные);
	
	Возврат Результат;
	
КонецФункции

// Создание нового массива значения которого являются подмножеством исходного массива с исключением указанных значений 
//
// Параметры:
//  
//  пМассив - Массив - исходный массив
//  пЗначенияКУдалению  - СтрокаСРазделителями,Массив,Структура,Соответствие - Значения, которые нужно удалить
//                 Для коллекций типа Структура и Соответствие предполагается хранение имени реквизита в ключе
//
// Возвращаемое значение:
//   Массив - новый массив не содержащий указанных значений
//
Функция УдалитьЗначенияИзМассива(пМассив, пЗначенияКУдалению) Экспорт
	
	Результат = КоллекцииКлиентСервер_бук.УдалитьЗначенияИзМассива(пМассив, пЗначенияКУдалению);
	
	Возврат Результат;
	
КонецФункции

// Получение значений присутствующих в обоих массивах
//
// Параметры:
//  
//  пМассив1 - Массив - первый проверяемый массив
//  пМассив1 - Массив - второй проверяемый массив
//
// Возвращаемое значение:
//   Массив - значения присутствующие в обоих массивах
//
Функция СовпадающиеЗначенияМассивов(пМассив1, пМассив2) Экспорт
	
	Результат = КоллекцииКлиентСервер_бук.СовпадающиеЗначенияМассивов(пМассив1, пМассив2);
	
	Возврат Результат;
	
КонецФункции

// Дополнение массива значениями из другого массива
//
// Параметры:
//  
//  пПриемник  - Массив - массив который необходимо дополнить
//  пИсточник  - Массив - массив из которого производится дополнение
//  пТолькоУникальные  - Булево - Если Истина, то будут добавлены только уникальные значения
//
Процедура ДополнитьМассив(пПриемник, пИсточник, пТолькоУникальные = Ложь) Экспорт
	
	КоллекцииКлиентСервер_бук.ДополнитьМассив(пПриемник, пИсточник, пТолькоУникальные);
	
КонецПроцедуры

// Удаление незаполненных значений из массива.
// Для корректного использования см. функцию "ЗначениеЗаполнено"
//
// Параметры:
//  
//  пМассив  - Массив - Массив для обработки
//
Процедура УдалитьПустыеЗначенияМассива(пМассив) Экспорт
	
	КоллекцииКлиентСервер_бук.УдалитьПустыеЗначенияМассива(пМассив);

КонецПроцедуры

// Выполняет сравнение массивов путем проверки взаимного вхождения множеств. Дубли и порядок элементов игнорируются
//
// Параметры:
//  Массив1  - Массив - первый массив для сравнения
//  Массив2  - Массив - второй массив для сравнения
//
// Возвращаемое значение:
//   Результат сравнения   - Булево. Истина если массивы равны
//
Функция МассивыРавны(пМассив1, пМассив2) Экспорт
	
	Результат = КоллекцииКлиентСервер_бук.МассивыРавны(пМассив1, пМассив2);
	
	Возврат Результат;
	
КонецФункции

// Помещение массива в переданную коллекцию
//
// Параметры:
//  
//  пМассив  - Массив - исходный массив
//  пПриемник  - Массив,СписокЗначений - коллекция-приёмник.
//
// Возвращаемое значение:
//   Массив,СписокЗначений   - Результат помещения массива в указанную коллекцию
//
Функция МассивВКоллекцию(пМассив, пПриемник) Экспорт
	
	Результат = КоллекцииКлиентСервер_бук.МассивВКоллекцию(пМассив, пПриемник);
	
	Возврат Результат;

КонецФункции

// Преобразование двумерного массива в таблицу значений
// Таблица получает служебные имена колонок типа СтолбецN
//
// Параметры:
//  
//  пИсточник - Массив - двумерный массив (матрица)
//  пЗаголовкиИзПервойСтроки - Булево - если истина, то первая строка сформирует представление колонок таблицы
//
// Возвращаемое значение:
//   ТаблицаЗначений - результат преобразования матрицы в таблицу значений
//
Функция МассивВТаблицу(пИсточник, пЗаголовкиИзПервойСтроки = Истина) Экспорт
	
	Результат = Таблицы_ауф.ТаблицаПоМассивуМассивов(пИсточник, пЗаголовкиИзПервойСтроки);
	
	Возврат Результат;

КонецФункции

// Сортировка массива объектов по значению реквизита
// Не рекомендуется использовать для сортировки ссылочных объектов
//
// Параметры:
//  
//  пМассив  - Массив - массив объектов. Все объекты должны иметь реквизит указанный в параметре пИмяРек
//  пИмяРек  - Строка - имя реквизита по которому будет производиться сравнение
//  пНаправление  - Строка - Направление сортировки. Может принимать значения "Возр" или "Убыв"
//
Процедура СортироватьОбъекты(пМассив, пИмяРек, пНаправление = "ВОЗР") Экспорт
	
	КоллекцииКлиентСервер_бук.СортироватьОбъекты(пМассив, пИмяРек, пНаправление);
	
КонецПроцедуры

// Сортировка массива по значению
//
// Параметры:
//  
//  пМассив  - Массив - массив значений. Поддерживаются только значения поддерживающие операции сравнения больше/меньше
//  пНаправление  - Строка - Направление сортировки. Может принимать значения "Возр" или "Убыв"
//
Процедура СортироватьМассив(пМассив, пНаправление = "ВОЗР") Экспорт
	
	КоллекцииКлиентСервер_бук.СортироватьМассив(пМассив, пНаправление);
	
КонецПроцедуры

// Получение наибольшего элемента массива
// Сравнение элементов производится обычным оператором сравнения, поэтому поддерживаются не только числовые значения
// Если массив пустой, то вернётся Неопределено
//
// Параметры:
//
//  пМассив - Массив - массив, максимальное значение элемента которого надо вычислить
//
// Возвращаемое значение:
//   Произвольный - максимальное значение элемента
//
Функция МаксЭлементМассива(пМассив) Экспорт
	
	Результат = КоллекцииКлиентСервер_бук.МаксЭлементМассива(пМассив);
	
	Возврат Результат;
	
КонецФункции

// Получение наименьшего элемента массива
// Сравнение элементов производится обычным оператором сравнения, поэтому поддерживаются не только числовые значения
// Если массив пустой, то вернётся Неопределено
//
// Параметры:
//
//  пМассив - Массив - массив, минимальное значение элемента которого надо вычислить
//
// Возвращаемое значение:
//   Произвольный - минимальное значение элемента
//
Функция МинЭлементМассива(пМассив) Экспорт
	
	Результат = КоллекцииКлиентСервер_бук.МинЭлементМассива(пМассив);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область Структура

//конструктор для структуры. Позволяет создать структуру по набору колонок 
//
// Параметры:
//
//  пКолонки  - КоллекцияКолонокТаблицыЗначений,КоллекцияКолонокРезультатаЗапроса - колонки для преобразования
//  пИсключитьИзТипаNull  - Булево. Обозначает необходимость удаления типов NULL из типов колонок.
//                 Если Истина, удалять тип NULL, если Ложь - не удалять.
//  пВключаемыеКолонки  - Строка,Массив,СписокЗначений,Структура,Соответствие - Список имен колонок, которые будут включены в итоговый набор
//                 Если задано, то параметр пИсключаемыеКолонки игнорируется
//                 Для коллекций типа Структура и Соответствие предполагается хранение имени реквизита в ключе
//  пИсключаемыеКолонки  - Строка,Массив,СписокЗначений,Структура,Соответствие - Список имен колонок, которые будут исключены из итогового набора
//                 Имеет смысл только если параметр пВключаемыеКолонки не задан
//                 Для коллекций типа Структура и Соответствие предполагается хранение имени реквизита в ключе
//
//ВОЗВРАЩАЕМОЕ ЗНАЧЕНИЕ:
//
//Структура   - Ключ - имя колонки, Значение - значение по умолчанию для данного типа колонки
//
Функция СтруктураПоКоллекцииКолонок(Знач пКолонки, пИсключитьИзТипаNull = Истина, пВключаемыеКолонки = Неопределено, пИсключаемыеКолонки = Неопределено) Экспорт
	
	Результат = Новый Структура;
	
	Если пИсключитьИзТипаNull Тогда
		времКолонки = ОбщегоНазначения_ауф.УдалитьNULLИзТиповКолонок(пКолонки, пВключаемыеКолонки, пИсключаемыеКолонки);
	КонецЕсли;
	
	Для Каждого Колонка Из времКолонки Цикл
		Результат.Вставить(Колонка.Имя, Колонка.ТипЗначения.ПривестиЗначение());
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Формирование структуры по двум колонкам таблицы
//
// Параметры:
//  
//  пТаблица - ТаблицаЗначений - исходная таблица содержащая данные
//  пИмяПоляКлючей - Строка - имя колонки таблицы в которой хранятся данные для ключей структуры
//                 Все значения этого поля должны быть уникальными
//                 Все значения должны соответствовать правилам именования переменных
//                 Если какое-либо условие не будет выполнено, то будет вызвано исключение
//  пИмяПоляЗначений - Строка - имя колонки таблицы в которой хранятся значения для структуры
//
// Возвращаемое значение:
//   Структура - коллекция пар ключ и значение соответствующие строкам переданной таблицы
//
Функция СтруктураПоДвумКолонкамТаблицы(пТаблица, пИмяПоляКлючей, пИмяПоляЗначений) Экспорт
	
	Результат = Новый Структура;
	Контекст = "Конструктор структуры по таблице значений. "; 
	
	УникальныеКлючи = Таблицы_ауф.ВыгрузитьКолонку(пТаблица, пИмяПоляКлючей);
	Если УникальныеКлючи.Количество() <> пТаблица.Количество() Тогда
		ТекстОшибки = Контекст + "Передана коллекция неуникальных ключей";
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	                                                                       	
	Для Каждого Стр Из пТаблица Цикл
		
		Попытка
			Ключ = Стр[пИмяПоляКлючей];
		Исключение
			ТекстОшибки = Контекст + "Передано неверное имя поля ключей (" + пИмяПоляКлючей + ")";
			ВызватьИсключение ТекстОшибки;
		КонецПопытки;
		
		Попытка
			Значение = Стр[пИмяПоляЗначений];
		Исключение
			ТекстОшибки = Контекст + "Передано неверное имя поля значений (" + пИмяПоляКлючей + ")";
			ВызватьИсключение ТекстОшибки;
		КонецПопытки;
		
		Попытка
			Результат.Вставить(Ключ, Значение);
		Исключение
			ТекстОшибки = Контекст + "Ключ (" + Ключ + ") не соответствует правилам именования";
			ВызватьИсключение ТекстОшибки;
		КонецПопытки;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Формирование текстового представления значений реквизитов структуры/соответствия
// 
//
// Параметры:
//  
//  пСтруктура - Структура,Соответствие - структура, которую необходимо обработать
//  пРазделитель - Строка - Строка, которая будет разделителем пар ключ/значение
//  пРазделительПары - Строка - Строка, которая будет разделителем ключа и значения
//
// Возвращаемое значение:
//   Строка - Представления ключей и значения. Каждая пара ключ/значение отделена символом переноса строки
//
Функция ПредставлениеСтруктуры(пСтруктура, пРазделитель = Неопределено, пРазделительПары = ": ") Экспорт
	
	Результат = КоллекцииКлиентСервер_бук.ПредставлениеСтруктуры(пСтруктура, пРазделитель, пРазделительПары);
	
	Возврат Результат;

КонецФункции

// Создание/Дополнение структуры или соответствия по массиву
// Это полиморфная функция чей результат зависит от типа параметра
//
// Параметры:
//  
//  пМассив - Строка,Массив,СписокЗначений,Структура,Соответствие - Ключи структуры
//                 Для коллекций типа Структура и Соответствие предполагается хранение имени реквизита в ключе
//  пЗначениеПоУмолчанию - Произвольный - Значение которое будет вставлено во все новые пары Ключ/Значение
//  пКонтейнер - Строка,Тип,Структура,Соответствие - описание универсальной коллекции
//                 Если передана строка, то предполагается, что это имя универсальной коллекции "Структура"
//                 или "Соответствие", а в результате будет создан и заполнен новый объект указанного типа
//                 Если передан тип, то будет создана новая коллекция указанного типа 
//                 В остальных случаях функция вернёт переданный объект после дозаполнения 
//
// Возвращаемое значение:
//   Структура,Соответствие - Универсальная структура, новая или переданная
//
Функция СтруктураПоМассиву(пМассив, пЗначениеПоУмолчанию = Неопределено, пКонтейнер = "Структура") Экспорт
	
	Результат = КоллекцииКлиентСервер_бук.СтруктураПоМассиву(пМассив, пЗначениеПоУмолчанию, пКонтейнер);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область КлассУниверсальнаяКоллекция

Функция ЭкземплярКлассаУниверсальнаяКоллекция(пОбъект) Экспорт
	
	Результат = КоллекцииСлужебныйКлиентСервер_бук.ЭкземплярКлассаУниверсальнаяКоллекция(пОбъект);
	
	Возврат Результат;
	
КонецФункции

Функция ЭтоЭкземплярКлассаУниверсальнаяКоллекция(пОбъект) Экспорт
	
	Результат = КоллекцииСлужебныйКлиентСервер_бук.ЭтоЭкземплярКлассаУниверсальнаяКоллекция(пОбъект);
	
	Возврат Результат;

КонецФункции
	
#КонецОбласти
