#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Параметры: 
//  ИмяЗначения - Строка
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.ТипыУслуг
//	
Функция ЗначениеПоИмени(ИмяЗначения) Экспорт
	
	Если ИмяЗначения = "unlimited" Тогда
		Возврат ПредопределенноеЗначение("Перечисление.ТипыУслуг.Безлимитная");
	ИначеЕсли ИмяЗначения = "limited" Тогда
		Возврат ПредопределенноеЗначение("Перечисление.ТипыУслуг.Лимитированная");
	ИначеЕсли ИмяЗначения = "unique" Тогда
		Возврат ПредопределенноеЗначение("Перечисление.ТипыУслуг.Уникальная");
	Иначе
		Возврат ПредопределенноеЗначение("Перечисление.ТипыУслуг.ПустаяСсылка");
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли