
#Область ПрограммныйИнтерфейс

Процедура ЗафиксироватьОперацию(МассивОпераций) Экспорт
	
	Для каждого Операция Из МассивОпераций Цикл    
		
		Стратегия 				= Операция.Стратегия;
		Если ЗначениеЗаполнено(Стратегия) Тогда
			
			ИмяМенеджераСтратегии 	= Стратегия.НазваниеМенеджера;
			МенеджерСтратегии		= ОбщегоНазначения.ОбщийМодуль(ИмяМенеджераСтратегии);
			
			МенеджерСтратегии.ЗафиксироватьОперацию(Операция);			
		КонецЕсли;		
	КонецЦикла;  
	
КонецПроцедуры

Функция ПолучитьЗначениеПараметраСтратегии(ИмяПараметра, КлючНастроек) Экспорт

	Возврат РегистрыСведений.биг_ЗначенияКонтрольныхУровней.ЗначениеУровняПоИмени(ИмяПараметра, КлючНастроек);
	
КонецФункции

Функция ПолучитьКлючСтратегииПоУмолчанию(Стратегия) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	big_КонтрольныеУровни.Ссылка КАК Ссылка,
	|	big_КонтрольныеУровни.ЗначениеПоУмолчанию КАК ЗначениеПоУмолчанию
	|ПОМЕСТИТЬ ВТ_КонтрольныеУровни
	|ИЗ
	|	Справочник.big_КонтрольныеУровни КАК big_КонтрольныеУровни
	|ГДЕ
	|	big_КонтрольныеУровни.Владелец = &Стратегия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	биг_ЗначенияКонтрольныхУровней.НастройкаСтратегии КАК НастройкаСтратегии,
	|	КОЛИЧЕСТВО(*) КАК КоличествоСовпадений
	|ИЗ
	|	РегистрСведений.биг_ЗначенияКонтрольныхУровней КАК биг_ЗначенияКонтрольныхУровней
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_КонтрольныеУровни КАК ВТ_КонтрольныеУровни
	|		ПО биг_ЗначенияКонтрольныхУровней.КонтрольныйУровень = ВТ_КонтрольныеУровни.Ссылка
	|			И биг_ЗначенияКонтрольныхУровней.Значение = ВТ_КонтрольныеУровни.ЗначениеПоУмолчанию
	|
	|СГРУППИРОВАТЬ ПО
	|	биг_ЗначенияКонтрольныхУровней.НастройкаСтратегии
	|
	|УПОРЯДОЧИТЬ ПО
	|	КоличествоСовпадений УБЫВ";
	Запрос.УстановитьПараметр("Стратегия", Стратегия);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.НастройкаСтратегии;
	
КонецФункции

#КонецОбласти //ПрограммныйИнтерфейс


#Область ВспомогательныеПроцедурыФункции

Функция ОпределитьНастройкуОперации(Стратегия, Аккаунт, ИнструментИД) Экспорт
	
	ИмяМенеджераСтратегии 	= Стратегия.НазваниеМенеджера;
	МенеджерСтратегии		= ОбщегоНазначения.ОбщийМодуль(ИмяМенеджераСтратегии);
	
	Биржа 		= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Аккаунт, "Владелец");
	Настройка 	= МенеджерСтратегии.ПолучитьНастройкуСтратегии(Биржа, ИнструментИД);
	
	Возврат Настройка;
	
КонецФункции

Функция ОпределитьСтратегиюАккаунта(Аккаунт) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	биг_УчастникиСтратегийСрезПоследних.Strategy КАК Стратегия
	|ИЗ
	|	РегистрСведений.биг_УчастникиСтратегий.СрезПоследних КАК биг_УчастникиСтратегийСрезПоследних
	|ГДЕ
	|	биг_УчастникиСтратегийСрезПоследних.Participiant = &Аккаунт
	|	И биг_УчастникиСтратегийСрезПоследних.Участник";
	Запрос.УстановитьПараметр("Аккаунт", Аккаунт);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Стратегия = Неопределено;
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Стратегия = Выборка.Стратегия;
	КонецЕсли;
	
	Возврат Стратегия;
	
КонецФункции

#КонецОбласти //ВспомогательныеПроцедурыФункции 
