
////////////////////////////////////////////////////////////////////////////////
// <Double Impact: Логика работы стратегии.>
//  
////////////////////////////////////////////////////////////////////////////////
#Область ПрограммныйИнтерфейс


#Область Управление

Процедура ИсполнениеСтратегииDoubleImpact() Экспорт
	
	// пропустим цикл, если предыдущее задание не завершилось
	Если биг_ОбщегоНазначения.ФоновоеЗаданиеАктивно_ПоКлючу("big_ВыполнитьСтратегиюДаблИмпакт") Тогда
		Возврат;
	КонецЕсли;	
	
	ТаймСтамп 	= биг_ОбщегоНазначенияКлиентСервер.ДатуВTimestampЧисло();
	Бектест		= Ложь;
	
	ВыборкаИнструментовСтратегии = ПолучитьВыборкуИнструментовСтратегии();	
	Пока ВыборкаИнструментовСтратегии.Следующий() Цикл
		
		ОбработатьИнструмент(ВыборкаИнструментовСтратегии, ТаймСтамп, Бектест);		
	КонецЦикла;
	
КонецПроцедуры       

Процедура ОбработатьИнструмент(ПараметрыИнструмента, ТаймСтамп, Бектест) Экспорт
	
	КлючНастроек = ПараметрыИнструмента.КлючНастроек;
	
	//получить текущие активные точки и их статус	
	МассивСигналов = ПолучитьМассивАктивныхСигналов(ПараметрыИнструмента, ТаймСтамп);
	
	Если НЕ ТребуетсяОбработкаСигнала(ПараметрыИнструмента, КлючНастроек, ТаймСтамп) Тогда
		Возврат;	
	КонецЕсли;
		
	Для каждого Сигнал Из МассивСигналов Цикл
		
		Сигнал.Бектест 	= Бектест;
		ШагВыполнен		= Ложь;
		ВыполнениеСигнала(Сигнал, КлючНастроек, ТаймСтамп, ШагВыполнен);
		
		Если ШагВыполнен Тогда
			ЗафиксироватьТочкуТекущегоШага(ПараметрыИнструмента, КлючНастроек, ТаймСтамп);	
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры

Процедура ПроверитьОперацииПоАктивнымСигналам(ТаймСтамп = Неопределено, Бектест = Ложь, КлючНастройки = Неопределено, ИнструментИД, Биржа) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	биг_ДаблИмпактСигналы.Биржа КАК Биржа,
	|	биг_ДаблИмпактСигналы.ИнструментИД КАК ИнструментИД,
	|	биг_ДаблИмпактСигналы.Бар КАК Бар,
	|	биг_ДаблИмпактСигналы.ТочкаНачалаПадения КАК ТочкаНачалаПадения,
	|	биг_ДаблИмпактСигналы.КлючНастроек КАК КлючНастроек
	|ПОМЕСТИТЬ ВТ_АктивныеСигналы
	|ИЗ
	|	РегистрСведений.биг_ДаблИмпактСигналы КАК биг_ДаблИмпактСигналы
	|ГДЕ
	|	НЕ биг_ДаблИмпактСигналы.СигналЗавершен
	|	И (биг_ДаблИмпактСигналы.КлючНастроек = &КлючНастроек
	|			ИЛИ &БезФильтраПоНастройке)
	|	И биг_ДаблИмпактСигналы.ИнструментИД = &ИнструментИД
	|	И биг_ДаблИмпактСигналы.Биржа = &Биржа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	биг_ДаблИмпактОперации.Биржа КАК Биржа,
	|	биг_ДаблИмпактОперации.Аккаунт КАК Аккаунт,
	|	биг_ДаблИмпактОперации.НастройкаСтратегии КАК НастройкаСтратегии,
	|	биг_ДаблИмпактОперации.ИнструментИД КАК ИнструментИД,
	|	биг_ДаблИмпактОперации.ТочкаНачалаПадения КАК ТочкаНачалаПадения,
	|	биг_ДаблИмпактОперации.Операция КАК Операция,
	|	ВЫРАЗИТЬ(биг_ДаблИмпактОперации.Операция КАК Документ.big_AlgoOrders_OKX).slOrdPx КАК slOrdPx,
	|	ВЫРАЗИТЬ(биг_ДаблИмпактОперации.Операция КАК Документ.big_AlgoOrders_OKX).tpOrdPx КАК tpOrdPx,
	|	ВЫРАЗИТЬ(биг_ДаблИмпактОперации.Операция КАК Документ.big_AlgoOrders_OKX).state КАК state,
	|	биг_ДаблИмпактОперации.Операция.Дата КАК Дата,
	|	биг_ДаблИмпактОперации.Бар КАК Бар,
	|	биг_ДаблИмпактОперации.Операция.Событие КАК Событие,
	|	биг_ДаблИмпактОперации.Операция.slTriggerPx КАК slTriggerPx,
	|	биг_ДаблИмпактОперации.Операция.tpTriggerPx КАК tpTriggerPx,
	|	биг_ДаблИмпактОперации.Операция.sz КАК sz,
	|	ЕСТЬNULL(биг_ДаблИмпактОперации.Операция.Ордер.fillSz, 0) КАК fillSz,
	|	биг_ДаблИмпактОперации.Операция.НастройкаСтратегии КАК КлючНастроек,
	|	ВЫРАЗИТЬ(биг_ДаблИмпактОперации.Операция КАК Документ.big_AlgoOrders_OKX).algoId КАК algoId
	|ИЗ
	|	ВТ_АктивныеСигналы КАК ВТ_АктивныеСигналы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.биг_ДаблИмпактОперации КАК биг_ДаблИмпактОперации
	|		ПО ВТ_АктивныеСигналы.Биржа = биг_ДаблИмпактОперации.Биржа
	|			И ВТ_АктивныеСигналы.ИнструментИД = биг_ДаблИмпактОперации.ИнструментИД
	|			И ВТ_АктивныеСигналы.ТочкаНачалаПадения = биг_ДаблИмпактОперации.ТочкаНачалаПадения
	|			И ВТ_АктивныеСигналы.КлючНастроек = биг_ДаблИмпактОперации.НастройкаСтратегии
	|ГДЕ
	|	(ВЫРАЗИТЬ(биг_ДаблИмпактОперации.Операция КАК Документ.big_AlgoOrders_OKX)) <> ЗНАЧЕНИЕ(Документ.big_AlgoOrders_OKX.ПустаяСсылка)";
	
	Запрос.УстановитьПараметр("КлючНастроек", 			КлючНастройки);
	Запрос.УстановитьПараметр("БезФильтраПоНастройке", 	КлючНастройки = Неопределено);
	Запрос.УстановитьПараметр("ИнструментИД", 			ИнструментИД);
	Запрос.УстановитьПараметр("Биржа", 					Биржа);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Бектест = Ложь Тогда // актуализация ордеров в настоящем времени
			
			биг_МаркетАпи.АктуализироватьАлгоОрдер(Выборка.Операция);	
		Иначе // имитируем работу с биржей
			
			ИскуственноПроверитьВыполнениеОрдера(Выборка, ТаймСтамп);	
		КонецЕсли;
		// получить актуальный статус
		
		ПроверитьАктуальностьСигнала(Выборка, ТаймСтамп);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти //Управление


#Область Интеграция

Процедура ЗафиксироватьОперацию(Операция) Экспорт
	
	//Запись = РегистрыСведений.биг_ДаблИмпактОперации.СоздатьМенеджерЗаписи();
	//Запись.Период				= ТекущаяДатаСеанса();
	//Запись.Биржа 				= Операция.Аккаунт.Владелец;
	//Запись.ИнструментИД			= Операция.instId;
	//Запись.НастройкаСтратегии	= Операция.НастройкаСтратегии;
	//Запись.Аккаунт				= Операция.Аккаунт;
	//Запись.ТочкаНачалаПадения	= Операция.ТочкаНачалаПадения;
	//Запись.Событие				= Операция.Событие;	
	//Запись.Операция				= Операция;        
	//Запись.Записать(Истина);
	
	Набор = РегистрыСведений.биг_ДаблИмпактОперации.СоздатьНаборЗаписей();
	Набор.Отбор.Биржа.Установить(Операция.Аккаунт.Владелец);
	Набор.Отбор.ИнструментИД.Установить(Операция.instId);
	Набор.Отбор.НастройкаСтратегии.Установить(Операция.НастройкаСтратегии);
	Набор.Прочитать();
	
	Запись = Набор.Добавить();
	Запись.Период				= ТекущаяДатаСеанса();
	Запись.Биржа 				= Операция.Аккаунт.Владелец;
	Запись.ИнструментИД			= Операция.instId;
	Запись.НастройкаСтратегии	= Операция.НастройкаСтратегии;
	Запись.Аккаунт				= Операция.Аккаунт;
	Запись.ТочкаНачалаПадения	= Операция.ТочкаНачалаПадения;
	Запись.Событие				= Операция.Событие;	
	Запись.Операция				= Операция;
	
	Набор.Записать(Истина);
	
КонецПроцедуры

Функция ПолучитьНастройкуСтратегии(Биржа, ИнструментИД) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	биг_ДаблИмпактИнструментыСрезПоследних.КлючНастройки КАК КлючНастройки
	|ИЗ
	|	РегистрСведений.биг_ДаблИмпактИнструменты.СрезПоследних КАК биг_ДаблИмпактИнструментыСрезПоследних
	|ГДЕ
	|	биг_ДаблИмпактИнструментыСрезПоследних.Биржа = &Биржа
	|	И биг_ДаблИмпактИнструментыСрезПоследних.ИнструментИД = &ИнструментИД
	|	И биг_ДаблИмпактИнструментыСрезПоследних.Участие";
	Запрос.УстановитьПараметр("Биржа", Биржа);
	Запрос.УстановитьПараметр("ИнструментИД", ИнструментИД);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.КлючНастройки;	
	
КонецФункции

#КонецОбласти //Интеграция 


#КонецОбласти //ПрограммныйИнтерфейс


#Область СлужебныйИнтерфейс

// to do: перенести в ОМ МаркетАпи
Процедура ЗагрузитьИнформациюОСвечах() Экспорт
	
	// пропустим цикл, если предыдущее задание не завершилось
	Если биг_ОбщегоНазначения.ФоновоеЗаданиеАктивно_ПоКлючу("big_ЗагрузкаИнформацииОСвечах") Тогда
		Возврат;
	КонецЕсли;  
	
	ТекТаймСтамп			= биг_ОбщегоНазначенияКлиентСервер.ДатуВTimestampЧисло(); 
	
	ИнструментыСтратегии 	= ПолучитьВыборкуИнструментовСтратегии(Ложь);
		
	Пока ИнструментыСтратегии.Следующий() Цикл                                                          
		
		// здесь должен быть вызов модуля Маркет АПИ, что бы в зависимости от биржи пошел вызов на конкретный модуль интеграции
		//ОбработкаИнтеграции = ИнструментыСтратегии.Биржа.ИнтеграционныйМодуль;   
		//МодульИнтеграции 	= ДополнительныеОтчетыИОбработки.ОбъектВнешнейОбработки(ОбработкаИнтеграции);
		
		ТаймСтамп				= ТекТаймСтамп;
		
		// получить данные о последней свече
		ПоследняяСвеча 		= НайтиПоследнююСвечуИнструмента(ИнструментыСтратегии, ТаймСтамп);
		ТCПоследнейСвечи	= ?(ПоследняяСвеча <> Неопределено, ПоследняяСвеча.TimeStamp10, биг_ОбщегоНазначенияКлиентСервер.ДатуВTimestampЧисло(Дата(2020, 01, 01)));
		КоличествоСвечей	= 100;
		
		// вычесть её точку из текущего времени, поделить на размер бара
		ТребуетсяБар		= Цел((ТаймСтамп - ТCПоследнейСвечи) / ИнструментыСтратегии.Бар.SecondsAmount) + 1;
		ТребуетсяИтераций	= Цел(ТребуетсяБар/КоличествоСвечей);
		Если ТребуетсяИтераций > 40 Тогда
			ТребуетсяИтераций = 40;
		ИначеЕсли ТребуетсяИтераций = 0 Тогда
			ТребуетсяИтераций = 1;
		КонецЕсли;		
		
		Для Счетчик = 1 По ТребуетсяИтераций Цикл
			
			ТССтрока = биг_ОбщегоНазначенияКлиентСервер.TimeStampЧислоВСтроку(ТаймСтамп);
			
			СтруктураОперации = биг_МаркетАпиКлиентСервер.СтруктураОперации_ЗагрузитьИсториюСвечей(); 			
			СтруктураОперации.Биржа 			= ИнструментыСтратегии.Биржа;
			СтруктураОперации.ИнструментИД		= ИнструментыСтратегии.ИнструментИД;
			СтруктураОперации.Бар				= ИнструментыСтратегии.Бар;
			СтруктураОперации.КоличествоСвечей	= КоличествоСвечей;
			СтруктураОперации.ТочкаДо			= ТаймСтамп * 1000; //у ОКХ формат ТС 13 символов			
			
			биг_МаркетАпи.ЗагрузитьИсториюСвечей(СтруктураОперации);
			
			ТаймСтамп = ТаймСтамп - (ИнструментыСтратегии.Бар.SecondsAmount * КоличествоСвечей);
			
		КонецЦикла;
		
		ПараметрRSI 	= 14;
        ТаймСтампRSI 	= ТаймСтамп - (ИнструментыСтратегии.Бар.SecondsAmount * ПараметрRSI); 
		
		биг_Индикаторы.ВычислитьПоказатель(ИнструментыСтратегии.Биржа, ИнструментыСтратегии.ИнструментИД, ИнструментыСтратегии.Бар,
												Перечисления.биг_ВидыИндикаторов.RSI, ПараметрRSI,,, 
												Перечисления.биг_ИсточникиДанныхТехническихИндикаторов.ЦенаЗакрытия, ТаймСтампRSI, ТекТаймСтамп);
												
												
		ПараметрМА		= 20;
		ТаймСтампМА		= ТаймСтамп - (ИнструментыСтратегии.Бар.SecondsAmount * ПараметрМА);
		биг_Индикаторы.ВычислитьПоказатель(ИнструментыСтратегии.Биржа, ИнструментыСтратегии.ИнструментИД, ИнструментыСтратегии.Бар,
												Перечисления.биг_ВидыИндикаторов.MA, ПараметрМА,,, 
												Перечисления.биг_ИсточникиДанныхТехническихИндикаторов.volCcy, ТаймСтампМА, ТекТаймСтамп); 
													
													
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьМассивАктивныхСигналов(ПараметрыИнструмента, ТаймСтамп, ТолькоАктуальные = Истина) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	биг_ДаблИмпактСигналы.Биржа КАК Биржа,
	|	биг_ДаблИмпактСигналы.ИнструментИД КАК ИнструментИД,
	|	биг_ДаблИмпактСигналы.Бар КАК Бар,
	|	биг_ДаблИмпактСигналы.ТочкаНачалаПадения КАК ТочкаНачалаПадения,
	|	биг_ДаблИмпактСигналы.СреднийОбъем КАК СреднийОбъем,
	|	биг_ДаблИмпактСигналы.УровеньСопротивления КАК УровеньСопротивления,
	|	биг_ДаблИмпактСигналы.ТочкаЗавершенияПадения КАК ТочкаЗавершенияПадения,
	|	биг_ДаблИмпактСигналы.ТочкаРазворота КАК ТочкаРазворота,
	|	биг_ДаблИмпактСигналы.ТочкаВхода1 КАК ТочкаВхода1,
	|	биг_ДаблИмпактСигналы.ТочкаВхода2 КАК ТочкаВхода2,
	|	биг_ДаблИмпактСигналы.ТочкаВыхода1 КАК ТочкаВыхода1,
	|	биг_ДаблИмпактСигналы.ТочкаВыхода2 КАК ТочкаВыхода2,
	|	биг_ДаблИмпактСигналы.ТекущееСобытие КАК ТекущееСобытие,
	|	биг_ДаблИмпактСигналы.ТочкаНачалаСобытия КАК ТочкаНачалаСобытия,
	|	биг_ДаблИмпактСигналы.СигналЗавершен КАК СигналЗавершен,
	|	биг_ДаблИмпактСигналы.ЗавершеноПоложительно КАК ЗавершеноПоложительно,
	|	биг_ДаблИмпактСигналы.ПричинаОтмены КАК ПричинаОтмены,
	|	биг_ДаблИмпактСигналы.ТочкаНачалаПаденияДатой КАК ТочкаНачалаПаденияДатой,
	|	биг_ДаблИмпактСигналы.ТочкаСигналЗавершен КАК ТочкаСигналЗавершен,
	|	биг_ДаблИмпактСигналы.ПаттернСигнала КАК ПаттернСигнала,
	|	биг_ДаблИмпактСигналы.КлючНастроек КАК КлючНастроек
	|ИЗ
	|	РегистрСведений.биг_ДаблИмпактСигналы КАК биг_ДаблИмпактСигналы
	|ГДЕ
	|	биг_ДаблИмпактСигналы.Биржа = &Биржа
	|	И НЕ биг_ДаблИмпактСигналы.СигналЗавершен
	|	И биг_ДаблИмпактСигналы.ИнструментИД = &ИнструментИД
	|	И биг_ДаблИмпактСигналы.Бар = &Бар
	|	И биг_ДаблИмпактСигналы.ТочкаНачалаПадения <= &ТаймСтамп
	|	И биг_ДаблИмпактСигналы.КлючНастроек = &КлючНастроек
	|	И НЕ биг_ДаблИмпактСигналы.СигналЗавершен
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТочкаНачалаПадения";
	
	Запрос.УстановитьПараметр("Биржа", 		ПараметрыИнструмента.Биржа);
	Запрос.УстановитьПараметр("ИнструментИД", ПараметрыИнструмента.ИнструментИД);
	Запрос.УстановитьПараметр("Бар", 		ПараметрыИнструмента.Бар);
	Запрос.УстановитьПараметр("КлючНастроек", 		ПараметрыИнструмента.КлючНастроек);
	Запрос.УстановитьПараметр("ТаймСтамп", 	ТаймСтамп);

	Если НЕ ТолькоАктуальные Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И НЕ биг_ДаблИмпактСигналы.СигналЗавершен", "");
	КонецЕсли;
	
	МассивСигналов = Новый Массив();
	
	// добавляем в массив сигналов "пустой сигнал", что бы тек. точка могла быть новым сигналом
	Сигнал = ПолучитьСтруктуруСигнала();
	ЗаполнитьЗначенияСвойств(Сигнал, ПараметрыИнструмента);
	МассивСигналов.Добавить(Сигнал);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Сигнал = ПолучитьСтруктуруСигнала();
			ЗаполнитьЗначенияСвойств(Сигнал, Выборка);
			МассивСигналов.Добавить(Сигнал);
		КонецЦикла;		
	КонецЕсли;
	
	Возврат МассивСигналов;	
		
КонецФункции

Функция ПолучитьДетальнуюИнформациюПоСигналу(Биржа, ИнструментИД, Бар, КлючНастроек, ТочкаНачалаПадения) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	биг_ДаблИмпактСигналы.Биржа КАК Биржа,
	|	биг_ДаблИмпактСигналы.ИнструментИД КАК ИнструментИД,
	|	биг_ДаблИмпактСигналы.Бар КАК Бар,
	|	биг_ДаблИмпактСигналы.КлючНастроек КАК КлючНастроек,
	|	биг_ДаблИмпактСигналы.ТочкаНачалаПадения КАК ТочкаНачалаПадения,
	|	биг_ДаблИмпактСигналы.СреднийОбъем КАК СреднийОбъем,
	|	биг_ДаблИмпактСигналы.УровеньСопротивления КАК УровеньСопротивления,
	|	биг_ДаблИмпактСигналы.ТочкаЗавершенияПадения КАК ТочкаЗавершенияПадения,
	|	биг_ДаблИмпактСигналы.ПаттернСигнала КАК ПаттернСигнала,
	|	биг_ДаблИмпактСигналы.ТочкаРазворота КАК ТочкаРазворота,
	|	биг_ДаблИмпактСигналы.ТочкаВхода1 КАК ТочкаВхода1,
	|	биг_ДаблИмпактСигналы.ТочкаВхода2 КАК ТочкаВхода2,
	|	биг_ДаблИмпактСигналы.ТочкаВыхода1 КАК ТочкаВыхода1,
	|	биг_ДаблИмпактСигналы.ТочкаВыхода2 КАК ТочкаВыхода2,
	|	биг_ДаблИмпактСигналы.ТекущееСобытие КАК ТекущееСобытие,
	|	биг_ДаблИмпактСигналы.ТочкаНачалаСобытия КАК ТочкаНачалаСобытия,
	|	биг_ДаблИмпактСигналы.ТочкаСигналЗавершен КАК ТочкаСигналЗавершен,
	|	биг_ДаблИмпактСигналы.СигналЗавершен КАК СигналЗавершен,
	|	биг_ДаблИмпактСигналы.ЗавершеноПоложительно КАК ЗавершеноПоложительно,
	|	биг_ДаблИмпактСигналы.ПричинаОтмены КАК ПричинаОтмены,
	|	биг_ДаблИмпактСигналы.ТочкаНачалаПаденияДатой КАК ТочкаНачалаПаденияДатой
	|ИЗ
	|	РегистрСведений.биг_ДаблИмпактСигналы КАК биг_ДаблИмпактСигналы
	|ГДЕ
	|	биг_ДаблИмпактСигналы.Биржа = &Биржа
	|	И биг_ДаблИмпактСигналы.ИнструментИД = &ИнструментИД
	|	И биг_ДаблИмпактСигналы.Бар = &Бар
	|	И биг_ДаблИмпактСигналы.КлючНастроек = &КлючНастроек
	|	И биг_ДаблИмпактСигналы.ТочкаНачалаПадения = &ТочкаНачалаПадения";
	
	Запрос.УстановитьПараметр("Биржа", Биржа);
	Запрос.УстановитьПараметр("ИнструментИД", ИнструментИД);
	Запрос.УстановитьПараметр("Бар", Бар);
	Запрос.УстановитьПараметр("КлючНастроек", КлючНастроек);
	Запрос.УстановитьПараметр("ТочкаНачалаПадения", ТочкаНачалаПадения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Сигнал = ПолучитьСтруктуруСигнала();
	ЗаполнитьЗначенияСвойств(Сигнал, Выборка);
	
	Возврат Сигнал;
	
КонецФункции

Функция НайтиОперациюПоСобытиюСигнала(Сигнал, Событие, Аккаунт) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	биг_ДаблИмпактОперации.Операция КАК Операция
	|ИЗ
	|	РегистрСведений.биг_ДаблИмпактОперации КАК биг_ДаблИмпактОперации
	|ГДЕ
	|	биг_ДаблИмпактОперации.Биржа = &Биржа
	|	И биг_ДаблИмпактОперации.ИнструментИД = &ИнструментИД
	|	И биг_ДаблИмпактОперации.ТочкаНачалаПадения = &ТочкаНачалаПадения
	|	И биг_ДаблИмпактОперации.Аккаунт = &Аккаунт
	|	И биг_ДаблИмпактОперации.Событие = &Событие
	|	И биг_ДаблИмпактОперации.НастройкаСтратегии = &НастройкаСтратегии";
	
	Запрос.УстановитьПараметр("Биржа", 				ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Аккаунт, "Владелец"));
	Запрос.УстановитьПараметр("ИнструментИД", 		Сигнал.ИнструментИД);
	Запрос.УстановитьПараметр("ТочкаНачалаПадения", Сигнал.ТочкаНачалаПадения);
	Запрос.УстановитьПараметр("Аккаунт", 			Аккаунт);
	Запрос.УстановитьПараметр("Событие", 			Событие);
	Запрос.УстановитьПараметр("НастройкаСтратегии",	Сигнал.КлючНастроек);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		Возврат Выборка.Операция;
	КонецЕсли;
			
КонецФункции

Функция СтратегияДаблИмпакт() Экспорт
	
	Возврат биг_ОбщегоНазначенияКлиентСервер.ПолучитьЗначениеПоИмени("СтратегияDoubleImpact2", Истина);
		
КонецФункции

Функция ПолучитьЦенуПоИсторическимДанным(Сигнал, Запись, ТаймСтамп) Экспорт
	
	Бар = Справочники.big_BarTypes.H1;
	
	// TODO: сделать процедуру универсальным методом через ОМ МаркетАпи, а не сразу ОКХ
	Возврат биг_ОКХ_Сервер.ПолучитьЗначенияСвечиПоТочкеСПодборомФрейма(Сигнал.ИнструментИД, ТаймСтамп, Бар);
	
КонецФункции

// Функция ПолучитьДанныеСвечейПоТочке
//
// Параметры:
// параметрыВыборки - Структура - описание см. биг_ОбщегоНазначения.ПолучитьСтруктуруПараметровЗапросаДанныхПоСвечам() 
//
// Возвращаемое значение: 
// ТаблицаЗначений - Колонки см. РегистрСведений.биг_ДанныеСвечей
Функция ПолучитьДанныеСвечейПоТочке_ДаблИмпакт(ПараметрыЗапроса) Экспорт
	
	// Пока что отключаю повторное использование. 
	
	//Биржа 								= ПараметрыЗапроса.Биржа;
	//ИнструментИД 						= ПараметрыЗапроса.ИнструментИД;
	//Бар 								= ПараметрыЗапроса.Бар;
	//ТочкаВремениТС_НачалоПериода 		= ПараметрыЗапроса.ТочкаВремениТС_НачалоПериода;
	//ТочкаВремениТС_ЗавершениеПериода 	= ПараметрыЗапроса.ТочкаВремениТС_ЗавершениеПериода;
	//КоличествоСвечей 					= ПараметрыЗапроса.КоличествоСвечей;
	//ИсключаяПереданнуюТочку 			= ПараметрыЗапроса.ИсключаяПереданнуюТочку;
	//ТолькоЗавершенные 					= ПараметрыЗапроса.ТолькоЗавершенные;
	//ОграничениеПериода 					= ПараметрыЗапроса.ОграничениеПериода;
	//СортировкаПоУбыванию 				= ПараметрыЗапроса.СортировкаПоУбыванию;
	//
	//Возврат биг_ДаблИмпактПовтИсп.ПолучитьДанныеСвечейПоТочке_ДаблИмпакт(Биржа, ИнструментИД, Бар, ТочкаВремениТС_НачалоПериода, ТочкаВремениТС_ЗавершениеПериода,
	//																КоличествоСвечей, ИсключаяПереданнуюТочку, ТолькоЗавершенные, ОграничениеПериода, СортировкаПоУбыванию);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	биг_ДанныеСвечей.Биржа КАК Биржа,
	|	биг_ДанныеСвечей.ИнструментИД КАК ИнструментИД,
	|	биг_ДанныеСвечей.Бар КАК Бар,
	|	биг_ДанныеСвечей.TimeStamp КАК TimeStamp,
	|	биг_ДанныеСвечей.TimeStamp13 КАК TimeStamp13,
	|	биг_ДанныеСвечей.TimeStamp10 КАК TimeStamp10,
	|	биг_ДанныеСвечей.ДатаОткрытия КАК ДатаОткрытия,
	|	биг_ДанныеСвечей.ЦенаОткрытия КАК ЦенаОткрытия,
	|	биг_ДанныеСвечей.ЦенаМаксимум КАК ЦенаМаксимум,
	|	биг_ДанныеСвечей.ЦенаМинимум КАК ЦенаМинимум,
	|	биг_ДанныеСвечей.ЦенаЗакрытия КАК ЦенаЗакрытия,
	|	биг_ДанныеСвечей.Объем КАК Объем,
	|	биг_ДанныеСвечей.volCcy КАК volCcy,
	|	биг_ДанныеСвечей.volCcyQuote КАК volCcyQuote,
	|	биг_ДанныеСвечей.confirm КАК confirm,
	|	ЕСТЬNULL(ИндикаторRSI.Значение, 100) КАК ЦенаЗакрытияRSI14,
	|	ЕСТЬNULL(ИндикаторVolumeMA.Значение, 0) КАК volCcyMA20
	|ИЗ
	|	РегистрСведений.биг_ДанныеСвечей КАК биг_ДанныеСвечей
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.биг_ЗначенияИндикаторов КАК ИндикаторRSI
	|		ПО биг_ДанныеСвечей.Биржа = ИндикаторRSI.Биржа
	|			И биг_ДанныеСвечей.ИнструментИД = ИндикаторRSI.ИнструментИД
	|			И биг_ДанныеСвечей.Бар = ИндикаторRSI.Бар
	|			И биг_ДанныеСвечей.TimeStamp = ИндикаторRSI.TimeStamp
	|			И (ИндикаторRSI.Источник = ЗНАЧЕНИЕ(Перечисление.биг_ИсточникиДанныхТехническихИндикаторов.ЦенаЗакрытия))
	|			И (ИндикаторRSI.Индикатор1 = ЗНАЧЕНИЕ(Перечисление.биг_ВидыИндикаторов.RSI))
	|			И (ИндикаторRSI.Параметр1 = 14)
	|			И (ИндикаторRSI.Индикатор2 = ЗНАЧЕНИЕ(Перечисление.биг_ВидыИндикаторов.ПустаяСсылка))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.биг_ЗначенияИндикаторов КАК ИндикаторVolumeMA
	|		ПО биг_ДанныеСвечей.Биржа = ИндикаторVolumeMA.Биржа
	|			И биг_ДанныеСвечей.ИнструментИД = ИндикаторVolumeMA.ИнструментИД
	|			И биг_ДанныеСвечей.Бар = ИндикаторVolumeMA.Бар
	|			И биг_ДанныеСвечей.TimeStamp = ИндикаторVolumeMA.TimeStamp
	|			И (ИндикаторVolumeMA.Источник = ЗНАЧЕНИЕ(Перечисление.биг_ИсточникиДанныхТехническихИндикаторов.volCcy))
	|			И (ИндикаторVolumeMA.Индикатор1 = ЗНАЧЕНИЕ(Перечисление.биг_ВидыИндикаторов.MA))
	|			И (ИндикаторVolumeMA.Параметр1 = 20)
	|			И (ИндикаторVolumeMA.Индикатор2 = ЗНАЧЕНИЕ(Перечисление.биг_ВидыИндикаторов.ПустаяСсылка))
	|ГДЕ
	|	биг_ДанныеСвечей.Биржа = &Биржа
	|	И биг_ДанныеСвечей.ИнструментИД = &ИнструментИД
	|	И биг_ДанныеСвечей.Бар = &Бар
	|	И биг_ДанныеСвечей.TimeStamp МЕЖДУ &НачалоПериода И &ЗавершениеПериода
	|	И биг_ДанныеСвечей.TimeStamp <= &ОграничениеПериода
	|	%УсловиеТолькоЗавершенная%
	|
	|УПОРЯДОЧИТЬ ПО
	|	TimeStamp %УсловиеСортировки%";
	
	биг_ОбщегоНазначения.ПолучитьДанныеСвечейПоТочке_УстановитьПараметрыЗапроса(Запрос, ПараметрыЗапроса);
	ДанныеСвечей = Запрос.Выполнить().Выгрузить();
	
	Возврат ДанныеСвечей;
	
КонецФункции

#КонецОбласти //СлужебныйИнтерфейс


#Область Бектест

Процедура ПровестиБекТестирование(ПараметрыИнструмента, АдресРезультата = Неопределено) Экспорт
		
	Если НЕ ПараметрыИнструмента.Свойство("ФиксироватьДлительность") Тогда
		ПараметрыИнструмента.Вставить("ПараметрыИнструмента", Ложь);	
	КонецЕсли;
	
	Если ПараметрыИнструмента.ФиксироватьДлительность Тогда
		ВремяНачала = ОценкаПроизводительности.НачатьЗамерВремени();	
	КонецЕсли;	
	
	ТочкаОтсчетаТС 		= ПараметрыИнструмента.ТочкаОтсчетаТС;
	КоличествоИтераций 	= ПараметрыИнструмента.КоличествоИтераций;
	
	// откатываем состояние инструмента
	
	ЗаписатьТочкуНаЛинииВремени(ПараметрыИнструмента.Биржа, ПараметрыИнструмента.ИнструментИД, ПараметрыИнструмента.Бар, ПараметрыИнструмента.КлючНастроек, ТочкаОтсчетаТС);
	УдалитьСигналыПослеТочки(ПараметрыИнструмента, ТочкаОтсчетаТС);	
	СтеретьЗафиксированныеОперации(ПараметрыИнструмента, ТочкаОтсчетаТС);
	
	ШагПрогресса 		= Цел(КоличествоИтераций / 100);
	СчетчикПрогресса 	= 0;
	Прогресс			= 0;
	
	Для Сч = 1 По КоличествоИтераций Цикл
		
		ПроверитьОперацииПоАктивнымСигналам(ТочкаОтсчетаТС, Истина, ПараметрыИнструмента.КлючНастроек, ПараметрыИнструмента.ИнструментИД, ПараметрыИнструмента.Биржа);
		ОбработатьИнструмент(ПараметрыИнструмента, ТочкаОтсчетаТС, Истина);
		
		ТочкаОтсчетаТС 	= ТочкаОтсчетаТС + ПараметрыИнструмента.Бар.SecondsAmount;		
		СчетчикПрогресса = СчетчикПрогресса + 1;
		Если СчетчикПрогресса = ШагПрогресса Тогда
			Прогресс 			= Прогресс + 1;
			СчетчикПрогресса 	= 0;
			
			ДлительныеОперации.СообщитьПрогресс(Прогресс);
		КонецЕсли;
	КонецЦикла;                                                                                                                
		
	Если ПараметрыИнструмента.ФиксироватьДлительность Тогда 		
		КоличествоСигналов = ПолучитьКоличествоСигналовИнструмента(ПараметрыИнструмента);
		ОценкаПроизводительности.ЗакончитьЗамерВремени(ПараметрыИнструмента.НаименованиеЗадания, ВремяНачала, КоличествоСигналов);					
	КонецЕсли;
	
	Если АдресРезультата <> Неопределено Тогда
		УдалитьИзВременногоХранилища(АдресРезультата);
	КонецЕсли;
	
	ЗаписьРезультата = РегистрыСведений.биг_РезультатыБектестов.СоздатьМенеджерЗаписи();
	ЗаписьРезультата.Биржа			= ПараметрыИнструмента.Биржа;
	ЗаписьРезультата.ИнструментИД	= ПараметрыИнструмента.ИнструментИД;
	ЗаписьРезультата.Бар			= ПараметрыИнструмента.Бар;
	ЗаписьРезультата.КлючНастроек	= ПараметрыИнструмента.КлючНастроек; 
	ЗаписьРезультата.Выполнен		= Истина;
	ЗаписьРезультата.Записать(Истина);
	
КонецПроцедуры

Процедура УдалитьСигналыПослеТочки(ПараметрыИнструмента, ТочкаВозвратаТС)
	
	Набор	= РегистрыСведений.биг_ДаблИмпактСигналы.СоздатьНаборЗаписей();
	Набор.Отбор.Биржа.Установить(ПараметрыИнструмента.Биржа);
	Набор.Отбор.ИнструментИД.Установить(ПараметрыИнструмента.ИнструментИД);
	Набор.Отбор.Бар.Установить(ПараметрыИнструмента.Бар);
	Набор.Отбор.КлючНастроек.Установить(ПараметрыИнструмента.КлючНастроек);
	Набор.Прочитать();
	
	МассивУдалить = Новый Массив;
	
	Для каждого Строка Из Набор Цикл
		Если Строка.ТочкаНачалаПадения > ТочкаВозвратаТС Тогда
			МассивУдалить.Добавить(Строка);	
		КонецЕсли;
	КонецЦикла;                            
	
	Для каждого Строка Из МассивУдалить Цикл
		Набор.Удалить(Строка);
	КонецЦикла;
	
	Набор.Записать(Истина);
	
КонецПроцедуры

Процедура СтеретьЗафиксированныеОперации(ПараметрыИнструмента, ТочкаВозвратаТС)
	
	Набор = РегистрыСведений.биг_ДаблИмпактОперации.СоздатьНаборЗаписей();
	Набор.Отбор.Биржа.Установить(ПараметрыИнструмента.Биржа);
	Набор.Отбор.ИнструментИД.Установить(ПараметрыИнструмента.ИнструментИД);
	Набор.Отбор.НастройкаСтратегии.Установить(ПараметрыИнструмента.КлючНастроек);
	
	Набор.Прочитать();
	
	МассивУдалить = Новый Массив();
	
	Для каждого Строка Из Набор Цикл
		Если Строка.ТочкаНачалаПадения > ТочкаВозвратаТС Тогда
			
			Операция = Строка.Операция;
			КлючНастройкиОперации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Операция, "НастройкаСтратегии");
			
			Если КлючНастройкиОперации = ПараметрыИнструмента.КлючНастроек Тогда
				МассивУдалить.Добавить(Строка);	
			КонецЕсли;				
		КонецЕсли;	
	КонецЦикла;                      
	
	Для каждого СтрокаНабора Из МассивУдалить Цикл
		ДокументОбъект = СтрокаНабора.Операция.ПолучитьОбъект();
		ДокументОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		
		УдалитьИсториюЗначенийДокумента(СтрокаНабора.Операция, ТочкаВозвратаТС);
		
		ДокументОбъект.Удалить();
		
		Набор.Удалить(СтрокаНабора);
	КонецЦикла;
	
	Набор.Записать(Истина);
	
КонецПроцедуры 

Процедура УдалитьИсториюЗначенийДокумента(Операция, ТочкаВозвратаТС)
	
	ТочкаПроверки = биг_ОбщегоНазначенияКлиентСервер.TimestampВДату(ТочкаВозвратаТС);
	Если ТипЗнч(Операция) = Тип("ДокументСсылка.big_AlgoOrders_OKX") Тогда
		
		Набор = РегистрыСведений.биг_ОКХ_ИсторияАлгоОрдеров.СоздатьНаборЗаписей();
		Набор.Отбор.Документ.Установить(Операция);
		Набор.Прочитать();
		
		МассивУдалить = Новый Массив;
		
		Для каждого Строка Из Набор Цикл
			Если Строка.Период > ТочкаПроверки Тогда
				МассивУдалить.Добавить(Строка);	
			КонецЕсли;
		КонецЦикла;                            
		
		Для каждого Строка Из МассивУдалить Цикл
			Набор.Удалить(Строка);
		КонецЦикла;
		
		Набор.Записать(Истина);
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти //Бектест 


#Область АнализСигнала


#Область КлючевыеШаги

Процедура ВыполнениеСигнала(Сигнал, КлючНастроек, ТаймСтамп, ШагВыполнен);
    	  	
	// если точки нет, тогда поиск точки начала падения
	Если Сигнал.ТекущееСобытие = Неопределено Тогда
		
		ПоискТочкиНачалаПадения(Сигнал, КлючНастроек, ТаймСтамп, ШагВыполнен);
		
	ИначеЕсли Сигнал.ТекущееСобытие = Перечисления.биг_ДаблИмпактEvents.ПоискТочкиЗавершенияПадения Тогда
	
		ПоискТочкиЗавершенияПадения(Сигнал, ТаймСтамп, ШагВыполнен);
		
	ИначеЕсли Сигнал.ТекущееСобытие = Перечисления.биг_ДаблИмпактEvents.ПоискТочкиРазворота Тогда
		
		ПоискТочкиРазворота(Сигнал, ТаймСтамп, ШагВыполнен);
		
	ИначеЕсли Сигнал.ТекущееСобытие = Перечисления.биг_ДаблИмпактEvents.ПоискТочкиВходаОдин Тогда
		
		ПоискТочкиВходаОдин(Сигнал, ТаймСтамп, ШагВыполнен);
			
	ИначеЕсли Сигнал.ТекущееСобытие = Перечисления.биг_ДаблИмпактEvents.ПоискТочкиВходаДва Тогда		
		
		ПоискТочкиВходаДва(Сигнал, ТаймСтамп, ШагВыполнен); // (пробой вверх)
		
	ИначеЕсли Сигнал.ТекущееСобытие = Перечисления.биг_ДаблИмпактEvents.МониторингУровняСтопЛосс Тогда
		
		МониторингКоррекцияУровняСтопЛосс(Сигнал, ТаймСтамп, ШагВыполнен);
	КонецЕсли;	
	
КонецПроцедуры

Процедура ПоискТочкиНачалаПадения(Сигнал, КлючНастроек, ТаймСтамп, ШагВыполнен)
	
	ПериодАнализа		= ПолучитьЗначениеПараметраСтратегии("ДИ_1_ТочкаНачалаПадения_ПериодАнализа", КлючНастроек);
	ЦелевоеОтклонение	= ПолучитьЗначениеПараметраСтратегии("ДИ_1_ТочкаНачалаПадения_ЦелевоеОтклонение", КлючНастроек);
	
	ПараметрыЗапроса 	= биг_ОбщегоНазначения.ПолучитьСтруктуруПараметровЗапросаДанныхПоСвечам();
	ЗаполнитьЗначенияСвойств(ПараметрыЗапроса, Сигнал); 
	
	ПараметрыЗапроса.ТочкаВремениТС_ЗавершениеПериода 	= ТаймСтамп;
	ПараметрыЗапроса.КоличествоСвечей					= ПериодАнализа;
	ПараметрыЗапроса.СортировкаПоУбыванию				= Истина;	
		
	ДанныеСвечей 		= ПолучитьДанныеСвечейПоТочке_ДаблИмпакт(ПараметрыЗапроса);
	Если ДанныеСвечей.Количество() = 0 Тогда
		Возврат;	
	КонецЕсли; 
	
	Если НЕ Сигнал.Бектест Тогда
        Если НЕ ПроверитьНаличиеАктуальнойСвечи(ДанныеСвечей, ПараметрыЗапроса.СортировкаПоУбыванию, Сигнал.Бар, ТаймСтамп) Тогда
			
			// бывает, что обработка данных начата раньше, чем свежая свеча пришла
			ШагВыполнен = Ложь;
			Возврат;
		КонецЕсли;		
	КонецЕсли;
	
	ТочкаНачалаПадения 	= НайтиТочкуСЦелевымОтклонением(ДанныеСвечей, ЦелевоеОтклонение);
	
	Если ЗначениеЗаполнено(ТочкаНачалаПадения) Тогда
		ЗафиксироватьТочкуНачалаПадения(Сигнал, ТочкаНачалаПадения, КлючНастроек);	
	КонецЕсли;        

	ШагВыполнен = Истина;
	
КонецПроцедуры

Процедура ПоискТочкиЗавершенияПадения(Сигнал, ТаймСтамп, ШагВыполнен)
	
	ПериодАнализа		= ПолучитьЗначениеПараметраСтратегии("ДИ_2_ЗавершениеПадения_ПериодАнализа", Сигнал.КлючНастроек);
	
	ПараметрыЗапроса 	= биг_ОбщегоНазначения.ПолучитьСтруктуруПараметровЗапросаДанныхПоСвечам();
	ЗаполнитьЗначенияСвойств(ПараметрыЗапроса, Сигнал); 
	
	ПараметрыЗапроса.ТочкаВремениТС_НачалоПериода 		= Сигнал.ТочкаНачалаСобытия;
	ПараметрыЗапроса.КоличествоСвечей					= ПериодАнализа;
	ПараметрыЗапроса.ОграничениеПериода                 = ТаймСтамп;
	
	ДанныеСвечей 		= ПолучитьДанныеСвечейПоТочке_ДаблИмпакт(ПараметрыЗапроса);
	
	Если НЕ Сигнал.Бектест Тогда
        Если НЕ ПроверитьНаличиеАктуальнойСвечи(ДанныеСвечей, ПараметрыЗапроса.СортировкаПоУбыванию, Сигнал.Бар, ТаймСтамп) Тогда
			
			// бывает, что обработка данных начата раньше, чем свежая свеча пришла
			ШагВыполнен = Ложь;
			Возврат;
		КонецЕсли;		
	КонецЕсли;
	
	ПараметрыПроверки 	= ПолучитьСтруктуруПроверкиТочкиЗавершенияПадения();	
	
	ТочкаЗавершенияПадения_ПроверкаТриКрасных(ДанныеСвечей, ПараметрыПроверки, Сигнал);	
	Если ПараметрыПроверки.ПроверкаШаблон И ПараметрыПроверки.ПроверкаДоп Тогда
		
		ЗафиксироватьТочкуЗавершенияПадения(Сигнал, ДанныеСвечей, Перечисления.биг_ДаблИмпактPatterns.ТриКрасных);
		Возврат;
	КонецЕсли;
			
	ТочкаЗавершенияПадения_СемьИзВосьми(ДанныеСвечей, ПараметрыПроверки, Сигнал);	
	Если ПараметрыПроверки.ПроверкаШаблон И ПараметрыПроверки.ПроверкаДоп Тогда 
	
		ЗафиксироватьТочкуЗавершенияПадения(Сигнал, ДанныеСвечей, Перечисления.биг_ДаблИмпактPatterns.СемьИзВосьми);
		Возврат;
	КонецЕсли;
		  	 			
	Если ПараметрыПроверки.ПрерватьСигнал Тогда
		
		ПрерватьОбработкуТекущегоСигнала(Сигнал, ПараметрыПроверки.ПричинаОтмены, ПараметрыПроверки.ТочкаОтмены);
	КонецЕсли;
	
	ШагВыполнен = Истина;
	
КонецПроцедуры

Процедура ПоискТочкиРазворота(Сигнал, ТаймСтамп, ШагВыполнен)
	
	ПериодАнализа		= ПолучитьЗначениеПараметраСтратегии("ДИ_3_ПоискТочкиРазворота_ПериодАнализа", Сигнал.КлючНастроек); 
	
	ПараметрыЗапроса 	= биг_ОбщегоНазначения.ПолучитьСтруктуруПараметровЗапросаДанныхПоСвечам();
	ЗаполнитьЗначенияСвойств(ПараметрыЗапроса, Сигнал); 
	
	ПараметрыЗапроса.ТочкаВремениТС_НачалоПериода 		= Сигнал.ТочкаНачалаСобытия;
	ПараметрыЗапроса.КоличествоСвечей					= ПериодАнализа;
	ПараметрыЗапроса.ОграничениеПериода                 = ТаймСтамп;
	ПараметрыЗапроса.ИсключаяПереданнуюТочку 			= Истина;
	
	ДанныеСвечей 		= ПолучитьДанныеСвечейПоТочке_ДаблИмпакт(ПараметрыЗапроса);
	
	Если НЕ Сигнал.Бектест Тогда
        Если НЕ ПроверитьНаличиеАктуальнойСвечи(ДанныеСвечей, ПараметрыЗапроса.СортировкаПоУбыванию, Сигнал.Бар, ТаймСтамп) Тогда
			
			// бывает, что обработка данных начата раньше, чем свежая свеча пришла
			ШагВыполнен = Ложь;
			Возврат;
		КонецЕсли;		
	КонецЕсли;
	
	ТочкаНайдена		= Ложь;
	
	Для каждого Свеча Из ДанныеСвечей Цикл
		
		Если биг_ОбщегоНазначения.ЭтоЗеленаяСвеча(Свеча) Тогда
			
			КоэффициентОбъема = Свеча.volCcy / Свеча.volCcyMA20;
			Если КоэффициентОбъема >= 1 Тогда
				ЗафиксироватьТочкуРазворота(Сигнал, Свеча);
				ТочкаНайдена = Истина;
			КонецЕсли; 
			
		КонецЕсли;		
	КонецЦикла;                                                                         
	
	// если получены все 30 свечей (т.е. мы уже 30 свечей ждем разворот)
	// но он так и не обнаружен - отменяем сигнал
	Если НЕ ТочкаНайдена И ДанныеСвечей.Количество() >= ПериодАнализа Тогда
		ЗавершитьСигналОтрицательно(Сигнал, "Не обнаружена точка разворота", ТаймСтамп);	
	КонецЕсли;
	
	ШагВыполнен = Истина;
	
КонецПроцедуры

Процедура ПоискТочкиВходаОдин(Сигнал, ТаймСтамп, ШагВыполнен)
	
	ПериодАнализа		= ПолучитьЗначениеПараметраСтратегии("ДИ_4_ПоискТочкиВходаОдин_ПериодАнализа", Сигнал.КлючНастроек);	      
	
	ПараметрыЗапроса 	= биг_ОбщегоНазначения.ПолучитьСтруктуруПараметровЗапросаДанныхПоСвечам();
	ЗаполнитьЗначенияСвойств(ПараметрыЗапроса, Сигнал); 
	
	ПараметрыЗапроса.ТочкаВремениТС_НачалоПериода 		= Сигнал.ТочкаНачалаСобытия;
	ПараметрыЗапроса.КоличествоСвечей					= ПериодАнализа;
	ПараметрыЗапроса.ОграничениеПериода                 = ТаймСтамп;
	
	ДанныеСвечей 		= биг_ОбщегоНазначения.ПолучитьДанныеСвечейПоТочке(ПараметрыЗапроса);	         	
	
	Если НЕ Сигнал.Бектест Тогда
        Если НЕ ПроверитьНаличиеАктуальнойСвечи(ДанныеСвечей, ПараметрыЗапроса.СортировкаПоУбыванию, Сигнал.Бар, ТаймСтамп) Тогда
			
			// бывает, что обработка данных начата раньше, чем свежая свеча пришла
			ШагВыполнен = Ложь;
			Возврат;
		КонецЕсли;		
	КонецЕсли;
	
	ПараметрыПроверки 	= ПолучитьСтруктуруПроверкиТочкиЗавершенияПадения();
		
	ТочкаВходаОдин_ДвеИзТрехЗеленых(Сигнал, ДанныеСвечей, ПараметрыПроверки);	
	Если ПараметрыПроверки.ПроверкаШаблон И ПараметрыПроверки.ПроверкаДоп Тогда
		ЗафиксироватьТочкуВходаОдин(Сигнал, ДанныеСвечей, ТаймСтамп);
		Возврат;
	КонецЕсли;
	     		
	ТочкаВходаОдин_ТриИзШестиЗеленых(Сигнал, ДанныеСвечей, ПараметрыПроверки);
	Если ПараметрыПроверки.ПроверкаШаблон И ПараметрыПроверки.ПроверкаДоп Тогда
	
		ЗафиксироватьТочкуВходаОдин(Сигнал, ДанныеСвечей, ТаймСтамп);
		Возврат;
	КонецЕсли;
	         	
	Если ПараметрыПроверки.ПрерватьСигнал Тогда
		
		ПрерватьОбработкуТекущегоСигнала(Сигнал, ПараметрыПроверки.ПричинаОтмены, ПараметрыПроверки.ТочкаОтмены); 
	КонецЕсли;

	ШагВыполнен = Истина;
	
КонецПроцедуры

Процедура ПоискТочкиВходаДва(Сигнал, ТаймСтамп, ШагВыполнен)

	ПериодАнализа		= ПолучитьЗначениеПараметраСтратегии("ДИ_5_ПоискТочкиВходаДва_ПериодАнализа", Сигнал.КлючНастроек);
	
	ПараметрыЗапроса 	= биг_ОбщегоНазначения.ПолучитьСтруктуруПараметровЗапросаДанныхПоСвечам();
	ЗаполнитьЗначенияСвойств(ПараметрыЗапроса, Сигнал); 
	
	ПараметрыЗапроса.ТочкаВремениТС_НачалоПериода 		= Сигнал.ТочкаНачалаСобытия;
	ПараметрыЗапроса.КоличествоСвечей					= ПериодАнализа;
	ПараметрыЗапроса.ОграничениеПериода                 = ТаймСтамп;
	
	ДанныеСвечей 		= ПолучитьДанныеСвечейПоТочке_ДаблИмпакт(ПараметрыЗапроса);

	Если НЕ Сигнал.Бектест Тогда
        Если НЕ ПроверитьНаличиеАктуальнойСвечи(ДанныеСвечей, ПараметрыЗапроса.СортировкаПоУбыванию, Сигнал.Бар, ТаймСтамп) Тогда
			
			// бывает, что обработка данных начата раньше, чем свежая свеча пришла
			ШагВыполнен = Ложь;
			Возврат;
		КонецЕсли;		
	КонецЕсли;
	
	ОбъемВыше 						= Ложь;
	ЗеленаяСвеча 					= Ложь;
	ЦенаЗакрытияВышеСопротивления 	= Ложь;
	
	// на хх% выше среднего объема
	КоэффициентМинимальногоПревышенияОбъема = ПолучитьЗначениеПараметраСтратегии("ДИ_5_ПоискТочкиВходаДва_КоэффициентОбъемаСигналаПробития", Сигнал.КлючНастроек);
	УровеньСопротивления					= Сигнал.УровеньСопротивления;
	              
	Для каждого Свеча Из ДанныеСвечей Цикл
		
		КоэффициентПревышения 			= Свеча.volCcy / Свеча.volCcyMA20;
		
		ОбъемВыше						= КоэффициентПревышения > КоэффициентМинимальногоПревышенияОбъема; 
		ЗеленаяСвеча 					= биг_ОбщегоНазначения.ЭтоЗеленаяСвеча(Свеча);
		ЦенаЗакрытияВышеСопротивления 	= Свеча.ЦенаЗакрытия > УровеньСопротивления;
		
		Если ОбъемВыше И ЗеленаяСвеча И ЦенаЗакрытияВышеСопротивления Тогда
			
			ЗафиксироватьТочкуВходаДва(Сигнал, ДанныеСвечей, ТаймСтамп);			
		КонецЕсли;		
	КонецЦикла;
	
	ШагВыполнен = Истина;
	
КонецПроцедуры

Процедура МониторингКоррекцияУровняСтопЛосс(Сигнал, ТаймСтамп, ШагВыполнен)

	ПараметрыЗапроса 	= биг_ОбщегоНазначения.ПолучитьСтруктуруПараметровЗапросаДанныхПоСвечам();
	ЗаполнитьЗначенияСвойств(ПараметрыЗапроса, Сигнал); 
	
	ПараметрыЗапроса.СортировкаПоУбыванию		 		= Истина;
	ПараметрыЗапроса.КоличествоСвечей					= 1;        
	ПараметрыЗапроса.ТочкаВремениТС_ЗавершениеПериода   = ТаймСтамп;
	ПараметрыЗапроса.ОграничениеПериода                 = ТаймСтамп;
	
	ДанныеСвечей 		= биг_ОбщегоНазначения.ПолучитьДанныеСвечейПоТочке(ПараметрыЗапроса);
	Если ДанныеСвечей.Количество() = 0 Тогда
		ВызватьИсключение "Не удалось получить информацию о свечах";
	КонецЕсли;                                                    

	Если НЕ Сигнал.Бектест Тогда
        Если НЕ ПроверитьНаличиеАктуальнойСвечи(ДанныеСвечей, ПараметрыЗапроса.СортировкаПоУбыванию, Сигнал.Бар, ТаймСтамп) Тогда
			
			// бывает, что обработка данных начата раньше, чем свежая свеча пришла
			ШагВыполнен = Ложь;
			Возврат;
		КонецЕсли;		
	КонецЕсли;
	
	ПоследняяСвеча 				= ДанныеСвечей[0];
	
	// собираем все аккаунты, подключенные к этому инструменту текущей биржи
	ТаблицаУчастников 			= СобратьАккаунтыДляРеакцииНаСигнал(Сигнал);
	                                                                                                                     
	Для каждого Запись Из ТаблицаУчастников Цикл
		
		Аккаунт 				= Запись.Участник;
		СтопЛос 				= НайтиСтопЛос(Сигнал, Аккаунт);
		
		// КОСТЫЛЬ!!! 
		Если СтопЛос <> Неопределено Тогда  
			
			// в начале сигнала нужно мерить уровень изменения относительно цены второго входа
			// и поднимаем СЛ, когда цена там изменится. А вот когда Триггер СЛ > Цены входа, тогда меряем от него
			ВторойВход				= НайтиОперациюПоСобытиюСигнала(Сигнал, Перечисления.биг_ДаблИмпактEvents.ПоискТочкиВходаДва, Запись.Участник);
			ДанныеВторогоВхода		= биг_МаркетАпи.ПолучитьКлючевыеДанныеОперации(ВторойВход);
			ТриггерСЛ 				= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтопЛос, "slTriggerPx");
			
			УровеньСнизу			= Макс(ДанныеВторогоВхода.ЦенаЗаполнено, ТриггерСЛ);
			УровеньСверху			= ПоследняяСвеча.ЦенаЗакрытия;
			
			НовыйТриггерСЛ			= РассчитатьНовыйУровеньСтопЛосс(Сигнал, УровеньСверху, УровеньСнизу);
			
			Если НовыйТриггерСЛ > ТриггерСЛ Тогда
					
				НовыйУровеньСтопЛосс	= -1;			
				ИзменитьСтопЛосс(Аккаунт, СтопЛос, НовыйТриггерСЛ, НовыйУровеньСтопЛосс, Сигнал, ТаймСтамп);
			КонецЕсли;	
			
		ИначеЕсли Сигнал.Бектест Тогда
			
			// при размещении ордера происходит ошибка, документ не создается. причину пока не выяснил 
			// ОТКАТИМ СИГНАЛ  
			ТочкаСбросаТС = Сигнал.ТочкаНачалаПадения - Сигнал.Бар.SecondsAmount;
			СброситьСигнал(Сигнал, ТочкаСбросаТС);			 
		КонецЕсли;		
			
	КонецЦикла;	 
	
	ШагВыполнен = Истина;
	
КонецПроцедуры


Процедура ПрерватьОбработкуТекущегоСигнала(Сигнал, ПричинаОтмены, ТочкаОтмены)
		
	Запись = ПолучитьЗаписьСобытийСигнала(Сигнал);
	 
	Запись.ТочкаСигналЗавершен	= ТочкаОтмены;
	Запись.СигналЗавершен 		= Истина;
	Запись.ПричинаОтмены		= ПричинаОтмены;
	Запись.Записать(Истина);		
	
	биг_ПодсистемаОповещений.ВнутреннееОповещениеПоЗаписиСигнала(Сигнал, Запись);
	
КонецПроцедуры

Процедура ЗавершитьСигналУспешно(Сигнал, ТочкаЗавершения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	биг_ДаблИмпактСигналы.Биржа КАК Биржа,
	|	биг_ДаблИмпактСигналы.ИнструментИД КАК ИнструментИД,
	|	биг_ДаблИмпактСигналы.Бар КАК Бар,
	|	биг_ДаблИмпактСигналы.КлючНастроек КАК КлючНастроек,
	|	биг_ДаблИмпактСигналы.ТочкаНачалаПадения КАК ТочкаНачалаПадения,
	|	биг_ДаблИмпактСигналы.УровеньСопротивления КАК УровеньСопротивления,
	|	биг_ДаблИмпактСигналы.ТочкаЗавершенияПадения КАК ТочкаЗавершенияПадения,
	|	биг_ДаблИмпактСигналы.ПаттернСигнала КАК ПаттернСигнала,
	|	биг_ДаблИмпактСигналы.ТочкаРазворота КАК ТочкаРазворота,
	|	биг_ДаблИмпактСигналы.ТочкаВхода1 КАК ТочкаВхода1,
	|	биг_ДаблИмпактСигналы.ТочкаВхода2 КАК ТочкаВхода2,
	|	биг_ДаблИмпактСигналы.ТочкаВыхода1 КАК ТочкаВыхода1,
	|	биг_ДаблИмпактСигналы.ТочкаВыхода2 КАК ТочкаВыхода2,
	|	биг_ДаблИмпактСигналы.ТекущееСобытие КАК ТекущееСобытие,
	|	биг_ДаблИмпактСигналы.ТочкаНачалаСобытия КАК ТочкаНачалаСобытия,
	|	биг_ДаблИмпактСигналы.ТочкаСигналЗавершен КАК ТочкаСигналЗавершен,
	|	биг_ДаблИмпактСигналы.СигналЗавершен КАК СигналЗавершен,
	|	биг_ДаблИмпактСигналы.ЗавершеноПоложительно КАК ЗавершеноПоложительно,
	|	биг_ДаблИмпактСигналы.ПричинаОтмены КАК ПричинаОтмены,
	|	биг_ДаблИмпактСигналы.ТочкаНачалаПаденияДатой КАК ТочкаНачалаПаденияДатой
	|ИЗ
	|	РегистрСведений.биг_ДаблИмпактСигналы КАК биг_ДаблИмпактСигналы
	|ГДЕ
	|	биг_ДаблИмпактСигналы.Биржа = &Биржа
	|	И биг_ДаблИмпактСигналы.ИнструментИД = &ИнструментИД
	|	И биг_ДаблИмпактСигналы.ТочкаНачалаПадения = &ТочкаНачалаПадения
	|	И биг_ДаблИмпактСигналы.КлючНастроек = &КлючНастроек";
	Запрос.УстановитьПараметр("Биржа", 				Сигнал.Биржа);
	Запрос.УстановитьПараметр("ИнструментИД", 		Сигнал.ИнструментИД);
	Запрос.УстановитьПараметр("ТочкаНачалаПадения", Сигнал.ТочкаНачалаПадения);
	Запрос.УстановитьПараметр("КлючНастроек", 		Сигнал.КлючНастроек);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	                    
	Запись = РегистрыСведений.биг_ДаблИмпактСигналы.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(Запись, Выборка);
	Запись.Прочитать();
	 
	Запись.ТочкаСигналЗавершен		= ТочкаЗавершения;
	Запись.СигналЗавершен 			= Истина;
	Запись.ЗавершеноПоложительно	= Истина;
	Запись.Записать(Истина);
	
КонецПроцедуры

Процедура ЗавершитьСигналОтрицательно(Сигнал, ПричинаОтмены, ТочкаЗавершения)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	биг_ДаблИмпактСигналы.Биржа КАК Биржа,
	|	биг_ДаблИмпактСигналы.ИнструментИД КАК ИнструментИД,
	|	биг_ДаблИмпактСигналы.Бар КАК Бар,
	|	биг_ДаблИмпактСигналы.КлючНастроек КАК КлючНастроек,
	|	биг_ДаблИмпактСигналы.ТочкаНачалаПадения КАК ТочкаНачалаПадения,
	|	биг_ДаблИмпактСигналы.УровеньСопротивления КАК УровеньСопротивления,
	|	биг_ДаблИмпактСигналы.ТочкаЗавершенияПадения КАК ТочкаЗавершенияПадения,
	|	биг_ДаблИмпактСигналы.ПаттернСигнала КАК ПаттернСигнала,
	|	биг_ДаблИмпактСигналы.ТочкаРазворота КАК ТочкаРазворота,
	|	биг_ДаблИмпактСигналы.ТочкаВхода1 КАК ТочкаВхода1,
	|	биг_ДаблИмпактСигналы.ТочкаВхода2 КАК ТочкаВхода2,
	|	биг_ДаблИмпактСигналы.ТочкаВыхода1 КАК ТочкаВыхода1,
	|	биг_ДаблИмпактСигналы.ТочкаВыхода2 КАК ТочкаВыхода2,
	|	биг_ДаблИмпактСигналы.ТекущееСобытие КАК ТекущееСобытие,
	|	биг_ДаблИмпактСигналы.ТочкаНачалаСобытия КАК ТочкаНачалаСобытия,
	|	биг_ДаблИмпактСигналы.ТочкаСигналЗавершен КАК ТочкаСигналЗавершен,
	|	биг_ДаблИмпактСигналы.СигналЗавершен КАК СигналЗавершен,
	|	биг_ДаблИмпактСигналы.ЗавершеноПоложительно КАК ЗавершеноПоложительно,
	|	биг_ДаблИмпактСигналы.ПричинаОтмены КАК ПричинаОтмены,
	|	биг_ДаблИмпактСигналы.ТочкаНачалаПаденияДатой КАК ТочкаНачалаПаденияДатой
	|ИЗ
	|	РегистрСведений.биг_ДаблИмпактСигналы КАК биг_ДаблИмпактСигналы
	|ГДЕ
	|	биг_ДаблИмпактСигналы.Биржа = &Биржа
	|	И биг_ДаблИмпактСигналы.ИнструментИД = &ИнструментИД
	|	И биг_ДаблИмпактСигналы.ТочкаНачалаПадения = &ТочкаНачалаПадения
	|	И биг_ДаблИмпактСигналы.КлючНастроек = &КлючНастроек";
	Запрос.УстановитьПараметр("Биржа", 				Сигнал.Биржа);
	Запрос.УстановитьПараметр("ИнструментИД", 		Сигнал.ИнструментИД);
	Запрос.УстановитьПараметр("ТочкаНачалаПадения", Сигнал.ТочкаНачалаПадения);
	Запрос.УстановитьПараметр("КлючНастроек", 		Сигнал.КлючНастроек);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	                    
	Запись = РегистрыСведений.биг_ДаблИмпактСигналы.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(Запись, Выборка);
	Запись.Прочитать();
	 
	Запись.ТочкаСигналЗавершен		= ТочкаЗавершения;
	Запись.СигналЗавершен 			= Истина;
	Запись.ЗавершеноПоложительно	= Ложь;
	Запись.ПричинаОтмены			= ПричинаОтмены;
	Запись.Записать(Истина);
	
КонецПроцедуры

Процедура СброситьСигнал(ПараметрыИнструмента, ТочкаСбросаТС)
	
	
	ЗаписатьТочкуНаЛинииВремени(ПараметрыИнструмента.Биржа, ПараметрыИнструмента.ИнструментИД, ПараметрыИнструмента.Бар, ПараметрыИнструмента.КлючНастроек, ТочкаСбросаТС);
	УдалитьСигналыПослеТочки(ПараметрыИнструмента, ТочкаСбросаТС);	
	СтеретьЗафиксированныеОперации(ПараметрыИнструмента, ТочкаСбросаТС);
	
	//ЗафиксироватьТочкуРазворота(Сигнал, ПоследняяСвеча);
	
	Комментарий = "Сигнала сброшен. Инструмент = " + ПараметрыИнструмента.ИНструментИД + ", точка начала падения = " + ПараметрыИнструмента.ТочкаНачалаПадения + ", настройка = " + ПараметрыИнструмента.КлючНастроек;
	ЗаписьЖурналаРегистрации("ДаблИмпакт", УровеньЖурналаРегистрации.Предупреждение,, ПараметрыИнструмента.КлючНастроек, Комментарий);
	
КонецПроцедуры


#КонецОбласти //КлючевыеШаги


Функция ПолучитьВыборкуИнструментовСтратегии(Участие = Истина)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	биг_ДаблИмпактИнструментыСрезПоследних.Биржа КАК Биржа,
	|	биг_ДаблИмпактИнструментыСрезПоследних.ИнструментИД КАК ИнструментИД,
	|	биг_ДаблИмпактИнструментыСрезПоследних.Бар КАК Бар,
	|	биг_ДаблИмпактИнструментыСрезПоследних.КлючНастройки КАК КлючНастроек
	|ИЗ
	|	РегистрСведений.биг_ДаблИмпактИнструменты.СрезПоследних КАК биг_ДаблИмпактИнструментыСрезПоследних
	|ГДЕ
	|	биг_ДаблИмпактИнструментыСрезПоследних.Участие = &Участие ИЛИ &НеИспользоватьФильтр";
	
	Запрос.УстановитьПараметр("Участие", 				Участие);
	Запрос.УстановитьПараметр("НеИспользоватьФильтр", 	НЕ Участие);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат Выборка;
		
КонецФункции

Функция ПолучитьСтруктуруСигнала()

	Сигнал = Новый Структура;
	Сигнал.Вставить("Биржа", 						Неопределено);
	Сигнал.Вставить("ИнструментИД", 				Неопределено);
	Сигнал.Вставить("Бар", 							Неопределено);
	Сигнал.Вставить("ТочкаНачалаПадения", 			Неопределено);
	Сигнал.Вставить("УровеньСопротивления", 		Неопределено);	
	Сигнал.Вставить("ТочкаЗавершенияПадения", 		Неопределено);
	Сигнал.Вставить("ТочкаРазворота", 				Неопределено);
	Сигнал.Вставить("ТочкаВхода1", 					Неопределено);
	Сигнал.Вставить("ТочкаВхода2", 					Неопределено);
	Сигнал.Вставить("ТочкаВыхода1", 				Неопределено);
	Сигнал.Вставить("ТочкаВыхода2", 				Неопределено);
	Сигнал.Вставить("ТекущееСобытие", 				Неопределено);
	Сигнал.Вставить("ТочкаНачалаСобытия", 			Неопределено);
	Сигнал.Вставить("СигналЗавершен", 				Неопределено);
	Сигнал.Вставить("ЗавершеноПоложительно",		Неопределено);
	Сигнал.Вставить("ПричинаОтмены", 				Неопределено);
	Сигнал.Вставить("ТочкаНачалаПаденияДатой",		Неопределено);
	Сигнал.Вставить("ТочкаСигналЗавершен",			Неопределено);
	Сигнал.Вставить("ПаттернСигнала",				Неопределено);
	Сигнал.Вставить("Бектест",						Неопределено);
	Сигнал.Вставить("КлючНастроек",					Неопределено);
	
	Возврат Сигнал;
	
КонецФункции

Функция ПолучитьЗаписьСобытийСигнала(Сигнал)
	
	Запись = РегистрыСведений.биг_ДаблИмпактСигналы.СоздатьМенеджерЗаписи();
	Запись.Биржа 					= Сигнал.Биржа;
	Запись.ИнструментИД				= Сигнал.ИнструментИД;
	Запись.Бар						= Сигнал.Бар;
	Запись.КлючНастроек				= Сигнал.КлючНастроек;
	Запись.ТочкаНачалаПадения 		= Сигнал.ТочкаНачалаПадения;
	Запись.Прочитать();
	
	Возврат Запись;
	
КонецФункции

Функция ВычислитьУровеньСопротивленияСигнала(Сигнал, ТочкаПоследнейСвечиСигнала)
	
	ПараметрыЗапроса 	= биг_ОбщегоНазначения.ПолучитьСтруктуруПараметровЗапросаДанныхПоСвечам();
	ЗаполнитьЗначенияСвойств(ПараметрыЗапроса, Сигнал); 
	
	ПараметрыЗапроса.ТочкаВремениТС_НачалоПериода 		= Сигнал.ТочкаЗавершенияПадения;
	ПараметрыЗапроса.ТочкаВремениТС_ЗавершениеПериода   = ТочкаПоследнейСвечиСигнала;
	
	ДанныеСвечей 		= биг_ОбщегоНазначения.ПолучитьДанныеСвечейПоТочке(ПараметрыЗапроса);
	
	СуммаЦен			= 0;
	Для каждого Свеча Из ДанныеСвечей Цикл
		СуммаЦен = СуммаЦен + Свеча.ЦенаМаксимум;
	КонецЦикла;
	
	УровеньСопротивления = СуммаЦен / ДанныеСвечей.Количество();
	Возврат УровеньСопротивления;
	
КонецФункции



//// Начало падения
Функция НайтиТочкуСЦелевымОтклонением(ДанныеСвечей, ЦелевоеОтклонение)
	
	Точка = Неопределено;
	
	//Для каждого Строка Из ДанныеСвечей Цикл
	Свеча = ДанныеСвечей[0];
	
	КраснаяСвеча = биг_ОбщегоНазначения.ЭтоКраснаяСвеча(Свеча);
	Если КраснаяСвеча Тогда
		Если Свеча.volCcyMA20 > 0 Тогда
			Отношение = Свеча.volCcy / Свеча.volCcyMA20 * 100;
			Если Отношение > ЦелевоеОтклонение Тогда
				
				Точка = Свеча.TimeStamp;
				//Прервать;
				
			КонецЕсли;	
		КонецЕсли;			
	КонецЕсли;
		
	//КонецЦикла;
	
	Возврат Точка;
		
КонецФункции

Процедура ЗафиксироватьТочкуНачалаПадения(Сигнал, ТочкаНачалаПадения, КлючНастроек)

	Запись = РегистрыСведений.биг_ДаблИмпактСигналы.СоздатьМенеджерЗаписи();
	Запись.Биржа 					= Сигнал.Биржа;
	Запись.ИнструментИД				= Сигнал.ИнструментИД;
	Запись.Бар						= Сигнал.Бар;
	Запись.КлючНастроек				= КлючНастроек;
	Запись.ТочкаНачалаПадения 		= ТочкаНачалаПадения;
	Запись.ТочкаНачалаПаденияДатой	= биг_ОбщегоНазначенияКлиентСервер.TimestampВДату(ТочкаНачалаПадения);
	Запись.ТекущееСобытие			= Перечисления.биг_ДаблИмпактEvents.ПоискТочкиЗавершенияПадения; 
	Запись.ТочкаНачалаСобытия		= ТочкаНачалаПадения;
	Запись.Записать(Истина);
	
	биг_ПодсистемаОповещений.ВнутреннееОповещениеПоЗаписиСигнала(Сигнал, Запись);
		
КонецПроцедуры

 
//// Завершение падения
Процедура ТочкаЗавершенияПадения_ПроверкаТриКрасных(ДанныеСвечей, ПараметрыПроверки, Сигнал)
	
	Если ДанныеСвечей.Количество() < 3 Тогда
		Возврат;	
	КонецЕсли;
	
	ТриКрасных = Истина;
	Для ИНД = 0 По ДанныеСвечей.Количество() - 1 Цикл
		Свеча = ДанныеСвечей[ИНД];
		
		Если НЕ биг_ОбщегоНазначения.ЭтоКраснаяСвеча(Свеча) Тогда
			ТриКрасных = Ложь;
		КонецЕсли;
	КонецЦикла;               
	
	Если ТриКрасных Тогда
		
		СвечаТри 	= ДанныеСвечей[2];
		RSIMax		= ПолучитьЗначениеПараметраСтратегии("ДИ_2_ЗавершениеПадения_RSIMax", Сигнал.КлючНастроек);
		
		Если СвечаТри.ЦенаЗакрытияRSI14 <= RSIMax Тогда
			
			ПараметрыПроверки.ПроверкаШаблон = Истина;
			
			ТочкаЗавершенияПадения_ПроверитьСвечиНаИзменениеОбъемаИЦены(ДанныеСвечей, 3, ПараметрыПроверки, Сигнал);			
		КонецЕсли;	
		
	КонецЕсли;
	       	
КонецПроцедуры

Процедура ТочкаЗавершенияПадения_СемьИзВосьми(ДанныеСвечей, ПараметрыПроверки, Сигнал)
	 	
	СемьИзВосьми 	= Истина;
	СчетчикКрасных 	= 0;
	СчетчикЗеленых	= 0;

	// проверим соблюдается ли паттерн 7/8 среди имеющихся свечей
	Для ИНД = 0 По ДанныеСвечей.Количество() - 1 Цикл
		Свеча = ДанныеСвечей[ИНД];
		
		Если биг_ОбщегоНазначения.ЭтоКраснаяСвеча(Свеча) Тогда
			СчетчикКрасных 	= СчетчикКрасных + 1;
		Иначе
			СчетчикЗеленых	= СчетчикЗеленых + 1;	
		КонецЕсли;
		
		Если СчетчикЗеленых > 1 Тогда
			// паттерн нарушен
			ПараметрыПроверки.ПрерватьСигнал 	= Истина;
			ПараметрыПроверки.ТочкаОтмены		= Свеча.TimeStamp;
			
			Текст = "Красные 7/8. Свеча с датой открытия %1 является второй зеленой свечой после точки начала падения. Все паттерны нарушены";				
			ПараметрыПроверки.ПричинаОтмены	= СтрШаблон(Текст, Свеча.ДатаОткрытия);
			Возврат;
		КонецЕсли;		
	КонецЦикла;               
	
	//если еще нет 8 свечей, то дальше проверять рано
   	Если ДанныеСвечей.Количество() < 8 Тогда
		Возврат;	
	КонецЕсли;
	
	
	Если СчетчикЗеленых < 2 Тогда
		
		СвечаСемь 	= ДанныеСвечей[6];
		СвечаВосемь	= ДанныеСвечей[7];
		
		RSIMax		= ПолучитьЗначениеПараметраСтратегии("ДИ_2_ЗавершениеПадения_RSIMax", Сигнал.КлючНастроек);
		
		Если СвечаСемь.ЦенаЗакрытияRSI14 <= RSIMax ИЛИ СвечаВосемь.ЦенаЗакрытияRSI14 <= RSIMax Тогда
			
			ПараметрыПроверки.ПроверкаШаблон = Истина;
			ТочкаЗавершенияПадения_ПроверитьСвечиНаИзменениеОбъемаИЦены(ДанныеСвечей, 8, ПараметрыПроверки, Сигнал);
			
		Иначе
			
			ПараметрыПроверки.ПрерватьСигнал 	= Истина;
			ПараметрыПроверки.ТочкаОтмены		= СвечаВосемь.TimeStamp;
			
			Текст = "Красные 7/8. Не пройден RSI_7 = %1, RSI_8 = %2";				
			ПараметрыПроверки.ПричинаОтмены	= СтрШаблон(Текст, СвечаСемь.ЦенаЗакрытияRSI14, СвечаВосемь.ЦенаЗакрытияRSI14);
		КонецЕсли;	
		
	Иначе
		
		ПараметрыПроверки.ПрерватьСигнал 	= Истина;
		ПараметрыПроверки.ТочкаОтмены		= Свеча.TimeStamp;
		
		Текст = "Красные 7/8. Шаблон не подтвержден. Всего красных = " + СчетчикКрасных;				
		ПараметрыПроверки.ПричинаОтмены	= Текст;
	КонецЕсли;
	
КонецПроцедуры

Процедура ТочкаЗавершенияПадения_ПроверитьСвечиНаИзменениеОбъемаИЦены(ДанныеСвечей, КоличествоСвечей, ПараметрыПроверки, Сигнал)
	
	// количество красных в паттерне
	КоличествоКрасных = 0;
	Для каждого Свеча Из ДанныеСвечей Цикл
		Если биг_ОбщегоНазначения.ЭтоКраснаяСвеча(Свеча) Тогда
			КоличествоКрасных = КоличествоКрасных + 1;	
		КонецЕсли;			
	КонецЦикла;
	
	ПерваяСвечаОбъем 		= ДанныеСвечей[0].volCcy;
	ПерваяСвечаЦена			= ДанныеСвечей[0].ЦенаЗакрытия;

	ИзменениеОбъемаМакс		= ПолучитьЗначениеПараметраСтратегии("ДИ_2_ЗавершениеПадения_МаксУрСниженияОбъемаНаШаг", Сигнал.КлючНастроек);
	ИзменениеЦеныНаШаг		= ПолучитьЗначениеПараметраСтратегии("ДИ_2_ЗавершениеПадения_МинУрСниженияЦеныНаШаг", Сигнал.КлючНастроек);	
	//МножительСреднегоОбъема = ПолучитьЗначениеПараметраСтратегии("ДИ_2_ЗавершениеПадения_МножительМинПревышенияОбъемаПаттерном", Сигнал.КлючНастроек);
	
	// Собираем Целевой Объем Паттерна
	Сч = 2;              
	ЦелевойОбъем 		= ПерваяСвечаОбъем;
	ПредыдущийОбъем		= ПерваяСвечаОбъем;
	Пока Сч <= КоличествоКрасных Цикл
		
		ТекОбъем 		= ПредыдущийОбъем - (ПредыдущийОбъем / 100 * ИзменениеОбъемаМакс);
		ЦелевойОбъем 	= ЦелевойОбъем + ТекОбъем;
		
		ПредыдущийОбъем = ТекОбъем;
		Сч 				= Сч + 1;		
	КонецЦикла;	
	
	// Вычисляем максимально допустимую цену в конце паттерна
	Сч = 2;
	МаксДопустимаяЦена 	= ПерваяСвечаЦена;
	Пока Сч <= КоличествоКрасных Цикл
		
		ТекЦена 			= МаксДопустимаяЦена - (Окр(МаксДопустимаяЦена / 100 * ИзменениеЦеныНаШаг, 8));	
		МаксДопустимаяЦена 	= ТекЦена;		
		Сч 					= Сч + 1;
	КонецЦикла;
	
	ПоследняяСвеча			= ДанныеСвечей[ДанныеСвечей.Количество() - 1];
	Если НЕ биг_ОбщегоНазначения.ЭтоКраснаяСвеча(ПоследняяСвеча) Тогда
		ПоследняяСвеча 		= ДанныеСвечей[ДанныеСвечей.Количество() - 2];	
	КонецЕсли;
	
	ПоследняяСвечаЦена		= ПоследняяСвеча.ЦенаЗакрытия;
	ОбщийОбъемПаттерна		= 0;
	
	Для ИНД = 0 По КоличествоСвечей - 1 Цикл
		
		Свеча 	= ДанныеСвечей[ИНД]; 
		Если биг_ОбщегоНазначения.ЭтоКраснаяСвеча(Свеча) Тогда
			ОбщийОбъемПаттерна = ОбщийОбъемПаттерна + Свеча.volCcy;	
		КонецЕсли;							
	КонецЦикла;
	
	// проверка на снижение цены
	Если ПоследняяСвечаЦена > МаксДопустимаяЦена Тогда
		
		ПараметрыПроверки.ПрерватьСигнал 	= Истина;
		ПараметрыПроверки.ТочкаОтмены		= Свеча.TimeStamp;
		
		Текст = "Для Паттерна не пройден контроль цены. Цена первой свечи = %1, Цена последней свечи = %2, Макс. допустимая цена посл. свечи = %3";				
		ПараметрыПроверки.ПричинаОтмены	= СтрШаблон(Текст, ПерваяСвечаЦена, ПоследняяСвечаЦена, МаксДопустимаяЦена);
		Возврат;
	КонецЕсли;
	
	Если ОбщийОбъемПаттерна < ЦелевойОбъем Тогда
		ПараметрыПроверки.ПрерватьСигнал 	= Истина;
		ПараметрыПроверки.ТочкаОтмены		= Свеча.TimeStamp;
		
		Текст = "Для Паттерна не пройден контроль объема. Целевой объем = %1, Текущий объем = %2";				
		ПараметрыПроверки.ПричинаОтмены	= СтрШаблон(Текст, ЦелевойОбъем, ОбщийОбъемПаттерна);
	КонецЕсли;
		
	//ПерваяСвеча						= ДанныеСвечей[0];
	//ЦенаОткрытияПатерна				= ПерваяСвеча.ЦенаОткрытия;
	//ПоследняяСвеча 					= ДанныеСвечей[КоличествоСвечей - 1];
	//ЦенаЗакрытияПаттерна			= ПоследняяСвеча.ЦенаЗакрытия;
	//ЦелевоеИзменениеЦеныПроцентов	= ИзменениеЦеныНаШаг * КоличествоСвечей;
	//УменьшениеЦеныПроцентов			= Окр(100 - (ЦенаЗакрытияПаттерна / ЦенаОткрытияПатерна * 100), 5); 
	//
	//Если УменьшениеЦеныПроцентов < ЦелевоеИзменениеЦеныПроцентов Тогда
	//			
	//	ПараметрыПроверки.ПрерватьСигнал 	= Истина;
	//	ПараметрыПроверки.ТочкаОтмены		= Свеча.TimeStamp;
	//	
	//	Текст = "Для Паттерна не пройден контроль цены. Текущее уменьшение = %1, Целевое = %2";				
	//	ПараметрыПроверки.ПричинаОтмены	= СтрШаблон(Текст, УменьшениеЦеныПроцентов, ЦелевоеИзменениеЦеныПроцентов);
	//	Возврат;
	//КонецЕсли;
	//       
	//Если ОбщийОбъемПаттерна < ЦелевойОбъемПаттерна Тогда
	//	ПараметрыПроверки.ПрерватьСигнал 	= Истина;
	//	ПараметрыПроверки.ТочкаОтмены		= Свеча.TimeStamp;
	//	
	//	Текст = "Для Паттерна не пройден контроль объема. Целевой объем = %1, Текущий объем = %2";				
	//	ПараметрыПроверки.ПричинаОтмены	= СтрШаблон(Текст, ЦелевойОбъемПаттерна, ОбщийОбъемПаттерна);
	//КонецЕсли;
	
	Если НЕ ПараметрыПроверки.ПрерватьСигнал Тогда
		ПараметрыПроверки.ПроверкаДоп = Истина;	
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗафиксироватьТочкуЗавершенияПадения(Сигнал, ДанныеСвечей, Паттерн)
	
	ИндексПоследнейСвечи 	= ДанныеСвечей.Количество() - 1;
	ПоследняяСвеча 			= ДанныеСвечей[ИндексПоследнейСвечи];
	
	Запись = ПолучитьЗаписьСобытийСигнала(Сигнал);
	
	Запись.ТочкаЗавершенияПадения	= ПоследняяСвеча.TimeStamp;
	Запись.ТекущееСобытие			= Перечисления.биг_ДаблИмпактEvents.ПоискТочкиРазворота; 
	Запись.ТочкаНачалаСобытия		= ПоследняяСвеча.TimeStamp + 1;
	Запись.ПаттернСигнала			= Паттерн;
	Запись.Записать(Истина);
	
	биг_ПодсистемаОповещений.ВнутреннееОповещениеПоЗаписиСигнала(Сигнал, Запись);
		
КонецПроцедуры

Функция ПолучитьСтруктуруПроверкиТочкиЗавершенияПадения()

	Возврат Новый Структура("ПроверкаШаблон, ПроверкаДоп, ПрерватьСигнал, ПричинаОтмены, ТочкаОтмены", Ложь, Ложь, Ложь, "", 0);
	
КонецФункции


//// Точка разворота 
Процедура ЗафиксироватьТочкуРазворота(Сигнал, Свеча)
	
	Запись = ПолучитьЗаписьСобытийСигнала(Сигнал);
	Запись.ТочкаРазворота 		= Свеча.TimeStamp;
	Запись.ТекущееСобытие		= Перечисления.биг_ДаблИмпактEvents.ПоискТочкиВходаОдин;
	Запись.ТочкаНачалаСобытия	= Свеча.TimeStamp;
	Запись.Записать(Истина);
	
	биг_ПодсистемаОповещений.ВнутреннееОповещениеПоЗаписиСигнала(Сигнал, Запись);
		
КонецПроцедуры



//// Поиск точки входа один
Процедура ТочкаВходаОдин_ДвеИзТрехЗеленых(Сигнал, ДанныеСвечей, ПараметрыПроверки)
	
	Если ДанныеСвечей.Количество() < 2 Тогда
		Возврат;
	КонецЕсли;
	
	КоличествоЗеленых 	= 0;
	ЕстьФормаДоджи 		= Ложь;
	Для ИНД = 0 По ДанныеСвечей.Количество() - 1 Цикл
		
		Свеча = ДанныеСвечей[ИНД];
		
		Если биг_ОбщегоНазначения.ЭтоЗеленаяСвеча(Свеча) Тогда
			КоличествоЗеленых = КоличествоЗеленых + 1;
			
			Если биг_ОбщегоНазначения.ЭтоСвечаДоджи(Свеча, Сигнал.КлючНастроек) Тогда
				ЕстьФормаДоджи = Истина;	
			КонецЕсли;
		КонецЕсли;	
		
	КонецЦикла; 
	
	Если КоличествоЗеленых >= 2 И ЕстьФормаДоджи Тогда
		
		ПараметрыПроверки.ПроверкаШаблон = Истина;
		ТочкаВходаОдин_ПроверкаПревышенияМинимальнойЦеныПадения(Сигнал, ДанныеСвечей, ПараметрыПроверки);		
	КонецЕсли;                              
	
КонецПроцедуры

Процедура ТочкаВходаОдин_ТриИзШестиЗеленых(Сигнал, ДанныеСвечей, ПараметрыПроверки)
	
	Если ДанныеСвечей.Количество() < 6 Тогда
		Возврат;
	КонецЕсли;
	
	КоличествоЗеленых 	= 0;
	ЕстьФормаДоджи 		= Ложь;
	Для ИНД = 0 По ДанныеСвечей.Количество() - 1 Цикл
		
		Свеча = ДанныеСвечей[ИНД];
		
		Если биг_ОбщегоНазначения.ЭтоЗеленаяСвеча(Свеча) Тогда
			КоличествоЗеленых = КоличествоЗеленых + 1;
			
			Если биг_ОбщегоНазначения.ЭтоСвечаДоджи(Свеча, Сигнал.КлючНастроек) Тогда
				ЕстьФормаДоджи = Истина;	
			КонецЕсли;
		КонецЕсли;	
		
	КонецЦикла; 
	
	Если КоличествоЗеленых >= 3 И ЕстьФормаДоджи Тогда
		
		ПараметрыПроверки.ПроверкаШаблон = Истина;
		ТочкаВходаОдин_ПроверкаПревышенияМинимальнойЦеныПадения(Сигнал, ДанныеСвечей, ПараметрыПроверки);
	Иначе
		
		ПараметрыПроверки.ПрерватьСигнал 	= Истина;
		ПараметрыПроверки.ТочкаОтмены		= Свеча.TimeStamp;
		
		Текст = "Шаблон входа 3/6 зеленых. Количество зеленых = %1, Есть форма Доджи = %2";				
		ПараметрыПроверки.ПричинаОтмены	= СтрШаблон(Текст, КоличествоЗеленых, ЕстьФормаДоджи);
	КонецЕсли;                              
	
КонецПроцедуры

Процедура ТочкаВходаОдин_ПроверкаПревышенияМинимальнойЦеныПадения(Сигнал, ДанныеСвечей, ПараметрыПроверки)
	
	// Минимальная цена каждой (в том числе красной) должна быть выше Минимальной цены «свечи-точки падения» 
	ДетальнаяИнформацияОСвече 			= биг_ОбщегоНазначения.ДетальнаяИнформацияОСвече(Сигнал.Биржа, Сигнал.ИнструментИД, Сигнал.Бар, Сигнал.ТочкаЗавершенияПадения);	
	ОтступВниз 							= ПолучитьЗначениеПараметраСтратегии("ДИ_4_ПоискТочкиВходаОдин_ОтступВнизОтТочкиПадения", Сигнал.КлючНастроек);
	МинимальнаяЦена 					= ДетальнаяИнформацияОСвече.ЦенаМинимум - (ДетальнаяИнформацияОСвече.ЦенаМинимум / 100 * ОтступВниз);
		
	Для ИНД = 0 По ДанныеСвечей.Количество() - 1 Цикл
		
		Свеча = ДанныеСвечей[ИНД];		
		Если Свеча.ЦенаМинимум < МинимальнаяЦена Тогда
			
			ПараметрыПроверки.ПрерватьСигнал 	= Истина;
			ПараметрыПроверки.ТочкаОтмены		= Свеча.TimeStamp;
			
			Текст = "Вход_1, Проверка 2/3. МинЦенаПадения = %1, Свеча %2, Свеча.ЦенаМинимум = %3";				
			ПараметрыПроверки.ПричинаОтмены	= СтрШаблон(Текст, МинимальнаяЦена, ИНД, Свеча.ЦенаМинимум);
			
			Прервать;
		КонецЕсли;
		
	КонецЦикла;

	Если НЕ ПараметрыПроверки.ПрерватьСигнал Тогда
		ПараметрыПроверки.ПроверкаДоп = Истина;	
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗафиксироватьТочкуВходаОдин(Сигнал, ДанныеСвечей, Таймстамп)
	
	// проверка есть ли открытые ордера (позиции?) у текущего инструмента
	//		если есть - то прервать текущий сигнал
	//		если нет - фиксируем точку входа, размещаем ордера
	Если ТекущийИнструментИмеетОткрытыеОрдера(Сигнал) Тогда
		
		ПричинаОтмены = "По данному инструменту уже есть открытая позиция";
		ПрерватьОбработкуТекущегоСигнала(Сигнал, ПричинаОтмены, Таймстамп);		
	Иначе
		
		ИндексПоследнейСвечи 		= ДанныеСвечей.Количество() - 1;
		ПоследняяСвеча 				= ДанныеСвечей[ИндексПоследнейСвечи];
		
		РазместитьОрдераДляТочкиВходаОдин(Сигнал, ДанныеСвечей, Таймстамп);
		
		Запись = ПолучитьЗаписьСобытийСигнала(Сигнал);
		Запись.ТочкаВхода1			= ПоследняяСвеча.TimeStamp;
		Запись.ТекущееСобытие		= Перечисления.биг_ДаблИмпактEvents.ПоискТочкиВходаДва; 
		Запись.ТочкаНачалаСобытия	= ПоследняяСвеча.TimeStamp + 1;
		Запись.УровеньСопротивления	= ВычислитьУровеньСопротивленияСигнала(Сигнал, ПоследняяСвеча.TimeStamp);
		Запись.Записать(Истина);
		
		биг_ПодсистемаОповещений.ВнутреннееОповещениеПоЗаписиСигнала(Сигнал, Запись);
		биг_ПодсистемаОповещений.ПубличноеОповещениеПоЗаписиСигнала(Сигнал, Запись);
	КонецЕсли;
	
КонецПроцедуры


//// Поиск точки входа два
Процедура ЗафиксироватьТочкуВходаДва(Сигнал, ДанныеСвечей, ТаймСтамп)

	ИндексПоследнейСвечи 		= ДанныеСвечей.Количество() - 1;
	ПоследняяСвеча 				= ДанныеСвечей[ИндексПоследнейСвечи];
	
	РазместитьОрдераДляТочкиВходаДва(Сигнал, ДанныеСвечей, ТаймСтамп);
	
	Запись = ПолучитьЗаписьСобытийСигнала(Сигнал);
	Запись.ТочкаВхода2			= ПоследняяСвеча.TimeStamp;
	Запись.ТекущееСобытие		= Перечисления.биг_ДаблИмпактEvents.МониторингУровняСтопЛосс; 
	Запись.ТочкаНачалаСобытия	= ПоследняяСвеча.TimeStamp + 1;
	Запись.Записать(Истина);
	
	биг_ПодсистемаОповещений.ВнутреннееОповещениеПоЗаписиСигнала(Сигнал, Запись);
	биг_ПодсистемаОповещений.ПубличноеОповещениеПоЗаписиСигнала(Сигнал, Запись);
	 	
КонецПроцедуры


//// Мониторинг уровня Стоп-лосс
Функция РассчитатьНовыйУровеньСтопЛосс(Сигнал, УровеньСверху, УровеньСнизу)

	КоэффициентУровней 			= Окр(УровеньСверху / УровеньСнизу, 2);
	КоэффициентИзмененияСЛ 		= ПолучитьЗначениеПараметраСтратегии("ДИ_6_МониторингСЛ_КоэффРазницыУровнейДляКоррекцииСЛ", Сигнал.КлючНастроек);
	
	Если КоэффициентУровней >= КоэффициентИзмененияСЛ Тогда
			
		ТекущаяРазницаУровней 	= УровеньСверху - УровеньСнизу;
		БуфернаяЗона 			= ПолучитьЗначениеПараметраСтратегии("ДИ_6_МониторингСЛ_УровеньОтступаОтЦеныЗакрытияПриКорекцииСЛ", Сигнал.КлючНастроек);
		НовыйТриггерСЛ 			= УровеньСверху - (ТекущаяРазницаУровней / 100 * БуфернаяЗона);		
	Иначе
		
		НовыйТриггерСЛ			= 0;		
	КонецЕсли;
	
	Возврат НовыйТриггерСЛ;
	
КонецФункции

#КонецОбласти //АнализСигнала


#Область УправлениеОперациями

Процедура РазместитьОрдераДляТочкиВходаОдин(Сигнал, ДанныеСвечей, ТаймСтамп)
	
	// расчет цен и контрольных уровней 
	ПроцентДепозитаНаВход 		= ПолучитьЗначениеПараметраСтратегии("ДИ_4_ПоискТочкиВходаОдин_ПроцентДепозита", Сигнал.КлючНастроек);
	ОтступВнизОтМинУровня 		= ПолучитьЗначениеПараметраСтратегии("ДИ_4_ПоискТочкиВходаОдин_ОтступВнизОтМинУровняПаттерна", Сигнал.КлючНастроек);
	
	МинимальныйУровеньПаттерна 	= НайтиМинимальныйУровеньВСигнале(Сигнал);
	ТриггерСтопЛос				= МинимальныйУровеньПаттерна; 
	
	//ТЕСТ
	ТриггерСтопЛос = ТриггерСтопЛос - (ТриггерСтопЛос / 100 * ОтступВнизОтМинУровня);
	 
	// собираем все аккаунты, подключенные к этому инструменту текущей биржи
	ТаблицаУчастников 	= СобратьАккаунтыДляРеакцииНаСигнал(Сигнал);
	
	Инструмент			= Справочники.big_Instruments.НайтиПоРеквизиту("instId", Сигнал.ИнструментИД,, Сигнал.Биржа);
	Кратность 			= биг_ОбщегоНазначенияКлиентСервер.ЗначениеРеквизитаОбъекта(Инструмент, "lotSz");
	
	Для каждого Запись Из ТаблицаУчастников Цикл
		
		//ТриггерСтопЛос = ВычислитьУровеньСтопЛосс(Сигнал, Запись, ТаймСтамп);
		
		// для каждого аккаунта определяем сумму операции		
		РазмерОрдера	= РассчитатьОриентировочнуюСуммуОперацииВВалютеОперации(Сигнал, Запись, ПроцентДепозитаНаВход, ТаймСтамп);
				 
		РазмерОрдера	= биг_ОКХ_Сервер.ПересчитатьВКонтракты(РазмерОрдера, Инструмент);		
		РазмерОрдера 	= биг_ОбщегоНазначенияКлиентСервер.ОкруглитьКратно(РазмерОрдера, Кратность);
		
		АктуализироватьНастройкиИнструментаНаАккаунте(Сигнал.ИнструментИД, Запись.Участник, Сигнал.КлючНастроек);
		ТочкаВхода_РазместитьМаркетОрдер(Сигнал, Запись.Участник, РазмерОрдера, Перечисления.биг_ДаблИмпактEvents.ПоискТочкиВходаОдин, ТриггерСтопЛос, ТаймСтамп);	
	КонецЦикла;
	
КонецПроцедуры

Процедура РазместитьОрдераДляТочкиВходаДва(Сигнал, ДанныеСвечей, ТаймСтамп)

	// расчет цен и контрольных уровней 
	ПроцентДепозитаНаВход 		= ПолучитьЗначениеПараметраСтратегии("ДИ_5_ПоискТочкиВходаДва_ПроцентДепозита", Сигнал.КлючНастроек);
	
	ТриггерСтопЛосс = Сигнал.УровеньСопротивления;
	УровеньСтопЛосс	= -1;
	//УровеньСтопЛосс = ТриггерСтопЛосс / 100 * (100 - ДИ_ОтступУровняСЛотТриггера); 
		
	// собираем все аккаунты, подключенные к этому инструменту текущей биржи
	ТаблицаУчастников = СобратьАккаунтыДляРеакцииНаСигнал(Сигнал);
	
	Инструмент			= Справочники.big_Instruments.НайтиПоРеквизиту("instId", Сигнал.ИнструментИД,, Сигнал.Биржа);
	Кратность 			= биг_ОбщегоНазначенияКлиентСервер.ЗначениеРеквизитаОбъекта(Инструмент, "lotSz");
	
	Для каждого Запись Из ТаблицаУчастников Цикл
		
		Аккаунт 		= Запись.Участник;
		//АлгоОрдер 		= НайтиСтопЛос(Сигнал, Аккаунт, КлючНастроек); 
		
		// для каждого аккаунта определяем сумму операции
		РазмерОрдера	= РассчитатьОриентировочнуюСуммуОперацииВВалютеОперации(Сигнал, Запись, ПроцентДепозитаНаВход, ТаймСтамп);		
		
		РазмерОрдера	= биг_ОКХ_Сервер.ПересчитатьВКонтракты(РазмерОрдера, Инструмент);		
		РазмерОрдера 	= биг_ОбщегоНазначенияКлиентСервер.ОкруглитьКратно(РазмерОрдера, Кратность);
		
		АктуализироватьНастройкиИнструментаНаАккаунте(Сигнал.ИнструментИД, Запись.Участник, Сигнал.КлючНастроек);
		
		//ИзменитьСтопЛосс(Аккаунт, АлгоОрдер, ТриггерСтопЛосс, УровеньСтопЛосс, Сигнал, ТаймСтамп);
		ТочкаВхода_РазместитьМаркетОрдер(Сигнал, Аккаунт, РазмерОрдера, Перечисления.биг_ДаблИмпактEvents.ПоискТочкиВходаДва,, ТаймСтамп);
		
		// получить точку первого входа, посмотреть между ними разницу
		// повторить рассчет корекции уровня СЛ, оценивая разницу между уровнями Один и Два
		КорректироватьСтопНаВторойПокупке = ПолучитьЗначениеПараметраСтратегии("ДИ_5_ПоискТочкиВходаДва_КорректироватьСтопНаВторойПокупке", Сигнал.КлючНастроек);
		
		// обработка массовой генерации рассчитана только на числовые значения
		Если КорректироватьСтопНаВторойПокупке = 1 Тогда 
			
			СтопЛос 			= НайтиСтопЛос(Сигнал, Аккаунт);
			
			Если СтопЛос <> Неопределено Тогда
				
				ТриггерСЛ 			= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтопЛос, "slTriggerPx");
				
				ПервыйВход 			= НайтиОперациюПоСобытиюСигнала(Сигнал, Перечисления.биг_ДаблИмпактEvents.ПоискТочкиВходаОдин, Аккаунт);
				ДанныеПервогоВхода	= биг_МаркетАпи.ПолучитьКлючевыеДанныеОперации(ПервыйВход);
				УровеньОдин			= ДанныеПервогоВхода.ЦенаЗаполнено;
				
				ВторойВход 			= НайтиОперациюПоСобытиюСигнала(Сигнал, Перечисления.биг_ДаблИмпактEvents.ПоискТочкиВходаДва, Аккаунт);
				ДанныеВторогоВхода	= биг_МаркетАпи.ПолучитьКлючевыеДанныеОперации(ВторойВход);
				УровеньДва			= ДанныеВторогоВхода.ЦенаЗаполнено;			
				
				УровеньСнизу		= Макс(ДанныеПервогоВхода.ЦенаЗаполнено, ТриггерСЛ);
				УровеньСверху		= УровеньДва;
				
				НовыйТриггерСЛ		= РассчитатьНовыйУровеньСтопЛосс(Сигнал, УровеньСверху, УровеньСнизу);
				Если НовыйТриггерСЛ > ТриггерСЛ Тогда
					
					НовыйУровеньСтопЛосс	= -1;			
					ИзменитьСтопЛосс(Аккаунт, СтопЛос, НовыйТриггерСЛ, НовыйУровеньСтопЛосс, Сигнал, ТаймСтамп);
				КонецЕсли;
				
			ИначеЕсли Сигнал.Бектест Тогда
				
				// при размещении ордера происходит ошибка, документ не создается. причину пока не выяснил 
				// ОТКАТИМ СИГНАЛ  
				ТочкаСбросаТС = Сигнал.ТочкаНачалаПадения - Сигнал.Бар.SecondsAmount;
				СброситьСигнал(Сигнал, ТочкаСбросаТС);
			КонецЕсли;			
		КонецЕсли;
	КонецЦикла;                                                                                                          		
	
КонецПроцедуры

Процедура ТочкаВхода_РазместитьМаркетОрдер(Сигнал, Аккаунт, РазмерОрдера, Событие, ТриггерСтопЛос = Неопределено, ТаймСтамп) 

	СтруктураОперации = биг_МаркетАпиКлиентСервер.СтруктураОперации_СоздатьОрдер();
	СтруктураОперации.Биржа 		= Сигнал.Биржа;
	СтруктураОперации.Аккаунт 		= Аккаунт;
	СтруктураОперации.Стратегия		= СтратегияДаблИмпакт();
	СтруктураОперации.КлючНастроек	= Сигнал.КлючНастроек;
	СтруктураОперации.Событие		= Событие;
	СтруктураОперации.ИнструментИД	= Сигнал.ИнструментИД;
	СтруктураОперации.РазмерОрдера  = РазмерОрдера; 
	СтруктураОперации.Сигнал		= Сигнал.ТочкаНачалаПадения;
	СтруктураОперации.ОрдерСторона	= Перечисления.big_OKX_OrderSides.buy;
	СтруктураОперации.ОрдерТип		= Перечисления.big_OKX_OrderTypes.market;	
	СтруктураОперации.ИнструментТип	= Перечисления.big_OKX_InstrumentType.SWAP; //DI_HARD - стратегия всегда на фьючах или могут быть варинаты ?
	
	//ДИ_ОтступУровняСЛотТриггера 	= ПолучитьЗначениеПараметраСтратегии("ДИ_4_ОтступУровняСЛотТриггера", Сигнал.КлючНастроек);
	
	Если ТриггерСтопЛос <> Неопределено Тогда
		
		УровеньСтопЛосс		= -1; // ордер будет продан по текущей рыночной цене "market"		
		СтруктураАлгоОрдера = биг_МаркетАпиКлиентСервер.СтруктураОперации_СоздатьАлгоОрдер();
		
		ЗаполнитьЗначенияСвойств(СтруктураАлгоОрдера, СтруктураОперации); //биржа, аккаунт, стратегия, событие, ИнструментИД
		СтруктураАлгоОрдера.ТриггерСтопЛос 	= ТриггерСтопЛос;
		СтруктураАлгоОрдера.ЦенаСтопЛос 	= УровеньСтопЛосс;
		
		СтруктураОперации.МассивСвязанныхАлгоОрдеров.Добавить(СтруктураАлгоОрдера);
	КонецЕсли;
	                                                                                                                                                                                                                                                                                              

	биг_МаркетАпи.СоздатьОрдер(Неопределено, СтруктураОперации, Сигнал.Бектест, ТаймСтамп);					
	
КонецПроцедуры
                                    
Процедура ИзменитьСтопЛосс(Аккаунт, АлгоОрдер, НовыйТриггер, НовыйУровень, Сигнал, ТаймСтамп)
		
	СтруктураОперации = биг_МаркетАпиКлиентСервер.СтруктураОперации_ИзменитьАлгоОрдер();                
	СтруктураОперации.Аккаунт 				= Аккаунт;
	СтруктураОперации.ИнструментИД          = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(АлгоОрдер, "instId");
	СтруктураОперации.КлиентАлгоОрдерИД 	= биг_ОКХ_КлиентСервер.КлиентскийИдентификатор(АлгоОрдер);
	СтруктураОперации.НовыйТриггерСтопЛос	= НовыйТриггер;
	СтруктураОперации.НовыйЦенаСтопЛос		= НовыйУровень;
	
	биг_МаркетАпи.ИзменитьАлгоОрдер(СтруктураОперации, Сигнал.Бектест, ТаймСтамп); 
	
	биг_ПодсистемаОповещений.ВнутреннееОповещениеИзменениеУровняСтопЛосс(Сигнал, СтруктураОперации);
	биг_ПодсистемаОповещений.ПубличноеОповещениеИзменениеУровняСтопЛосс(Сигнал, СтруктураОперации);
	
КонецПроцедуры

#КонецОбласти


#Область ВспомогательныеПроцедурыФункции

Процедура АктуализироватьНастройкиИнструментаНаАккаунте(ИнструментИД, Аккаунт, КлючНастроек)
	
	ЗначениеПлеча		= ПолучитьЗначениеПараметраСтратегии("ДИ_4_ПоискТочкиВходаОдин_Плечо", КлючНастроек);
	ЗначениеПлеча		= ?(ЗначениеЗаполнено(ЗначениеПлеча), ЗначениеПлеча, 1);
	
	СтруктураОперации = биг_МаркетАпиКлиентСервер.СтруктураОперации_УстановитьМаржу();

	СтруктураОперации.Вставить("ИнструментИД", ИнструментИД);
	СтруктураОперации.Вставить("УровеньМаржи", ЗначениеПлеча);
	СтруктураОперации.Вставить("РежимТорговли", Перечисления.big_OKX_tdModes.isolated);

	биг_МаркетАпи.УстановитьМаржу(Аккаунт, СтруктураОперации);
	
КонецПроцедуры        

Функция ВычислитьУровеньСтопЛосс(Сигнал, Запись, ТаймСтамп)

	Если Сигнал.Бектест Тогда
		ТекущаяЦена		= ПолучитьЦенуПоИсторическимДанным(Сигнал, Запись, ТаймСтамп);		
	Иначе
		ТекущаяЦена		= ПолучитьТекущуюЦену(Сигнал, Запись);	
	КонецЕсли;
	
	Т4_Риск = ПолучитьЗначениеПараметраСтратегии("ДИ_4_ПоискТочкиВходаОдин_УровеньРиска", Сигнал.КлючНастроек);

	// Ставим Стоп-лосс с отступом, создающим нам уровень риска
	УровеньСтопЛосс = Окр(ТекущаяЦена - (ТекущаяЦена / 100 * Т4_Риск), 8);
	Возврат УровеньСтопЛосс;
	
КонецФункции

Функция ТребуетсяОбработкаСигнала(Сигнал, КлючНастроек, ТаймСтамп)
	
	ТочкаПоследнегоШага = ПолучитьТекущуюТочкуНаЛинииВремени(Сигнал.Биржа, Сигнал.ИнструментИД, Сигнал.Бар, КлючНастроек);
	СледующийШаг 		= ТочкаПоследнегоШага + Сигнал.Бар.SecondsAmount;
	Возврат ТаймСтамп >= СледующийШаг;
	
КонецФункции

Функция ПолучитьТекущуюТочкуНаЛинииВремени(Биржа, ИнструментИД, Бар, КлючНастроек)
	
	Менеджер = РегистрыСведений.биг_ДаблИмпактВременныеТочки.СоздатьМенеджерЗаписи();
	Менеджер.Биржа 					= Биржа;
	Менеджер.ИнструментИД 			= ИнструментИД;
	Менеджер.Бар					= Бар;
	Менеджер.НастройкаСтратегии		= КлючНастроек;
	Менеджер.Прочитать();
	
	Возврат Менеджер.ТочкаНаЛинииВремени;	
	
КонецФункции

Процедура ЗаписатьТочкуНаЛинииВремени(Биржа, ИнструментИД, Бар, КлючНастроек, ТочкаОтсчетаТС)
	
	Менеджер = РегистрыСведений.биг_ДаблИмпактВременныеТочки.СоздатьМенеджерЗаписи();
	Менеджер.Биржа 					= Биржа;
	Менеджер.ИнструментИД 			= ИнструментИД;
	Менеджер.Бар					= Бар;
	Менеджер.НастройкаСтратегии		= КлючНастроек;
	
	Менеджер.ТочкаНаЛинииВремени	= ТочкаОтсчетаТС;
	Менеджер.ТочкаДатой				= биг_ОбщегоНазначенияКлиентСервер.TimestampВДату(ТочкаОтсчетаТС);
	
	Менеджер.Записать(Истина);
	
КонецПроцедуры

Процедура ЗафиксироватьТочкуТекущегоШага(Инструмент, КлючНастроек, ТаймСтамп)
	
	ЗаписатьТочкуНаЛинииВремени(Инструмент.Биржа, Инструмент.ИнструментИД, Инструмент.Бар, КлючНастроек, биг_ОбщегоНазначения.НачалоПериодаПоБару(ТаймСтамп, Инструмент.Бар));			
		
КонецПроцедуры

Функция НайтиПоследнююСвечуИнструмента(Сигнал, ТаймСтамп)
	
	ПараметрыЗапроса 	= биг_ОбщегоНазначения.ПолучитьСтруктуруПараметровЗапросаДанныхПоСвечам();
	ЗаполнитьЗначенияСвойств(ПараметрыЗапроса, Сигнал); 
	
	ПараметрыЗапроса.ВыбратьПервые			= 1;
	ПараметрыЗапроса.СортировкаПоУбыванию	= Истина;
	
	ДанныеСвечей = биг_ОбщегоНазначения.ПолучитьДанныеСвечейПоТочке(ПараметрыЗапроса);
	
	Если ДанныеСвечей.Количество() = 0 Тогда
		ПоследняяСвеча = Неопределено;
	Иначе
		ПоследняяСвеча = ДанныеСвечей[0];	
	КонецЕсли;
	
	Возврат ПоследняяСвеча;
	
КонецФункции

Функция НайтиМинимальныйУровеньВСигнале(Сигнал)
	
	ПараметрыЗапроса 	= биг_ОбщегоНазначения.ПолучитьСтруктуруПараметровЗапросаДанныхПоСвечам();
	ЗаполнитьЗначенияСвойств(ПараметрыЗапроса, Сигнал); 
	
	ПараметрыЗапроса.ТочкаВремениТС_НачалоПериода 		= Сигнал.ТочкаНачалаПадения;
	ПараметрыЗапроса.ТочкаВремениТС_ЗавершениеПериода   = Сигнал.ТочкаЗавершенияПадения;
	
	ДанныеСвечей 		= биг_ОбщегоНазначения.ПолучитьДанныеСвечейПоТочке(ПараметрыЗапроса);
	
	Минимум = 999999999999;
	Для каждого Свеча Из ДанныеСвечей Цикл
		Минимум = Мин(Свеча.ЦенаМинимум, Минимум);
		//Минимум = Мин(Свеча.ЦенаЗакрытия, Минимум);
	КонецЦикла;
	
	Возврат Минимум;
		
КонецФункции

Функция СобратьАккаунтыДляРеакцииНаСигнал(Сигнал)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	биг_УчастникиСтратегийСрезПоследних.Participiant КАК Участник,
	|	биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.ccy КАК Монета,
	|	биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.availBal КАК ДоступныйБаланс,
	|	биг_УчастникиСтратегийСрезПоследних.СуммаДепозита КАК СуммаДепозита
	|ИЗ
	|	РегистрСведений.биг_УчастникиСтратегий.СрезПоследних(, ) КАК биг_УчастникиСтратегийСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.биг_ОКХ_БаллансАккаунтовДетали.СрезПоследних КАК биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних
	|		ПО биг_УчастникиСтратегийСрезПоследних.Participiant = биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.Account
	|			И (биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.ccy = &USDT)
	|ГДЕ
	|	биг_УчастникиСтратегийСрезПоследних.Участник
	|	И биг_УчастникиСтратегийСрезПоследних.Strategy = &Strategy
	|	И биг_УчастникиСтратегийСрезПоследних.Participiant.Владелец = &Биржа";
	
	Запрос.УстановитьПараметр("Strategy", 	РегистрыСведений.биг_ПредопределенныеЭлементы.ПолучитьЗначениеПоИмени("СтратегияDoubleImpact"));
	Запрос.УстановитьПараметр("USDT", 		РегистрыСведений.биг_ПредопределенныеЭлементы.ПолучитьЗначениеПоИмени("USDT"));
	Запрос.УстановитьПараметр("Биржа",		Сигнал.Биржа);

	ТабличаУчастников = Запрос.Выполнить().Выгрузить();
	
	Возврат	ТабличаУчастников;	
		
КонецФункции

Функция НайтиСтопЛос(Сигнал, Аккаунт)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	биг_ДаблИмпактОперации.Операция КАК Операция
	|ИЗ
	|	РегистрСведений.биг_ДаблИмпактОперации КАК биг_ДаблИмпактОперации
	|ГДЕ
	|	биг_ДаблИмпактОперации.Биржа = &Биржа
	|	И биг_ДаблИмпактОперации.ИнструментИД = &ИнструментИД
	|	И биг_ДаблИмпактОперации.ТочкаНачалаПадения = &ТочкаНачалаПадения
	|	И биг_ДаблИмпактОперации.Аккаунт = &Аккаунт
	|	И ВЫРАЗИТЬ(биг_ДаблИмпактОперации.Операция КАК Документ.big_AlgoOrders_OKX).slTriggerPx > 0
	|	И биг_ДаблИмпактОперации.НастройкаСтратегии = &НастройкаСтратегии";
	
	Запрос.УстановитьПараметр("Биржа", 				Сигнал.Биржа);
	Запрос.УстановитьПараметр("ИнструментИД", 		Сигнал.ИнструментИД);
	Запрос.УстановитьПараметр("ТочкаНачалаПадения", Сигнал.ТочкаНачалаПадения);
	Запрос.УстановитьПараметр("Аккаунт", 			Аккаунт);
	Запрос.УстановитьПараметр("НастройкаСтратегии", Сигнал.КлючНастроек);
	                       
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Операция;	
	
КонецФункции

Функция ТекущийИнструментИмеетОткрытыеОрдера(Сигнал)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	биг_ДаблИмпактСигналы.Биржа КАК Биржа,
	|	биг_ДаблИмпактСигналы.ИнструментИД КАК ИнструментИД,
	|	биг_ДаблИмпактСигналы.КлючНастроек КАК КлючНастроек,
	|	биг_ДаблИмпактСигналы.ТочкаНачалаПадения КАК ТочкаНачалаПадения
	|ПОМЕСТИТЬ ВТ_АктивныеСигналы
	|ИЗ
	|	РегистрСведений.биг_ДаблИмпактСигналы КАК биг_ДаблИмпактСигналы
	|ГДЕ
	|	НЕ биг_ДаблИмпактСигналы.СигналЗавершен
	|	И биг_ДаблИмпактСигналы.ТочкаНачалаПадения <> &ТекущаяТочкаНачалаПадения
	|	И биг_ДаблИмпактСигналы.Биржа = &Биржа
	|	И биг_ДаблИмпактСигналы.ИнструментИД = &ИнструментИД
	|	И биг_ДаблИмпактСигналы.КлючНастроек = &КлючНастроек
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	биг_ДаблИмпактОперации.Операция КАК Операция
	|ИЗ
	|	РегистрСведений.биг_ДаблИмпактОперации КАК биг_ДаблИмпактОперации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_АктивныеСигналы КАК ВТ_АктивныеСигналы
	|		ПО биг_ДаблИмпактОперации.Биржа = ВТ_АктивныеСигналы.Биржа
	|			И биг_ДаблИмпактОперации.ИнструментИД = ВТ_АктивныеСигналы.ИнструментИД
	|			И биг_ДаблИмпактОперации.НастройкаСтратегии = ВТ_АктивныеСигналы.КлючНастроек
	|			И биг_ДаблИмпактОперации.Операция.ТочкаНачалаПадения = ВТ_АктивныеСигналы.ТочкаНачалаПадения";
	
	Запрос.УстановитьПараметр("ТекущаяТочкаНачалаПадения", 	Сигнал.ТочкаНачалаПадения);
	Запрос.УстановитьПараметр("Биржа", 						Сигнал.Биржа);
	Запрос.УстановитьПараметр("ИнструментИД", 				Сигнал.ИнструментИД);
	Запрос.УстановитьПараметр("КлючНастроек", 				Сигнал.КлючНастроек);
	                 
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Ложь;
	Иначе 
		Возврат Истина;		
	КонецЕсли;
		
КонецФункции

Функция ВычислитьУровеньСопротивленияСигналаНаСтаршемФрейме(Сигнал)
	
	// определение "более старшего" фрейма
	Бар = биг_ОбщегоНазначения.НайтиСтаршийФрейм(Сигнал.Бар);
	
	// Получаем данные о 72 свечах 
	// из базы
	ПараметрыЗапроса 	= биг_ОбщегоНазначения.ПолучитьСтруктуруПараметровЗапросаДанныхПоСвечам();
	ЗаполнитьЗначенияСвойств(ПараметрыЗапроса, Сигнал); 
	
	ПараметрыЗапроса.КоличествоСвечей		= 72;
	ПараметрыЗапроса.ОграничениеПериода     = Сигнал.ТочкаНачалаПадения;
	ПараметрыЗапроса.СортировкаПоУбыванию	= Истина;
	
	ДанныеСвечей = биг_ОбщегоНазначения.ПолучитьДанныеСвечейПоТочке(ПараметрыЗапроса);
	Если ДанныеСвечей.Количество() < ПараметрыЗапроса.КоличествоСвечей Тогда
		
		// если меньше, то запрос к бирже
		ПараметрыЗапроса = биг_МаркетАпиКлиентСервер.СтруктураОперации_ЗагрузитьИсториюСвечей();
		ЗаполнитьЗначенияСвойств(ПараметрыЗапроса, Сигнал);
		
		// !!! TODO: ОКХ ведет учет в 13-ти значном формате.. не гибко, но пока так
		ПараметрыЗапроса.ТочкаДо 			= Сигнал.ТочкаНачалаПадения * 1000; 
		ПараметрыЗапроса.КоличествоСвечей 	= ПараметрыЗапроса.КоличествоСвечей;
	КонецЕсли;
		
		
	// ищем последнюю красную свечу (влево)
	ПредыдущаяСвеча = ДанныеСвечей[0];
	
	Для каждого Строка Из ДанныеСвечей Цикл
		Если биг_ОбщегоНазначения.ЭтоКраснаяСвеча(Строка) Тогда
			
			ПредыдущаяСвеча = Строка;
		Иначе         
			
			// попалась зеленая свеча - предыдущая и была последней красной
			Прервать; 
		КонецЕсли;	
	КонецЦикла;
	
	// ЦенаВыхода = ЦенаОткрытияПоследнейКрасной - 0.1%
	ЦенаВыхода = ПредыдущаяСвеча.ЦенаОткрытия - (ПредыдущаяСвеча.ЦенаОткрытия / 100 * 0.1);
	Возврат ЦенаВыхода;	
		
КонецФункции

Процедура ПроверитьАктуальностьСигнала(Выборка, ТаймСтамп)
	
	Если Выборка.slTriggerPx > 0 Тогда
		
		// это Стоп Лосс
		
		СтатусыСработал = Новый Массив;
		СтатусыСработал.Добавить("EFFECTIVE");
		СтатусыСработал.Добавить("PARTIALLY_EFFECTIVE");
		
		СтатусДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Выборка.Операция, "state");
		Если СтатусыСработал.Найти(ВРег(СтатусДокумента)) <> Неопределено Тогда
			
			// сработал стоп, сигнал нуно завершить
			
			ПрофитУбытокСигнала = НайтиПрофитУбытокСигнала(Выборка);
			Если ПрофитУбытокСигнала <= 0 Тогда
				ЗавершитьСигналОтрицательно(Выборка, "Сработал Стоп-лосс", ТаймСтамп);
			Иначе
				ЗавершитьСигналУспешно(Выборка, ТаймСтамп);
			КонецЕсли;
			
			биг_ПодсистемаОповещений.ВнутреннееОповещениеОСрабатыванииСтопЛосса(Выборка, ПрофитУбытокСигнала);
			
			ПрофитУбытокВПроцентах = ВычислитьФинРезВПроцентах(Выборка, ПрофитУбытокСигнала);
			биг_ПодсистемаОповещений.ПубличноеОповещениеОСрабатыванииСтопЛосса(Выборка, ПрофитУбытокВПроцентах);
			
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

Процедура ИскуственноПроверитьВыполнениеОрдера(Выборка, ТаймСтамп)
	
	// начало - дата создания ордера
	// конец - таймстамп
	// получить данные свечей за период
	
	ПараметрыЗапроса 	= биг_ОбщегоНазначения.ПолучитьСтруктуруПараметровЗапросаДанныхПоСвечам(); 
	ПараметрыЗапроса.Биржа 								= Выборка.Биржа;
	ПараметрыЗапроса.ИнструментИД 						= Выборка.ИнструментИД;      
	
	// TODO: в теории тут может быть любой фрейм, поэтому надо получать точку на минутную свечу, а есл нет на более старший фрейм
	// такая процедура есть.. где то.. 
	ПараметрыЗапроса.Бар								= Справочники.big_BarTypes.H1;
	
	Если ЗначениеЗаполнено(Выборка.Операция.uTime) Тогда
		НачалоПериода = Число(Лев(Формат(Выборка.Операция.uTime, "ЧГ=0"), 10));	
	ИначеЕсли ЗначениеЗаполнено(Выборка.Операция.cTime) Тогда
		НачалоПериода = Число(Лев(Формат(Выборка.Операция.cTime, "ЧГ=0"), 10));
	Иначе
		НачалоПериода = биг_ОбщегоНазначенияКлиентСервер.ДатуВTimestampЧисло(Выборка.Дата);	
	КонецЕсли;
	ПараметрыЗапроса.ТочкаВремениТС_НачалоПериода 		= НачалоПериода + 1;
	ПараметрыЗапроса.ТочкаВремениТС_ЗавершениеПериода   = ТаймСтамп;        
	
	ДанныеСвечей 		= биг_ОбщегоНазначения.ПолучитьДанныеСвечейПоТочке(ПараметрыЗапроса);
	
	Если Выборка.slTriggerPx > 0 Тогда
		
		// проверить есть ли Цена Минимум ниже, чем триггер стоп-лосс
		Для каждого Строка Из ДанныеСвечей Цикл
			
			Если Строка.ЦенаМинимум <= Выборка.slTriggerPx Тогда
				
				Если Выборка.slOrdPx = -1 Тогда
					
					// маркет ордер - считаем, что исполнился
					// установить state = effective
					УстановитьСтатусАлгоОрдера(Выборка.Операция, "effective", Перечисления.big_СтатусыТорговыхОбъектов.Исполнен);
					Бектест_СоздатьОрдер(Выборка, ТаймСтамп);
					Прервать;
				Иначе
					
					// лимитный ордер - проверяем опустилась ли цена ниже
					Если Строка.ЦенаМинимум <= Выборка.slOrdPx Тогда
						
						// установить state = effective
						УстановитьСтатусАлгоОрдера(Выборка.Операция, "effective", Перечисления.big_СтатусыТорговыхОбъектов.Исполнен);
						Бектест_СоздатьОрдер(Выборка, ТаймСтамп);
						Прервать;
					КонецЕсли;					
				КонецЕсли;				
			КонецЕсли;			
		КонецЦикла;	
	КонецЕсли;
	   		
	Если Выборка.tpTriggerPx > 0 Тогда
		
		// проверить есть ли Цена Выше, чем триггер тейк-профит
		Для каждого Строка Из ДанныеСвечей Цикл
			
			Если Строка.ЦенаМаксимум >= Выборка.tpTriggerPx Тогда
				
				Если Выборка.tpOrdPx = -1 Тогда
					
					// маркет ордер - считаем, что исполнился
					// установить state = effective
					УстановитьСтатусАлгоОрдера(Выборка.Операция, "effective", Перечисления.big_СтатусыТорговыхОбъектов.Исполнен);
					Бектест_СоздатьОрдер(Выборка, ТаймСтамп);
					Прервать;
				Иначе
					
					// лимитный ордер - проверяем опустилась ли цена ниже
					Если Строка.ЦенаМинимум >= Выборка.tpOrdPx Тогда
						
						// установить state = effective
						УстановитьСтатусАлгоОрдера(Выборка.Операция, "effective", Перечисления.big_СтатусыТорговыхОбъектов.Исполнен);
						Бектест_СоздатьОрдер(Выборка, ТаймСтамп);
						Прервать;
					КонецЕсли;					
				КонецЕсли;				
			КонецЕсли;			
		КонецЦикла;		
	КонецЕсли; 
	
КонецПроцедуры

Процедура УстановитьСтатусАлгоОрдера(Операция, СтатусОКХ, СтатусВнутренний)
	
	ДокОбъект = Операция.ПолучитьОбъект();
	ДокОбъект.state 	= СтатусОКХ;
	ДокОбъект.Статус 	= СтатусВнутренний;
	ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры 

Процедура Бектест_СоздатьОрдер(Выборка, ТаймСтамп)

	СтруктураОперации = биг_МаркетАпиКлиентСервер.СтруктураОперации_СоздатьОрдер();
	СтруктураОперации.Биржа 				= Выборка.Биржа;
	СтруктураОперации.Аккаунт 				= Выборка.Аккаунт;
	СтруктураОперации.Стратегия				= СтратегияДаблИмпакт();
	СтруктураОперации.КлючНастроек			= Выборка.НастройкаСтратегии;
	СтруктураОперации.Сигнал				= Выборка.ТочкаНачалаПадения;
	СтруктураОперации.Событие				= Перечисления.биг_ДаблИмпактEvents.ВыполнениеСтопЛосс;
	СтруктураОперации.ОрдерСторона			= Перечисления.big_OKX_OrderSides.sell;
	СтруктураОперации.ИнструментТип			= Перечисления.big_OKX_InstrumentType.SWAP; //DI_HARD - стратегия всегда на фьючах или могут быть варинаты ?
	СтруктураОперации.ИнструментИД			= Выборка.ИнструментИД;
	СтруктураОперации.БектестВычислитьPnL	= Истина;
	
	// на текущий момент ТейкПрофиты по стратегии не используются. Но закладываю для универсальности	
	Если Выборка.slOrdPx > 0 ИЛИ Выборка.tpOrdPx > 0 Тогда
		СтруктураОперации.ОрдерТип		= Перечисления.big_OKX_OrderTypes.limit;
		СтруктураОперации.ЦенаОрдера	= ?(ЗначениеЗаполнено(Выборка.slOrdPx), Выборка.slOrdPx, Выборка.tpOrdPx);
	Иначе
		// ОТЛАДКА 
		// Тут должен быть маркет-ордер, но с определением цены пока не придумал.. поэтому делаем лимитный
		//СтруктураОперации.ОрдерТип	= Перечисления.big_OKX_OrderTypes.market;
		СтруктураОперации.ОрдерТип		= Перечисления.big_OKX_OrderTypes.limit;		
		СтруктураОперации.ЦенаОрдера 	= Выборка.slTriggerPx;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Выборка.tpOrdPx) Тогда
		СтруктураОперации.РазмерОрдера  = Выборка.sz;
	Иначе
		СтруктураОперации.РазмерОрдера	= ОпределитьОбъемПокупокВСигналеПоОрдеру(Выборка.Операция);			
	КонецЕсли;
	
	биг_МаркетАпи.СоздатьОрдер(Неопределено, СтруктураОперации, Истина, ТаймСтамп);
	
КонецПроцедуры

Функция РассчитатьОриентировочнуюСуммуОперацииВВалютеОперации(Сигнал, Запись, ПроцентДепозитаНаВход, ТаймСтамп)
		
	Если Сигнал.Бектест Тогда
		// TODO: обращение к маркет апи по Запись.Участник (аккаунт) и признаком бектест
		// маркетапи перенаправляет в модуль нужной биржи (по аккаунту)
		// там для бектеста смотрим текущий накопелнный результат и вычисляем балланс как Депо + (ПрофитЛосс - Комиссия), если он отрицательный
		ДоступныйБаланс = Запись.СуммаДепозита; //а пока что мы в минус "не уходим". Это завышает прибыли, но пока сойдет
	Иначе
		ДоступныйБаланс = Запись.ДоступныйБаланс;
	КонецЕсли;
	
	СуммаПоДепозиту		= Окр(Запись.СуммаДепозита / 100 * ПроцентДепозитаНаВход , 2);
	ДолларовДоступно	= Мин(Запись.ДоступныйБаланс, СуммаПоДепозиту);
	
	ЗначениеПлеча		= ПолучитьЗначениеПараметраСтратегии("ДИ_4_ПоискТочкиВходаОдин_Плечо", Сигнал.КлючНастроек);
	ЗначениеПлеча		= ?(ЗначениеЗаполнено(ЗначениеПлеча), ЗначениеПлеча, 1);
	ДолларовНаОперацию	= ДолларовДоступно * ЗначениеПлеча;
	
	// нельзя брать количество "в притык", иначе ордер не сработает, если за время его создания цена увеличиться
	// поэтому искуственно "завысим" цену в расчетах, что бы был запас 
	Если Сигнал.Бектест Тогда
		ТекущаяЦена		= ПолучитьЦенуПоИсторическимДанным(Сигнал, Запись, ТаймСтамп);		
	Иначе
		ТекущаяЦена		= ПолучитьТекущуюЦену(Сигнал, Запись);	
	КонецЕсли;
	
	ЦенаРасчета			= ТекущаяЦена * 1.01;
	
	РазмерОрдера		= Окр(ДолларовНаОперацию / ЦенаРасчета, 8);
	
	Возврат РазмерОрдера;
	
КонецФункции

Функция ПолучитьТекущуюЦену(Сигнал, Запись)
	
	СтруктураОперации = биг_МаркетАпиКлиентСервер.СтруктураОперации_ПолучитьЦену();
	СтруктураОперации.Биржа			= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.Участник, "Владелец");
	СтруктураОперации.ИнструментТип	= Перечисления.big_OKX_InstrumentType.SWAP; //DI_HARD - пока так. по хорошему нужно это в сигнале фиксировать
	СтруктураОперации.ИнструментИД	= Сигнал.ИнструментИД;
	
	Цена = биг_МаркетАпи.ПолучитьЦену(СтруктураОперации);
	Возврат Цена;
		
КонецФункции                             

Процедура ПроверитьВходныеПараметры(ТаймСтамп, НастройкаСтратегии)

	Если НастройкаСтратегии = Неопределено Тогда
		Стратегия 			= СтратегияДаблИмпакт();
		НастройкаСтратегии 	= Стратегия.ОсновнаяНастройка;
	КонецЕсли;
	
	Если ТаймСтамп = Неопределено Тогда
		ТаймСтамп = биг_ОбщегоНазначенияКлиентСервер.ДатуВTimestampЧисло();	
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьТаблицуНастроек(НастройкаСтратегии)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	биг_ЗначенияКонтрольныхУровней.КонтрольныйУровень КАК Параметр,
	|	биг_ЗначенияКонтрольныхУровней.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.биг_ЗначенияКонтрольныхУровней КАК биг_ЗначенияКонтрольныхУровней
	|ГДЕ
	|	биг_ЗначенияКонтрольныхУровней.НастройкаСтратегии = &НастройкаСтратегии";
	Запрос.УстановитьПараметр("НастройкаСтратегии", НастройкаСтратегии);
	ТаблицаНастроек = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаНастроек;
		
КонецФункции

Функция ПолучитьЗначениеПараметраСтратегии(ИмяПараметра, КлючНастроек)

	Возврат РегистрыСведений.биг_ЗначенияКонтрольныхУровней.ЗначениеУровняПоИмени(ИмяПараметра, КлючНастроек);
	
КонецФункции

Функция ОпределитьОбъемПокупокВСигналеПоОрдеру(Операция)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(биг_ДаблИмпактОперации.Операция.fillSz) КАК fillSz
	|ИЗ
	|	РегистрСведений.биг_ДаблИмпактОперации КАК биг_ДаблИмпактОперации
	|ГДЕ
	|	биг_ДаблИмпактОперации.Биржа = &Биржа
	|	И биг_ДаблИмпактОперации.ИнструментИД = &ИнструментИД
	|	И биг_ДаблИмпактОперации.ТочкаНачалаПадения = &ТочкаНачалаПадения
	|	И биг_ДаблИмпактОперации.Аккаунт = &Аккаунт
	|	И биг_ДаблИмпактОперации.Операция.side = &СторонаКупить
	|	И (ВЫРАЗИТЬ(биг_ДаблИмпактОперации.Операция КАК Документ.big_Order_OKX)) <> ЗНАЧЕНИЕ(Документ.big_Order_OKX.ПустаяСсылка)
	|	И биг_ДаблИмпактОперации.НастройкаСтратегии = &НастройкаСтратегии
	|	И биг_ДаблИмпактОперации.Операция.Событие В(&СобытиЯПокупки)";
	
	СтрокаРеквизитов 	= "instId, ТочкаНачалаПадения, Аккаунт, НастройкаСтратегии";
	ЗначенияРеквизитов 	= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Операция, СтрокаРеквизитов);
	
	Запрос.УстановитьПараметр("Биржа", 				ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗначенияРеквизитов.Аккаунт, "Владелец"));
	Запрос.УстановитьПараметр("ИнструментИД", 		ЗначенияРеквизитов.instId);
	Запрос.УстановитьПараметр("ТочкаНачалаПадения", ЗначенияРеквизитов.ТочкаНачалаПадения);
	Запрос.УстановитьПараметр("Аккаунт", 			ЗначенияРеквизитов.Аккаунт);
	Запрос.УстановитьПараметр("СторонаКупить", 		Перечисления.big_OKX_OrderSides.buy);
	Запрос.УстановитьПараметр("НастройкаСтратегии", ЗначенияРеквизитов.НастройкаСтратегии);
	
	СобытияПокупки = Новый Массив;
	СобытияПокупки.Добавить(Перечисления.биг_ДаблИмпактEvents.ПоискТочкиВходаОдин);
	СобытияПокупки.Добавить(Перечисления.биг_ДаблИмпактEvents.ПоискТочкиВходаДва);	
	Запрос.УстановитьПараметр("СобытиЯПокупки", 	СобытияПокупки);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат 0;
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		Возврат Выборка.fillSz;
	КонецЕсли;
	
КонецФункции

Функция НайтиПрофитУбытокСигнала(ВыборкаПоОперации)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(биг_ДаблИмпактОперации.Операция.pnl) КАК ПрофитУбыток
	|ИЗ
	|	РегистрСведений.биг_ДаблИмпактОперации КАК биг_ДаблИмпактОперации
	|ГДЕ
	|	биг_ДаблИмпактОперации.Биржа = &Биржа
	|	И биг_ДаблИмпактОперации.ИнструментИД = &ИнструментИД
	|	И биг_ДаблИмпактОперации.ТочкаНачалаПадения = &ТочкаНачалаПадения
	|	И биг_ДаблИмпактОперации.Аккаунт = &Аккаунт
	|	И биг_ДаблИмпактОперации.НастройкаСтратегии = &НастройкаСтратегии
	|	И биг_ДаблИмпактОперации.Событие = &Событие";
	
	Запрос.УстановитьПараметр("Аккаунт", 			ВыборкаПоОперации.Аккаунт);
	Запрос.УстановитьПараметр("Биржа", 				ВыборкаПоОперации.Биржа);
	Запрос.УстановитьПараметр("ИнструментИД", 		ВыборкаПоОперации.ИнструментИД);
	Запрос.УстановитьПараметр("ТочкаНачалаПадения", ВыборкаПоОперации.ТочкаНачалаПадения);
	Запрос.УстановитьПараметр("НастройкаСтратегии", ВыборкаПоОперации.НастройкаСтратегии);	
	Запрос.УстановитьПараметр("Событие", 			Перечисления.биг_ДаблИмпактEvents.ВыполнениеСтопЛосс);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.ПрофитУбыток;
		
КонецФункции

Функция ПолучитьКоличествоСигналовИнструмента(ПараметрыИнструмента)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЕСТЬNULL(биг_ДаблИмпактСигналы.ТочкаНачалаПадения, 0)) КАК КоличествоСигналов
	|ИЗ
	|	РегистрСведений.биг_ДаблИмпактСигналы КАК биг_ДаблИмпактСигналы
	|ГДЕ
	|	биг_ДаблИмпактСигналы.Биржа = &Биржа
	|	И биг_ДаблИмпактСигналы.ИнструментИД = &ИнструментИД
	|	И биг_ДаблИмпактСигналы.Бар = &Бар
	|	И биг_ДаблИмпактСигналы.КлючНастроек = &КлючНастроек";
	
	Запрос.УстановитьПараметр("Биржа", 			ПараметрыИнструмента.Биржа);
	Запрос.УстановитьПараметр("ИнструментИД", 	ПараметрыИнструмента.ИнструментИД);
	Запрос.УстановитьПараметр("Бар", 			ПараметрыИнструмента.Бар);
	Запрос.УстановитьПараметр("КлючНастроек", 	ПараметрыИнструмента.КлючНастроек);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.КоличествоСигналов;
		
КонецФункции

Функция ВычислитьФинРезВПроцентах(Выборка, ФинРез)
	
	Если Выборка.fillSz = 0 Тогда
		Возврат 0;
	Иначе
		ФинРезВПроцентах = Окр(ФинРез / Выборка.fillSz * 100, 2);
		Возврат ФинРезВПроцентах;
	КонецЕсли;   
	
КонецФункции

Функция ПроверитьНаличиеАктуальнойСвечи(ДанныеСвечей, СортировкаПоУбыванию, Бар, ТаймСтамп)
	
	КоличествоСвечей = ДанныеСвечей.Количество(); 
	Если КоличествоСвечей > 0 Тогда
		
		Свеча = ?(СортировкаПоУбыванию, ДанныеСвечей[0], ДанныеСвечей[КоличествоСвечей-1]); 
		ЦелеваяДатаТС = биг_ОбщегоНазначения.НачалоПериодаПоБару(ТаймСтамп, Бар) - Бар.SecondsAmount;
		
		Если Свеча.TimeStamp < ЦелеваяДатаТС Тогда
			Возврат Ложь;
		Иначе
			Возврат Истина;
		КонецЕсли; 
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции


// УДАЛИТЬ. НЕ ИСПОЛЬЗУЕТСЯ
Процедура ДополнитьДанныеСвечейПоказателямиИндикаторов(ДанныеСвечей)
	
	//ИмяКолонки = ЦенаЗакрытияRSI14 (RSI = латиница)
	ДанныеСвечей = биг_ОбщегоНазначения.ДополнитьДанныеСвечейДаннымиИндикаторов(ДанныеСвечей, 
																					Перечисления.биг_ИсточникиДанныхТехническихИндикаторов.ЦенаЗакрытия, 
																					Перечисления.биг_ВидыИндикаторов.RSI, 
																					14, 
																					, 
																					, 
																					100);	
	//ИмяКолонки = volCcyMA20															
	ДанныеСвечей = биг_ОбщегоНазначения.ДополнитьДанныеСвечейДаннымиИндикаторов(ДанныеСвечей, 
																					Перечисления.биг_ИсточникиДанныхТехническихИндикаторов.volCcy, 
																					Перечисления.биг_ВидыИндикаторов.MA, 
																					20, 
																					, 
																					, 
																					0);																
КонецПроцедуры

#КонецОбласти //ВспомогательныеПроцедурыФункции    

 