///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоАдминистраторСистемы = ПолучениеОбновленийПрограммы.ЭтоАдминистраторСистемы();
	
	Элементы.НадписьОбратитьсяКАдминистратору.Видимость = Не ЭтоАдминистраторСистемы;
	Элементы.ФормаНапомнитьПозже.КнопкаПоУмолчанию      = Не ЭтоАдминистраторСистемы;
	Элементы.ФормаВключить.Видимость                    = ЭтоАдминистраторСистемы;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Включить(Команда)
	
	ПолучениеОбновленийПрограммыВызовСервера.ВключитьОтключитьАвтоматическуюУстановкуИсправлений(Истина);
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура НапомнитьПозже(Команда)
	
	ДатаИнформирования = НачалоДня(ОбщегоНазначенияКлиент.ДатаСеанса() + 2592000);	// ТекущаяДата + 30 дней
	
	ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекСохранить(
		ПолучениеОбновленийПрограммыКлиентСервер.ИдентификаторОбщихНастроек(),
		ПолучениеОбновленийПрограммыКлиентСервер.КлючНастройкиДатаИнформированияОВключенииЗагрузкиИсправлений(),
		ДатаИнформирования);
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура БольшеНеПоказывать(Команда)
	
	ОбщегоНазначенияВызовСервера.ХранилищеОбщихНастроекСохранить(
		ПолучениеОбновленийПрограммыКлиентСервер.ИдентификаторОбщихНастроек(),
		ПолучениеОбновленийПрограммыКлиентСервер.КлючНастройкиДатаИнформированияОВключенииЗагрузкиИсправлений(),
		'39991231');
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти