
#Область ПрограммныйИнтерфейс

Процедура СправочникВыбор(Оповещение, ИмяСправочника, Форма, Отбор = Неопределено, ПараметрыОткрытия = Неопределено) Экспорт
	  			
	НастройкиКомпоновкиДанных 		= Новый НастройкиКомпоновкиДанных;
	
	Если Отбор <> Неопределено Тогда
		
		Для каждого Элемент Из Отбор Цикл
			
			ЭлементОтбора = НастройкиКомпоновкиДанных.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.Использование 	= Истина;
			ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных(Элемент.Ключ);
			ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.ПравоеЗначение 	= Элемент.Значение;
			
		КонецЦикла;			
	КонецЕсли; 
	
	Если ПараметрыОткрытия = Неопределено Тогда
		ПараметрыОткрытия = Новый Структура();	
	КонецЕсли; 
	ПараметрыОткрытия.Вставить("ФиксированныеНастройки", НастройкиКомпоновкиДанных);
	
	ОткрытьФорму("Справочник." + ИмяСправочника + ".Форма.ФормаВыбора", ПараметрыОткрытия, Форма, Форма.КлючУникальности,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);		      	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти