

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ОтправитьСообщение(Бот, Чат, Сообщение, РежимОтладки = Ложь) Экспорт
	
	//СообщениеДляОтправки = биг_ОбщегоНазначенияКлиентСервер.ЭкранироватьСпецсимволыДляMarkdownV2(Сообщение);
	
	Токен 	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Бот, ?(РежимОтладки, "ТокенДев", "ТокенПрод"));
	ЧатИД	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Чат, "Идентификатор");
	Ответ 	= OPI_Telegram.ОтправитьТекстовоеСообщение(Токен, ЧатИД, Сообщение,,"None");	
	
	ОК	= Ответ["ok"];
	Если НЕ ОК Тогда
		
		Ошибка = Ответ["description"];
		Сообщить(Ошибка);
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
