#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Для внутреннего использования.
// @skip-warning ПустойМетод - особенность реализации.
//
// Параметры:
//	КонечнаяТочка - ПланОбменаСсылка.ОбменСообщениями - конечная точка,
//	ПараметрыАутентификации - Строка - пароль, или
//							- Структура - с полями:
//								* ИспользоватьТекущегоПользователя - Булево - 
//								* Пароль - Строка - не обязательный.
//		
// Возвращаемое значение:
//	Структура - с полями:
//		* ВидТранспортаСообщенийОбменаПоУмолчанию - ПеречислениеСсылка.ВидыТранспортаСообщенийОбмена - 
//		* WSURLВебСервиса - Строка -
//		* WSИмяПользователя - Строка -
//		* WSЗапомнитьПароль - Булево -
//		* WSПароль - Строка -
Функция НастройкиТранспортаWS(КонечнаяТочка, ПараметрыАутентификации = Неопределено) Экспорт
КонецФункции

#КонецОбласти

#КонецЕсли