
#Область ПрограммныйИнтерфейс

// Функция - Рассчитать индикаторы
//
// Параметры:
//  Данные				 - Массив	 - Массив Структур
//  ДополнительныеДанные - 	 - 
//  ЗадачиРасчета		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция РассчитатьИндикаторы(Данные, ДополнительныеДанные, ЗадачиРасчета) Экспорт
	
	Если НЕ (ТипЗнч(Данные) = Тип("Массив") И Данные.Количество() > 0) Тогда
		Возврат Новый Массив;	
	КонецЕсли;               
	
	// Объединение данных
    ОбщиеДанные = Новый Массив;
    Для Каждого Строка Из ДополнительныеДанные Цикл
        ОбщиеДанные.Добавить(Строка);
	КонецЦикла;
	
	Для Каждого Строка Из Данные Цикл
        ОбщиеДанные.Добавить(Строка);
    КонецЦикла;

    // Расчет значений индикаторов
	Для Каждого Параметр Из ЗадачиРасчета Цикл
		
        Если Параметр.Индикатор = ПредопределенноеЗначение("Перечисление.Биг_ВидыИндикаторов.AD") Тогда			
			ЗначенияИндикатора = ta.ad(ОбщиеДанные);
			
		ИначеЕсли Параметр.Индикатор = ПредопределенноеЗначение("Перечисление.Биг_ВидыИндикаторов.ChOscil") Тогда
			ЗначенияИндикатора = ta.chOscil(ОбщиеДанные, Параметр.Длина1, Параметр.Длина2);
			
		ИначеЕсли Параметр.Индикатор = ПредопределенноеЗначение("Перечисление.Биг_ВидыИндикаторов.ADX") Тогда
		    ЗначенияИндикатора = ta.adx(ОбщиеДанные, Параметр.Длина1);
			
		ИначеЕсли Параметр.Индикатор = ПредопределенноеЗначение("Перечисление.Биг_ВидыИндикаторов.ATR") Тогда
		    ЗначенияИндикатора = ta.atr(ОбщиеДанные, Параметр.Длина1);
			
		ИначеЕсли Параметр.Индикатор = ПредопределенноеЗначение("Перечисление.Биг_ВидыИндикаторов.TVMAX") Тогда
		    ЗначенияИндикатора = ta.tvmax(ОбщиеДанные, Параметр.Длина1, Параметр.Длина2, Параметр.ИмяПоляДляРасчета);
			
		ИначеЕсли Параметр.Индикатор = ПредопределенноеЗначение("Перечисление.Биг_ВидыИндикаторов.TVMIN") Тогда
		    ЗначенияИндикатора = ta.tvmin(ОбщиеДанные, Параметр.Длина1, Параметр.Длина2, Параметр.ИмяПоляДляРасчета);	
			
		ИначеЕсли Параметр.Индикатор = ПредопределенноеЗначение("Перечисление.Биг_ВидыИндикаторов.SMA") Тогда
		    ЗначенияИндикатора = ta.sma(ОбщиеДанные, Параметр.Длина1, Параметр.ИмяПоляДляРасчета);
			
		ИначеЕсли Параметр.Индикатор = ПредопределенноеЗначение("Перечисление.Биг_ВидыИндикаторов.EMA") Тогда
		    ЗначенияИндикатора = ta.ema(ОбщиеДанные, Параметр.Длина1, Параметр.ИмяПоляДляРасчета);
			
		ИначеЕсли Параметр.Индикатор = ПредопределенноеЗначение("Перечисление.Биг_ВидыИндикаторов.WMA") Тогда
		    ЗначенияИндикатора = ta.wma(ОбщиеДанные, Параметр.Длина1, Параметр.ИмяПоляДляРасчета);
			
		ИначеЕсли Параметр.Индикатор = ПредопределенноеЗначение("Перечисление.Биг_ВидыИндикаторов.VWMA") Тогда
		    ЗначенияИндикатора = ta.vwma(ОбщиеДанные, Параметр.Длина1, Параметр.ИмяПоляДляРасчета);
			
		ИначеЕсли Параметр.Индикатор = ПредопределенноеЗначение("Перечисление.Биг_ВидыИндикаторов.RSI") Тогда
		    ЗначенияИндикатора = ta.rsi(ОбщиеДанные, Параметр.Длина1, Параметр.ИмяПоляДляРасчета);
			
		ИначеЕсли Параметр.Индикатор = ПредопределенноеЗначение("Перечисление.Биг_ВидыИндикаторов.RMA") Тогда
		    ЗначенияИндикатора = ta.rma(ОбщиеДанные, Параметр.Длина1, Параметр.ИмяПоляДляРасчета);
			
		ИначеЕсли Параметр.Индикатор = ПредопределенноеЗначение("Перечисление.Биг_ВидыИндикаторов.MA") Тогда
		    ЗначенияИндикатора = ta.ma(ОбщиеДанные, Параметр.Длина1, Параметр.ИмяПоляДляРасчета);
		КонецЕсли;
		
		Для Индекс = 0 По ОбщиеДанные.Количество() - 1 Цикл
			
			// Проверяем, что индекс не выходит за границы массива значений индикаторов
		    Если Индекс < ЗначенияИндикатора.Количество() Тогда
				
				// Получаем значение индикатора по текущему индексу
		        ЗначениеИндикатора = ЗначенияИндикатора[Индекс];
				ОбщиеДанные[Индекс].Вставить(Параметр.ИмяКолонкиРезультата, ЗначениеИндикатора);		        
		    Иначе
		        // Если индекс выходит за границы массива значений индикаторов, добавляем Неопределено
		        ОбщиеДанные[Индекс].Вставить(Параметр.ИмяКолонкиРезультата, Неопределено);
		    КонецЕсли;
		КонецЦикла;
		
        // Дополнение исходного массива структур новыми ключами
		//Для Индекс = 0 По Данные.Количество() - 1 Цикл
		//	
		//	// Проверяем, что индекс не выходит за границы массива значений индикаторов
		//    Если Индекс < ЗначенияИндикатора.Количество() Тогда
		//		
		//		// Получаем значение индикатора по текущему индексу
		//        ЗначениеИндикатора = ЗначенияИндикатора[ИндексЭлементаНачалаОсновногоНабора + Индекс];
		//		Данные[Индекс].Вставить(Параметр.ИмяКолонкиРезультата, ЗначениеИндикатора);		        
		//    Иначе
		//        // Если индекс выходит за границы массива значений индикаторов, добавляем Неопределено
		//        Данные[Индекс].Вставить(Параметр.ИмяКолонкиРезультата, Неопределено);
		//    КонецЕсли;
		//КонецЦикла;
    КонецЦикла;

    // Возвращаем обновленный массив данных
    Возврат Данные;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ОписаниеЗадачиРасчетаИндикатора() Экспорт
	
	Возврат Новый Структура("Индикатор, Длина1, Длина2, ИмяПоляДляРасчета, ИмяКолонкиРезультата", "", 0, 0, "ЦенаЗакрытия", "");
		
КонецФункции



#КонецОбласти