////////////////////////////////////////////////////////////////////////////////
// <Заголовок модуля: краткое описание и условия применения модуля.>
//  
////////////////////////////////////////////////////////////////////////////////
#Область ПрограммныйИнтерфейс

Процедура СоздатьКлиентовИСессии_Паблик(Слушатель) Экспорт
	
	Модуль = МодульСлушателя(Слушатель);
	Модуль.СоздатьКлиентовИСессии_Паблик(Слушатель);	
	
КонецПроцедуры

Процедура СоздатьКлиентовИСессии_Приват(Слушатель) Экспорт
	
	Модуль = МодульСлушателя(Слушатель);
	Модуль.СоздатьКлиентовИСессии_Приват(Слушатель);	
	
КонецПроцедуры

Процедура ЗакрытьСессиюСлушателя_Паблик(Слушатель) Экспорт

	Модуль = МодульСлушателя(Слушатель);
	Модуль.ЗакрытьСессиюСлушателя_Паблик(Слушатель);
	
КонецПроцедуры

Процедура ЗакрытьСессиюСлушателя_Приват(Слушатель) Экспорт

	Модуль = МодульСлушателя(Слушатель);
	Модуль.ЗакрытьСессиюСлушателя_Приват(Слушатель);
	
КонецПроцедуры

Процедура Подпис_МаркетЦены(Параметры) Экспорт
	
	Модуль		= МодульСлушателя(Параметры.Слушатель);	
	Модуль.Подпис_МаркетЦены(Параметры);
		
КонецПроцедуры

Процедура Подпис_ИзмененияОрдеров(Параметры) Экспорт
	
	Модуль		= МодульСлушателя(Параметры.Слушатель);	
	Модуль.Подпис_ИзмененияОрдеров(Параметры);	
		
КонецПроцедуры

#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

Процедура МенеджерЗапускаИПоддержанияСоединений() Экспорт
	
	МенеджерКлиентовПубличныхКаналов();
	МенеджерКлиентовПриватныхКаналов();
	ОтправитьПингПоОткрытымСоединениям();
		
КонецПроцедуры

Процедура ЗаписатьВЛог(Обработчик,Ключ,Параметры=Неопределено) Экспорт
	
	// включаем только для отладки, много текста :)
	//Возврат;
	
	ТаймСтамп 	= биг_ОбщегоНазначенияКлиентСервер.ТекущаяДатаВМиллисекундахЭпохаUnixGMT0();
	Дата 		= ТекущаяДатаСеанса();
	
	Если Не ЗначениеЗаполнено(Параметры) Тогда 
		Параметры = Новый Структура;
	КонецЕсли;	
		
	БылаОшибка = Ложь;
	Попытка	
		               
		НаборЗаписей = РегистрыСведений.биг_СобытияВебСокеты.СоздатьНаборЗаписей();  			
		НаборЗаписей.Отбор.ТаймСтамп.Установить(ТаймСтамп);
		НаборЗаписей.Отбор.Обработчик.Установить(Обработчик);
		НаборЗаписей.Отбор.Ключ.Установить(Ключ);
		НаборЗаписей.Прочитать();	

		Если НаборЗаписей.Количество() = 0 Тогда
			НоваяЗаписьРегистра = НаборЗаписей.Добавить();
			НоваяЗаписьРегистра.ТаймСтамп	= ТаймСтамп;
			НоваяЗаписьРегистра.Дата 		= Дата;
			НоваяЗаписьРегистра.Обработчик 	= Обработчик;
			НоваяЗаписьРегистра.Ключ 		= Ключ;	
		Иначе
			НоваяЗаписьРегистра = НаборЗаписей[0];
		КонецЕсли;
				
       	Для Каждого текПараметр Из Параметры Цикл 
				
			НоваяЗаписьРегистра[текПараметр.Ключ] = текПараметр.Значение;	
			
		КонецЦикла;
		
		
		НаборЗаписей.Записать(); 
					
	Исключение	
		
		БылаОшибка = Истина;
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			
	КонецПопытки;

	Если БылаОшибка Тогда 
		ЗаписьЖурналаРегистрации("Ошибка",УровеньЖурналаРегистрации.Ошибка,,,ТекстОшибки);
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОчиститьЛоги() Экспорт
	
	Набор = РегистрыСведений.биг_СобытияВебСокеты.СоздатьНаборЗаписей();
	Набор.Записать(Истина);
		
КонецПроцедуры

Функция ПолучитьАккаунтыБиржСВебСокетами() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	big_MarketAccounts.Ссылка КАК Слушатель,
	|	big_MarketAccounts.demo КАК ЭтоДемо,
	|	big_MarketAccounts.Владелец.МодульВебСокет КАК Модуль
	|ИЗ
	|	Справочник.big_MarketAccounts КАК big_MarketAccounts
	|ГДЕ
	|	НЕ big_MarketAccounts.ПометкаУдаления
	|	И НЕ big_MarketAccounts.Владелец.ПометкаУдаления
	|	И big_MarketAccounts.Владелец.МодульВебСокет <> """"";
	Выборка = Запрос.Выполнить().Выбрать();
	
	МассивСлушателей = Новый Массив;
	Пока Выборка.Следующий() Цикл
		СтруктураСессии = биг_ВебСокет_КлиентСервер.СтруктураСоединенияВебСокета();
		СтруктураСессии.Слушатель 	= Выборка.Слушатель;
		СтруктураСессии.Модуль		= Выборка.Модуль;
		СтруктураСессии.ЭтоДемо		= Выборка.ЭтоДемо;
		МассивСлушателей.Добавить(СтруктураСессии);
	КонецЦикла;
	
	Возврат МассивСлушателей;
		
КонецФункции 

Функция ПолучитьКлючСоединения(Слушатель, Адрес) Экспорт
	
	Возврат РегистрыСведений.биг_СоединенияВебСокет.ПолучитьКлючСоединенияСлушателя(Слушатель, Адрес);	
	
КонецФункции


#КонецОбласти //СлужебныйПрограммныйИнтерфейс


#Область СлужебныеПроцедурыИФункции

Функция МодульСлушателя(Слушатель)
	
	ИмяМодуля 	= МодульВебСокетаСлушателя(Слушатель);
	Возврат ОбщегоНазначения.ОбщийМодуль(ИмяМодуля);
		
КонецФункции

Функция ПолучитьБиржиСВебСокетами()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	big_Markets.Ссылка КАК Слушатель,
	|	big_Markets.МодульВебСокет КАК Модуль
	|ИЗ
	|	Справочник.big_Markets КАК big_Markets
	|ГДЕ
	|	big_Markets.МодульВебСокет <> """"
	|	И НЕ big_Markets.ПометкаУдаления";
	Выборка = Запрос.Выполнить().Выбрать();
	
	МассивСлушателей = Новый Массив;
	Пока Выборка.Следующий() Цикл
		СтруктураСессии = биг_ВебСокет_КлиентСервер.СтруктураСоединенияВебСокета();
		СтруктураСессии.Слушатель 	= Выборка.Слушатель;
		СтруктураСессии.Модуль		= Выборка.Модуль;
		МассивСлушателей.Добавить(СтруктураСессии);
	КонецЦикла;
	
	Возврат МассивСлушателей;	
		
КонецФункции

Функция МодульВебСокетаСлушателя(Слушатель)
	
	Если ТипЗнч(Слушатель) = Тип("СправочникСсылка.big_Markets") Тогда
		Биржа 	= Слушатель;
	ИначеЕсли ТипЗнч(Слушатель) = Тип("СправочникСсылка.big_MarketAccounts") Тогда
		Биржа 	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Слушатель, "Владелец");		
	Иначе
		Сообщить("биг_ВебСокет_Сервер.МодульВебСокетаСлушателя(Слушатель) - передан Слушатель недопустимого типа");
		Возврат Неопределено;
	КонецЕсли;
	
	ИмяМодуля 	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Биржа, "МодульВебСокет");		
	Возврат ИмяМодуля;
	
КонецФункции

Процедура ОтправитьПингПоОткрытымСоединениям()

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	биг_СоединенияВебСокет.Слушатель КАК Слушатель,
	|	биг_СоединенияВебСокет.Адрес КАК Адрес,
	|	биг_СоединенияВебСокет.КлючСоединения КАК КлючСоединения,
	|	биг_СоединенияВебСокет.КлючКлиента КАК КлючКлиента,
	|	биг_СоединенияВебСокет.ТребуетсяАвторизация КАК ТребуетсяАвторизация
	|ИЗ
	|	РегистрСведений.биг_СоединенияВебСокет КАК биг_СоединенияВебСокет";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		// по какой то причине в "первый" раз после запуска не все соединения поднимаются
		// валится ошибка TLS handshake: certificate verify failed (asio.ssl, 337047686) для OKX
		Попытка
			Соединение = WebSocketКлиентСоединения.ПолучитьСоединение(Выборка.КлючСоединения);
			Соединение.ОтправитьСообщение("ping");	
		Исключение
			
			// откроем соединение еще раз точечно 
			Клиент = WebSocketКлиенты.НайтиПоКлючу(Выборка.КлючКлиента);
			Модуль = МодульСлушателя(Выборка.Слушатель);
			Модуль.ПроверитьСоздатьСоединениеВебСокет(Выборка.Слушатель, Клиент, Выборка.ТребуетсяАвторизация);
		КонецПопытки;		
	КонецЦикла;
	
КонецПроцедуры

Процедура МенеджерКлиентовПубличныхКаналов()
	
	МассивСлушателей = ПолучитьБиржиСВебСокетами();
	
	Для каждого Элемент Из МассивСлушателей Цикл
		Модуль = ОбщегоНазначения.ОбщийМодуль(Элемент.Модуль);
		Модуль.СоздатьКлиентовИСессии_Паблик(Элемент.Слушатель);
	КонецЦикла;
	
КонецПроцедуры

Процедура МенеджерКлиентовПриватныхКаналов()
	
	МассивСлушателей = ПолучитьАккаунтыБиржСВебСокетами();
	
	Для каждого Элемент Из МассивСлушателей Цикл
		Модуль = ОбщегоНазначения.ОбщийМодуль(Элемент.Модуль);
		Модуль.СоздатьКлиентовИСессии_Приват(Элемент.Слушатель, Элемент.ЭтоДемо);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти