
Процедура ПередЗаписью(Отказ)
	
	ПроверкаДубляРабочейНастройки(Отказ);
	
КонецПроцедуры                     

Процедура ПроверкаДубляРабочейНастройки(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	биг_КлючиНастроекСтратегии.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.биг_КлючиНастроекСтратегии КАК биг_КлючиНастроекСтратегии
	|ГДЕ
	|	биг_КлючиНастроекСтратегии.Владелец = &Владелец
	|	И биг_КлючиНастроекСтратегии.Бар = &Бар
	|	И биг_КлючиНастроекСтратегии.РабочаяНастройка";
	Запрос.УстановитьПараметр("Владелец", 	Владелец);
	Запрос.УстановитьПараметр("Бар", 		Бар);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Отказ = Истина;
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		Сообщить("Уже есть Рабочая настройка по ключевым данным Владелец и Бар: " + Выборка.Ссылка);
	КонецЕсли;
		
КонецПроцедуры

