	  
	  
#Область ПрограммныйИнтерфейс

#КонецОбласти


#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	ПроверкаЛогикиЗаполнения(Отказ, РежимЗаписи, РежимПроведения);
	
	Если ЗначениеЗаполнено(ordId) И НЕ ЗначениеЗаполнено(биг_ПредставлениеДляОтчета) Тогда
		
		биг_ПредставлениеДляОтчета = Формат(Дата, "ДФ=yyyy.MM.dd") + " " + ВРег(Строка(side)) + " ORD ID: " + ordId;		
	КонецЕсли;
	
	Если (sz = accFillSz ИЛИ execType = "T") И state <> "FILLED" Тогда
		state = "FILLED";
	КонецЕсли;
	
	ЗарегистрироватьВПоследовательность();
    
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	clOrdId = биг_ОКХ_КлиентСервер.КлиентскийИдентификатор(Ссылка);	
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
					
		Аккаунт				= ДанныеЗаполнения.Аккаунт;
		Дата				= ТекущаяДатаСеанса();
		Статус				= Перечисления.big_СтатусыТорговыхОбъектов.Новый;			
		Стратегия			= ДанныеЗаполнения.Стратегия;
		НастройкаСтратегии	= ДанныеЗаполнения.КлючНастроек;
		ТочкаНачалаПадения	= ДанныеЗаполнения.Сигнал;
		Операция			= ДанныеЗаполнения.Операция;
		Сделка				= ДанныеЗаполнения.Сделка;
			
        Событие				= ДанныеЗаполнения.Событие;
		
		clOrdId				= ДанныеЗаполнения.КлиентОрдерИД;
		
		instType			= ДанныеЗаполнения.ИнструментТип;
		instId				= ДанныеЗаполнения.ИнструментИД;
		
		// для совместимости со старым кодом
		tdMode				= ?(ЗначениеЗаполнено(ДанныеЗаполнения.РежимТорговли), ДанныеЗаполнения.РежимТорговли, Перечисления.big_OKX_tdModes.isolated); 
		
		posSide				= Перечисления.big_OKX_PositionSides.net;  
		side				= ДанныеЗаполнения.ОрдерСторона;
		ordType				= ДанныеЗаполнения.ОрдерТип;
		
		//tgtCcy				= ДанныеЗаполнения.ЦелеваяМонета;
		sz					= ДанныеЗаполнения.РазмерОрдера; 
									
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ОтразитьДвижения_ОборотыПоСтратегиям(Отказ, РежимПроведения);
	//ОтразитьДвижения_ОборотыПоОперациям(Отказ, РежимПроведения);
	ОтразитьДвижения_СтатусОперацииПортфеля(Отказ, РежимПроведения);
	ОтразитьДвижения_СебестоимостьАктивов(Отказ, РежимПроведения);
	ОтразитьДвижения_ПрибылиИУбытки(Отказ, РежимПроведения);
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиПроведения

Процедура ОтразитьДвижения_ОборотыПоСтратегиям(Отказ, РежимПроведения)
	
	Если Врег(state) = "FILLED" Тогда
		
		ОборотыПоСтратегиям = Движения.биг_ОборотыПоСтратегиям;
		
		НС = ОборотыПоСтратегиям.Добавить();
		
		Если ЗначениеЗаполнено(fillTime) Тогда
			ТССтрокой			= Формат(fillTime, "ЧГ=0");
		Иначе
			ТССтрокой		= биг_ОбщегоНазначенияКлиентСервер.ДатуВTimestampСтрока(Дата);	
		КонецЕсли;
		
		НС.Период			= биг_ОбщегоНазначенияКлиентСервер.TimestampВДату(Лев(ТССтрокой, 10));
		НС.Биржа			= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Аккаунт, "Владелец");
		НС.ИнструментИД     = instId;
		НС.Аккаунт          = Аккаунт;
		НС.Стратегия        = Стратегия;
		НС.КлючНастроек		= НастройкаСтратегии;
		
		Если instType = Перечисления.big_OKX_InstrumentType.SWAP Тогда
			НС.ВалютаКомиссии	= feeCcy;
			НС.ВалютаРезультата	= Справочники.big_Currencys.НайтиПоНаименованию("USDT", ИСтина);
			НС.Комиссия 		= ЭтотОбъект.fee; // без этогообъекта ругается синаткс, видимо попадаем в ключевое слово какое то типовое
			НС.ПрофитЛосс 		= pnl;
		Иначе
			Сообщить("Обработчик проведения для типов, кроме SWAP, не реализован");
			
			//НС.ВалютаКомиссии	= feeCcy;
			
			// для маржи?
			// НС.ВалютаРезультата	= Справочники.big_Currencys.НайтиПоНаименованию("BTC", ИСтина);
			
			// НС.Комиссия 		= ЭтотОбъект.fee;
			// НС.ПрофитЛосс 		= pnl;
		КонецЕсли;			
		
		ОборотыПоСтратегиям.Записывать = Истина;
	КонецЕсли;
	
КонецПроцедуры 

Процедура ОтразитьДвижения_СтатусОперацииПортфеля(Отказ, РежимПроведения)
	
	Если ЗначениеЗаполнено(Операция) И ЗначениеЗаполнено(Сделка) И ЗначениеЗаполнено(Аккаунт) Тогда	
		
		Портфель 	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Операция, "Портфель");
		Если ЗначениеЗаполнено(Портфель) Тогда			
			
			СтатусыСработал = Новый Массив;       
			СтатусыСработал.Добавить("FILLED");
			// копипаста из биг_ДаблИмпакт.ПроверитьАктуальностьСигнала()
			СтатусыСработал.Добавить("EFFECTIVE");
			СтатусыСработал.Добавить("PARTIALLY_EFFECTIVE");
			
			Если ЗначениеЗаполнено(ordId) И СтатусыСработал.Найти(Врег(state)) <> Неопределено Тогда
				
				Блокировка = Новый БлокировкаДанных;
				ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.биг_ОперацииПортфеля");
				ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
				ЭлементБлокировки.УстановитьЗначение("Портфель",	Портфель);
				ЭлементБлокировки.УстановитьЗначение("Сделка", 		Сделка);
				ЭлементБлокировки.УстановитьЗначение("Операция", 	Операция);
				ЭлементБлокировки.УстановитьЗначение("Аккаунт", 	Аккаунт);
				Блокировка.Заблокировать(); 
				
				Набор = РегистрыСведений.биг_ОперацииПортфеля.СоздатьНаборЗаписей();
				Набор.Отбор.Портфель.Установить(Портфель);
				Набор.Отбор.Сделка.Установить(Сделка);
				Набор.Отбор.Операция.Установить(Операция);
				Набор.Отбор.Аккаунт.Установить(Аккаунт);
				Набор.Прочитать();
				
				Если Набор.Количество() = 1 Тогда
					Запись = Набор[0];
					Запись.ИнтеграционныйДокумент = Ссылка;					
					Запись.Статус = Перечисления.big_СтатусыТорговыхОбъектов.Исполнен;					
					Набор.Записать(Истина);
				Иначе
					//ВызватьИсключение("Запись движений в РС Операции портфеля. Получено непредвиденное Количество записей");
				КонецЕсли;
			КонецЕсли;				
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтразитьДвижения_СебестоимостьАктивов(Отказ, РежимПроведения)

	Себестоимость = Движения.биг_СебестоимостьАктивов;
	Себестоимость.Очистить();
	Себестоимость.Записывать = Истина;
	
	Если instType = Перечисления.big_OKX_InstrumentType.SPOT И Врег(state) = "FILLED" Тогда
		
		Себестоимость_ОтразитьПриход(Себестоимость);
		Себестоимость_ОтразитьРасход(Себестоимость, Отказ); 	
	КонецЕсли;	
		
КонецПроцедуры 

Процедура ОтразитьДвижения_ПрибылиИУбытки(Отказ, РежимПроведения)
	
	ПрибылиУбытки = Движения.биг_ПрибылиИУбытки;
	ПрибылиУбытки.Очистить();
	ПрибылиУбытки.Записывать = Истина;
	
	Если instType = Перечисления.big_OKX_InstrumentType.SPOT Тогда
		Портфель = биг_ПортфельноеУправление.ОпределитьПортфельАккаунта(Аккаунт);
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.биг_ПрибылиИУбытки");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.УстановитьЗначение("Портфель", 	Портфель);
		ЭлементБлокировки.УстановитьЗначение("Аккаунт", 	Аккаунт);
		ЭлементБлокировки.УстановитьЗначение("Сделка", 		Сделка);
		Блокировка.Заблокировать();
		
		// Для Спота комсу не пишем, т.к. она уже учтена в себесе партии и PnL будет рассчитан с учетом комиссии
		//Запись = ПрибылиУбытки.Добавить();
		//Запись.Период		= Дата;
		//Запись.Портфель		= Портфель;
		//Запись.Аккаунт		= Аккаунт;
		//Запись.Сделка		= Сделка;
		//Запись.Валюта		= Справочники.big_Currencys.НайтиПоНаименованию(feeCcy, Истина);
		//Запись.Убыток		= fee;
		//Запись.Комментарий	= "fee";
		
		Если side = Перечисления.big_OKX_OrderSides.sell Тогда
			
			Запись = ПрибылиУбытки.Добавить();
			Запись.Период			= Дата;
			Запись.Портфель			= Портфель;
			Запись.Аккаунт			= Аккаунт;
			Запись.Сделка			= Сделка;
			
			Инструмент 				= Справочники.big_Instruments.НайтиПоРеквизиту("instId", instId);
			РеквизитыИнструмента 	= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Инструмент, "baseCcy, ctValCcy, quoteCcy, settleCcy");
			Монета 					= ?(ЗначениеЗаполнено(РеквизитыИнструмента.quoteCcy), РеквизитыИнструмента.quoteCcy, РеквизитыИнструмента.settleCcy);
			Запись.Валюта			= Монета;
			Запись.Прибыль			= ОпределитьРазницуСебестоимостиИПродажи();
			Запись.Комментарий		= "PnL";
		КонецЕсли;
	КонецЕсли;		
	
КонецПроцедуры

Процедура Себестоимость_ОтразитьПриход(Себестоимость)
	
	Если side = Перечисления.big_OKX_OrderSides.buy Тогда
		
		Портфель 	= биг_ПортфельноеУправление.ОпределитьПортфельАккаунта(Аккаунт);
		Монета		= Справочники.big_Currencys.НайтиПоРеквизиту("ccy", feeCcy);
		Блокировка 	= Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.биг_СебестоимостьАктивов");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.УстановитьЗначение("Аккаунт", Аккаунт);
		ЭлементБлокировки.УстановитьЗначение("Монета", Монета);
		Блокировка.Заблокировать();
		
		Запись = Себестоимость.ДобавитьПриход(); 
		Запись.Период		= Дата;
		Запись.Аккаунт 		= Аккаунт;
		Запись.Монета		= Монета;
		Запись.Портфель		= Портфель;
		Запись.Партия		= Ссылка;
		Запись.Количество	= sz + fee;
		Запись.Сумма		= avgPx * sz;
	КонецЕсли;
		
КонецПроцедуры

Процедура Себестоимость_ОтразитьРасход(Себестоимость, Отказ)

	Если side = Перечисления.big_OKX_OrderSides.sell Тогда
		
		Портфель 	= биг_ПортфельноеУправление.ОпределитьПортфельАккаунта(Аккаунт);
		Монета		= Справочники.big_Currencys.НайтиПоРеквизиту("ccy", ccy);
		
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.биг_СебестоимостьАктивов");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.УстановитьЗначение("Аккаунт", 	Аккаунт);
		ЭлементБлокировки.УстановитьЗначение("Монета",		Монета);
		Блокировка.Заблокировать();
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	биг_СебестоимостьАктивовОстатки.Аккаунт КАК Аккаунт,
		|	биг_СебестоимостьАктивовОстатки.Монета КАК Монета,
		|	биг_СебестоимостьАктивовОстатки.Портфель КАК Портфель,
		|	биг_СебестоимостьАктивовОстатки.Партия КАК Партия,
		|	биг_СебестоимостьАктивовОстатки.КоличествоОстаток КАК Количество,
		|	биг_СебестоимостьАктивовОстатки.СуммаОстаток КАК Сумма
		|ИЗ
		|	РегистрНакопления.биг_СебестоимостьАктивов.Остатки(
		|			&ДатаДокумента,
		|			Аккаунт = &Аккаунт
		|				И Монета = &Монета
		|				И (Портфель = &Портфель
		|					ИЛИ Портфель = ЗНАЧЕНИЕ(Справочник.биг_Портфели.ПустаяСсылка))) КАК биг_СебестоимостьАктивовОстатки
		|
		|УПОРЯДОЧИТЬ ПО
		|	биг_СебестоимостьАктивовОстатки.Партия.Дата";
		
		Запрос.УстановитьПараметр("Аккаунт", 		Аккаунт);
		Запрос.УстановитьПараметр("Монета", 		Монета);
		Запрос.УстановитьПараметр("Портфель", 		Портфель);
		Запрос.УстановитьПараметр("ДатаДокумента", 	Дата);
		
		РезультатЗапроса 	= Запрос.Выполнить();		
		Выборка 			= РезультатЗапроса.Выбрать();
    
	    ОстатокДляСписания 	= sz;
	    	    
	    // Проходим по всем партиям
	    Пока Выборка.Следующий() Цикл
	        Если ОстатокДляСписания <= 0 Тогда
	            Прервать;
	        КонецЕсли;
	        
	        ТекущееКоличество 	= Выборка.Количество;
	        ТекущаяСумма 		= Выборка.Сумма;
	        
	        Если ТекущееКоличество >= ОстатокДляСписания Тогда
				
				// Если текущей партии достаточно для полного списания
	            СписанноеКоличество = ОстатокДляСписания;
	            СписаннаяСумма 		= Окр(ТекущаяСумма * СписанноеКоличество / ТекущееКоличество, 8);
	            
	            // Обновляем остатки партии
	            Запись = Себестоимость.ДобавитьРасход();
				Запись.Регистратор	= Ссылка;
				Запись.Период		= Дата;
	            Запись.Аккаунт 		= Выборка.Аккаунт;
	            Запись.Монета 		= Выборка.Монета;
	            Запись.Портфель 	= Выборка.Портфель;
	            Запись.Партия 		= Выборка.Партия;
	            Запись.Количество 	= СписанноеКоличество;
	            Запись.Сумма 		= СписаннаяСумма;
	            
	            ОстатокДляСписания 	= 0;
	        Иначе
	            // Если текущей партии недостаточно, списываем её полностью
	            СписанноеКоличество = ТекущееКоличество;
	            СписаннаяСумма 		= ТекущаяСумма;
	            
	            // Обновляем остатки партии
	            Запись = Себестоимость.ДобавитьРасход();
				Запись.Регистратор	= Ссылка;
				Запись.Период		= Дата;
	            Запись.Аккаунт 		= Выборка.Аккаунт;
	            Запись.Монета 		= Выборка.Монета;
	            Запись.Портфель 	= Выборка.Портфель;
	            Запись.Партия 		= Выборка.Партия;
	            Запись.Количество 	= СписанноеКоличество;
	            Запись.Сумма 		= СписаннаяСумма;
	            
	            ОстатокДляСписания 	= ОстатокДляСписания - СписанноеКоличество;
	        КонецЕсли;
	    КонецЦикла;
	    
	    // Проверяем, что все требуемое количество было списано
	    Если ОстатокДляСписания > 0 Тогда
			
			// Недостаточно остатка для списания. Положим на пустую партию, потом разберемся
			Запись = Себестоимость.ДобавитьРасход();
			Запись.Регистратор	= Ссылка;
			Запись.Период		= Дата;
            Запись.Аккаунт 		= Выборка.Аккаунт;
            Запись.Монета 		= Выборка.Монета;
            Запись.Портфель 	= Выборка.Портфель;
            Запись.Партия 		= Документы.big_Order_OKX.ПустаяСсылка();
            Запись.Количество 	= ОстатокДляСписания;
            Запись.Сумма 		= 0;	
	    КонецЕсли;				
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Процедура ПроверкаЛогикиЗаполнения(Отказ, РежимЗаписи, РежимПроведения)
	
	ПроверкаПо_ordType(Отказ, РежимЗаписи, РежимПроведения);
	
	//tgtCcy = Instrument.baseCcy; 
	
КонецПроцедуры

Процедура ПроверкаПо_ordType(Отказ, РежимЗаписи, РежимПроведения)

	//limit: Limit order, which requires specified sz and px.
	Если ordType = Перечисления.big_OKX_OrderTypes.limit Тогда
		
		Если Не ЗначениеЗаполнено(sz) Тогда
			Сообщить("Тип ордера = 'limit', должно быть заполнено поле 'sz'");
			Отказ = Истина;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(px) Тогда
			Сообщить("Тип ордера = 'limit', должно быть заполнено поле 'px'");
			Отказ = Истина;
		КонецЕсли;
		
	КонецЕсли;
	   	
	//For OPTION, market order is not supported yet. As the filled price for market orders 
	//cannot be determined in advance, OKX reserves/freezes your quote currency by an additional 5% for risk check.
	Если ordType = Перечисления.big_OKX_OrderTypes.market И instType = Перечисления.big_OKX_InstrumentType.OPTION Тогда
		Сообщить("ordType 'market' недопустим для instType 'OPTION'");
		Отказ = Истина;
	КонецЕсли; 
	    
КонецПроцедуры

Функция ОпределитьРазницуСебестоимостиИПродажи()
	
	СебесПродажи = 0;
	Если Движения.биг_СебестоимостьАктивов.Количество() = 0 Тогда
		
	Иначе
		Для каждого Строка Из Движения.биг_СебестоимостьАктивов Цикл
			СебесПродажи = СебесПродажи + Строка.Сумма;	
		КонецЦикла;
	КонецЕсли;
	
	Разница = avgPx * sz - СебесПродажи;
	
	Возврат Разница;
	
КонецФункции

Процедура ЗарегистрироватьВПоследовательность()
	
	Если instType = Перечисления.big_OKX_InstrumentType.SPOT И Врег(state) = "FILLED" Тогда
		
		НС = ПринадлежностьПоследовательностям.биг_ПартииМонет.Добавить();
		НС.Аккаунт 	= Аккаунт;
		
		Если side = Перечисления.big_OKX_OrderSides.sell Тогда
			Монета		= Справочники.big_Currencys.НайтиПоРеквизиту("ccy", ccy);
		Иначе
			Монета		= Справочники.big_Currencys.НайтиПоРеквизиту("ccy", feeCcy);
		КонецЕсли;
		
		НС.Монета		= Монета;
		
		НС.Регистратор 	= Ссылка;
		НС.Период		= ?(ЭтоНовый(), ТекущаяДата(), Дата);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


	  
	  









