
Процедура ПередПодключением(Клиент)
	биг_ОКХ_ВебСокет_КлиентСервер.ПередПодключением(Клиент); 
КонецПроцедуры

Процедура ПриОткрытииСоединения(Соединение)
	биг_ОКХ_ВебСокет_КлиентСервер.ПриОткрытииСоединения(Соединение);   
КонецПроцедуры

Процедура ПриПолученииСообщения(Соединение, Сообщение)
	биг_ОКХ_ВебСокет_КлиентСервер.ПриПолученииСообщения(Соединение, Сообщение);
КонецПроцедуры

Процедура ПриОшибке(Соединение, КодОшибки, Описание)
	биг_ОКХ_ВебСокет_КлиентСервер.ПриОшибке(Соединение, КодОшибки, Описание);
КонецПроцедуры

Процедура ПриЗакрытииСоединения(Соединение, КодЗакрытия)
	биг_ОКХ_ВебСокет_КлиентСервер.ПриЗакрытииСоединения(Соединение, КодЗакрытия);
КонецПроцедуры

