
#Область ПрограммныйИнтерфейс

// Функция выполняет трансляцию произвольного XDTO-объекта 
// между версиями по зарегистрированным в системе обработчикам трансляции,
// определяя результирующую версию по пространству имен результирующего сообщения.
// @skip-warning ПустойМетод - особенность реализации.
//
// Параметры:
//  ИсходныйОбъект - ОбъектXDTO - Транслируемый объект.
//  РезультирующаяВерсия - строка - Номер результирующей версии интерфейса, в формате РР.{П|ПП}.ЗЗ.СС.
//  ПакетИсходнойВерсии - Строка - пространство имен версии сообщения.
//
// Возвращаемое значение:
//  ОбъектXDTO - результат трансляции объекта.
//
Функция ТранслироватьВВерсию(Знач ИсходныйОбъект, Знач РезультирующаяВерсия,
		Знач ПакетИсходнойВерсии = "") Экспорт
КонецФункции

// Функция выполняет трансляцию произвольного XDTO-объекта 
// между версиями по зарегистрированным в системе обработчикам трансляции,
// определяя результирующую версию по пространству имен результирующего сообщения.
// @skip-warning ПустойМетод - особенность реализации.
//
// Параметры:
//  ИсходныйОбъект - ОбъектXDTO - Транслируемый объект.
//  ПакетРезультирующейВерсии - Строка - Пространство имен результирующей версии.
//  ПакетИсходнойВерсии - Строка - пространство имен версии сообщения.
//
// Возвращаемое значение:
//  ОбъектXDTO - результат трансляции объекта.
//
Функция ТранслироватьВПространствоИмен(Знач ИсходныйОбъект,
		Знач ПакетРезультирующейВерсии, Знач ПакетИсходнойВерсии = "") Экспорт
КонецФункции

#КонецОбласти
