
////////////////////////////////////////////////////////////////////////////////
// <Заголовок модуля: краткое описание и условия применения модуля.>
//  
////////////////////////////////////////////////////////////////////////////////


#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Ползунок_Объем		= 100;
	
	Параметры.Свойство("АлгоОрдер", АлгоОрдер);
	Параметры.Свойство("Сделка", Сделка);
	Параметры.Свойство("ТекущаяЦена", ТекущаяЦена);
	
	ЗаполнитьТекущиеУровниОрдера();
	
	Если Сделка.СторонаСделки = Перечисления.big_OKX_PositionSides.short Тогда
		
		Элементы.ПолзунокСтопЛосс.МинимальноеЗначение = -10;
		Элементы.ПолзунокСтопЛосс.МаксимальноеЗначение = 0;
		
		Элементы.ПолзунокТейкПрофит.МинимальноеЗначение = -10;
		Элементы.ПолзунокТейкПрофит.МаксимальноеЗначение = 0;
	Иначе
		
		Элементы.ПолзунокСтопЛосс.МинимальноеЗначение = 0;
		Элементы.ПолзунокСтопЛосс.МаксимальноеЗначение = 10;
		
		Элементы.ПолзунокТейкПрофит.МинимальноеЗначение = 0;
		Элементы.ПолзунокТейкПрофит.МаксимальноеЗначение = 10;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура Ползунок_ОбъемПриИзменении(Элемент)
	
	Изменение 	= Объем_Тек / 100 * Ползунок_Объем;
	Объем_Новый	= Объем_Новый + Изменение;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолзунокСтопЛоссПриИзменении(Элемент)
	
	Изменение		= СЛ_ТекТриггер / 100 * ПолзунокСтопЛосс;
	СЛ_НовыйТриггер	= СЛ_ТекТриггер + Изменение;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолзунокТейкПрофитПриИзменении(Элемент)
	
	Изменение		= ТП_ТекТриггер / 100 * ПолзунокТейкПрофит;
	ТП_НовыйТриггер	= ТП_ТекТриггер + Изменение;
	
КонецПроцедуры

&НаКлиенте
Процедура Объем_НовыйПриИзменении(Элемент)
	
	Ползунок_Объем = (Объем_Новый / (Объем_Тек / 100)) - 100;	
	
КонецПроцедуры

&НаКлиенте
Процедура СЛ_НовыйТриггерПриИзменении(Элемент)
	
	СторонаСделки = ПолучитьСторонуСделкиНаСервере(Сделка);
	Если СторонаСделки = ПредопределенноеЗначение("Перечисление.big_OKX_PositionSides.short") Тогда
		
		// проверки в рамках одного тригера
		Если СЛ_НовыйТриггер <= ТекущаяЦена ИЛИ СЛ_НовыйТриггер > СЛ_ТекТриггер  Тогда
			СЛ_НовыйТриггер = СЛ_ТекТриггер;	
		КонецЕсли;
		
		// проверка крос-тригер
		Если СЛ_НовыйТриггер <= ?(ТП_НовыйТриггер > 0, ТП_НовыйТриггер, ТП_ТекТриггер) Тогда
			СЛ_НовыйТриггер = СЛ_ТекТриггер;		
		КонецЕсли;
	Иначе
		
		// проверки в рамках одного тригера
		Если СЛ_НовыйТриггер >= ТекущаяЦена ИЛИ СЛ_НовыйТриггер < СЛ_ТекТриггер Тогда
			СЛ_НовыйТриггер = СЛ_ТекТриггер;	
		КонецЕсли;
		
		// проверка крос-тригер
		Если СЛ_НовыйТриггер >= ?(ТП_НовыйТриггер > 0, ТП_НовыйТриггер, ТП_ТекТриггер) Тогда
			СЛ_НовыйТриггер = СЛ_ТекТриггер;		
		КонецЕсли;
	КонецЕсли;	
	
	ПолзунокСтопЛосс = (СЛ_НовыйТриггер / (СЛ_ТекТриггер / 100)) - 100;	
	
КонецПроцедуры

&НаКлиенте
Процедура ТП_НовыйТриггерПриИзменении(Элемент)
	
	СторонаСделки = ПолучитьСторонуСделкиНаСервере(Сделка);
	Если СторонаСделки = ПредопределенноеЗначение("Перечисление.big_OKX_PositionSides.short") Тогда
		
		// проверки в рамках одного тригера
		Если ТП_НовыйТриггер >= ТекущаяЦена ИЛИ ТП_НовыйТриггер > ТП_ТекТриггер  Тогда
			ТП_НовыйТриггер = ТП_ТекТриггер;	
		КонецЕсли;
		
		// проверка крос-тригер
		Если ТП_НовыйТриггер >= ?(СЛ_НовыйТриггер > 0, СЛ_НовыйТриггер, СЛ_ТекТриггер) Тогда
			ТП_НовыйТриггер = ТП_ТекТриггер;		
		КонецЕсли;
	Иначе
		
		// проверки в рамках одного тригера
		Если ТП_НовыйТриггер <= ТекущаяЦена ИЛИ ТП_НовыйТриггер < ТП_ТекТриггер Тогда
			ТП_НовыйТриггер = ТП_ТекТриггер;	
		КонецЕсли;
		
		// проверка крос-тригер
		Если ТП_НовыйТриггер <= ?(СЛ_НовыйТриггер > 0, СЛ_НовыйТриггер, СЛ_ТекТриггер) Тогда
			ТП_НовыйТриггер = ТП_ТекТриггер;		
		КонецЕсли;
	КонецЕсли;
	
	ПолзунокТейкПрофит = (ТП_НовыйТриггер / (ТП_ТекТриггер / 100)) - 100;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОК(Команда)
	
	Если ПроверкаЗаполнения() Тогда
		Ответ = Новый Структура("АлгоОрдер, Объем_Новый, СЛ_НовыйТриггер, ТП_НовыйТриггер", АлгоОрдер, Объем_Новый, СЛ_НовыйТриггер, ТП_НовыйТриггер);
		Закрыть(Ответ);		
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура КомандаОтмена(Команда)
	Закрыть(Неопределено);
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ПроверкаЗаполнения()

	Результат = Истина;
	
	Если СЛ_НовыйТриггер < СЛ_ТекТриггер Тогда
		Результат = Ложь;
		Сообщить("Запрещено уменьшать уровень Стоп Лосс");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьТекущиеУровниОрдера()

	СписокРеквизитов	= "СтопЛосс_Триггер, ТейкПрофит_Триггер, Объем, ТейкПрофит_ТриггерНовый, СтопЛосс_ТриггерНовый, ОбъемНовый";
	Реквизиты			= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(АлгоОрдер, СписокРеквизитов);

	Объем_Тек			= ?(Реквизиты.ОбъемНовый > 0, Реквизиты.ОбъемНовый, Реквизиты.Объем);
	СЛ_ТекТриггер       = ?(Реквизиты.СтопЛосс_ТриггерНовый > 0, Реквизиты.СтопЛосс_ТриггерНовый, Реквизиты.СтопЛосс_Триггер);
	ТП_ТекТриггер       = ?(Реквизиты.ТейкПрофит_ТриггерНовый > 0, Реквизиты.ТейкПрофит_ТриггерНовый, Реквизиты.ТейкПрофит_Триггер);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСторонуСделкиНаСервере(Сделка)
	Возврат Сделка.СторонаСделки;	
КонецФункции

#КонецОбласти


