
// Функция ПолучитьДанныеСвечейПоТочке
//
// Параметры:
// параметрыВыборки - Структура - описание см. биг_ОбщегоНазначения.ПолучитьСтруктуруПараметровЗапросаДанныхПоСвечам() 
//
// Возвращаемое значение: 
// ТаблицаЗначений - Колонки см. РегистрСведений.биг_ДанныеСвечей
Функция ПолучитьДанныеСвечейПоТочке_ДаблИмпакт(Биржа, ИнструментИД, Бар, ТочкаВремениТС_НачалоПериода, ТочкаВремениТС_ЗавершениеПериода,
												КоличествоСвечей, ИсключаяПереданнуюТочку, ТолькоЗавершенные, ОграничениеПериода, СортировкаПоУбыванию) Экспорт
	    	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	биг_ДанныеСвечей.Биржа КАК Биржа,
	|	биг_ДанныеСвечей.ИнструментИД КАК ИнструментИД,
	|	биг_ДанныеСвечей.Бар КАК Бар,
	|	биг_ДанныеСвечей.TimeStamp КАК TimeStamp,
	|	биг_ДанныеСвечей.TimeStamp13 КАК TimeStamp13,
	|	биг_ДанныеСвечей.TimeStamp10 КАК TimeStamp10,
	|	биг_ДанныеСвечей.ДатаОткрытия КАК ДатаОткрытия,
	|	биг_ДанныеСвечей.ЦенаОткрытия КАК ЦенаОткрытия,
	|	биг_ДанныеСвечей.ЦенаМаксимум КАК ЦенаМаксимум,
	|	биг_ДанныеСвечей.ЦенаМинимум КАК ЦенаМинимум,
	|	биг_ДанныеСвечей.ЦенаЗакрытия КАК ЦенаЗакрытия,
	|	биг_ДанныеСвечей.Объем КАК Объем,
	|	биг_ДанныеСвечей.volCcy КАК volCcy,
	|	биг_ДанныеСвечей.volCcyQuote КАК volCcyQuote,
	|	биг_ДанныеСвечей.confirm КАК confirm,
	|	ЕСТЬNULL(ИндикаторRSI.Значение, 100) КАК ЦенаЗакрытияRSI14,
	|	ЕСТЬNULL(ИндикаторVolumeMA.Значение, 0) КАК volCcyMA20
	|ИЗ
	|	РегистрСведений.биг_ДанныеСвечей КАК биг_ДанныеСвечей
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.биг_ЗначенияИндикаторов КАК ИндикаторRSI
	|		ПО биг_ДанныеСвечей.Биржа = ИндикаторRSI.Биржа
	|			И биг_ДанныеСвечей.ИнструментИД = ИндикаторRSI.ИнструментИД
	|			И биг_ДанныеСвечей.Бар = ИндикаторRSI.Бар
	|			И биг_ДанныеСвечей.TimeStamp = ИндикаторRSI.TimeStamp
	|			И (ИндикаторRSI.Источник = ЗНАЧЕНИЕ(Перечисление.биг_ИсточникиДанныхТехническихИндикаторов.ЦенаЗакрытия))
	|			И (ИндикаторRSI.Индикатор1 = ЗНАЧЕНИЕ(Перечисление.биг_ВидыИндикаторов.RSI))
	|			И (ИндикаторRSI.Параметр1 = 14)
	|			И (ИндикаторRSI.Индикатор2 = ЗНАЧЕНИЕ(Перечисление.биг_ВидыИндикаторов.ПустаяСсылка))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.биг_ЗначенияИндикаторов КАК ИндикаторVolumeMA
	|		ПО биг_ДанныеСвечей.Биржа = ИндикаторVolumeMA.Биржа
	|			И биг_ДанныеСвечей.ИнструментИД = ИндикаторVolumeMA.ИнструментИД
	|			И биг_ДанныеСвечей.Бар = ИндикаторVolumeMA.Бар
	|			И биг_ДанныеСвечей.TimeStamp = ИндикаторVolumeMA.TimeStamp
	|			И (ИндикаторVolumeMA.Источник = ЗНАЧЕНИЕ(Перечисление.биг_ИсточникиДанныхТехническихИндикаторов.volCcy))
	|			И (ИндикаторVolumeMA.Индикатор1 = ЗНАЧЕНИЕ(Перечисление.биг_ВидыИндикаторов.MA))
	|			И (ИндикаторVolumeMA.Параметр1 = 20)
	|			И (ИндикаторVolumeMA.Индикатор2 = ЗНАЧЕНИЕ(Перечисление.биг_ВидыИндикаторов.ПустаяСсылка))
	|ГДЕ
	|	биг_ДанныеСвечей.Биржа = &Биржа
	|	И биг_ДанныеСвечей.ИнструментИД = &ИнструментИД
	|	И биг_ДанныеСвечей.Бар = &Бар
	|	И биг_ДанныеСвечей.TimeStamp МЕЖДУ &НачалоПериода И &ЗавершениеПериода
	|	И биг_ДанныеСвечей.TimeStamp <= &ОграничениеПериода
	|	%УсловиеТолькоЗавершенная%
	|
	|УПОРЯДОЧИТЬ ПО
	|	TimeStamp %УсловиеСортировки%";
	
	ПараметрыЗапроса = биг_ОбщегоНазначения.ПолучитьСтруктуруПараметровЗапросаДанныхПоСвечам();
	ПараметрыЗапроса.Биржа 								= Биржа ;
	ПараметрыЗапроса.ИнструментИД 						= ИнструментИД;
	ПараметрыЗапроса.Бар 								= Бар;
	ПараметрыЗапроса.ТочкаВремениТС_НачалоПериода 		= ТочкаВремениТС_НачалоПериода;
	ПараметрыЗапроса.ТочкаВремениТС_ЗавершениеПериода 	= ТочкаВремениТС_ЗавершениеПериода;
	ПараметрыЗапроса.КоличествоСвечей 					= КоличествоСвечей;
	ПараметрыЗапроса.ИсключаяПереданнуюТочку 			= ИсключаяПереданнуюТочку;
	ПараметрыЗапроса.ТолькоЗавершенные 					= ТолькоЗавершенные;
	ПараметрыЗапроса.ОграничениеПериода 				= ОграничениеПериода;
	ПараметрыЗапроса.СортировкаПоУбыванию 				= СортировкаПоУбыванию;
	
	биг_ОбщегоНазначения.ПолучитьДанныеСвечейПоТочке_УстановитьПараметрыЗапроса(Запрос, ПараметрыЗапроса);
	ДанныеСвечей = Запрос.Выполнить().Выгрузить();
	
	Возврат ДанныеСвечей;
		
КонецФункции
