////////////////////////////////////////////////////////////////////////////////
// Подсистема "Выгрузка загрузка данных".
// 
// Процедуры и функции данного модуля позволяют выгружать и загружать
// дополнительные отчеты и обработки.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Вызывается при регистрации произвольных обработчиков выгрузки данных.
// в данной процедуре требуется	дополнить таблицу обработчиков информацией о регистрируемых произвольных
// обработчиках выгрузки данных. См. ВыгрузкаЗагрузкаДанныхПереопределяемый.ПриРегистрацииОбработчиковВыгрузкиДанных.
// @skip-check module-empty-method - особенность реализации.
//
Процедура ПриРегистрацииОбработчиковВыгрузкиДанных(ТаблицаОбработчиков) Экспорт
	
КонецПроцедуры

#КонецОбласти