
#Область ПрограммныйИнтерфейс

Процедура МенеджерОбработкиОпераций() Экспорт
	
	// проверка, что задание уже выполняется (в моменте только один менеджер очереди. Ключ = Модуль.ИмяМетода из задания)
	Если биг_ОбщегоНазначения.ФоновоеЗаданиеАктивно_ПоКлючу("биг_ПортфельноеУправление.МенеджерОбработкиОпераций") Тогда
		Возврат;	
	КонецЕсли;
	
	// забираем очередь, проставляем статус = "В обработке"
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	биг_ОперацииПортфеля.Портфель КАК Портфель,
	|	биг_ОперацииПортфеля.Сделка КАК Сделка,
	|	биг_ОперацииПортфеля.Операция КАК Операция,
	|	биг_ОперацииПортфеля.Аккаунт КАК Аккаунт,
	|	биг_ОперацииПортфеля.ИнтеграционныйДокумент КАК ИнтеграционныйДокумент,
	|	биг_ОперацииПортфеля.Статус КАК Статус
	|ИЗ
	|	РегистрСведений.биг_ОперацииПортфеля КАК биг_ОперацииПортфеля
	|ГДЕ
	|	биг_ОперацииПортфеля.Статус = ЗНАЧЕНИЕ(Перечисление.big_СтатусыТорговыхОбъектов.Новый)
	|	И (биг_ОперацииПортфеля.ИнтеграционныйДокумент = НЕОПРЕДЕЛЕНО
	|			ИЛИ УНИКАЛЬНЫЙИДЕНТИФИКАТОР(биг_ОперацииПортфеля.ИнтеграционныйДокумент) = &ПустойИдентификатор)";
	
	ПустойИдентификатор  = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
	Запрос.УстановитьПараметр("ПустойИдентификатор", ПустойИдентификатор);

	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		// ставим статус "Активный"
		Запись = РегистрыСведений.биг_ОперацииПортфеля.СоздатьМенеджерЗаписи();
		Запись.Портфель = Выборка.Портфель;
		Запись.Сделка	= Выборка.Сделка;
		Запись.Операция	= Выборка.Операция;
		Запись.Аккаунт	= Выборка.Аккаунт;
		Запись.Статус	= Перечисления.big_СтатусыТорговыхОбъектов.Активный;
		Запись.Записать(Истина);
		
		// запускаем фоновым заданием формирование документа. Передаем Портфель, Сделку, Операцию, Аккаунт
		ВыполняемыйМетод 		= "биг_ПортфельноеУправление.СоздатьИнтеграционныйДокумент";
		
		ПараметрыЗапуска		= Новый Структура();
		ПараметрыЗапуска.Вставить("Операция", 	Выборка.Операция);
		ПараметрыЗапуска.Вставить("Аккаунт", 	Выборка.Аккаунт);
		
		ПараметрыВыполнения 	= ДлительныеОперации.ПараметрыВыполненияВФоне(Неопределено);
		ПараметрыВыполнения.НаименованиеФоновогоЗадания = ВыполняемыйМетод;
		ПараметрыВыполнения.ЗапуститьВФоне 				= Истина;
		//ПараметрыВыполнения.Вставить("ИдентификаторФормы", ЭтаФорма.ИдентификаторЗадания); 
		
		СтруктураФоновогоЗадания = ДлительныеОперации.ВыполнитьВФоне(ВыполняемыйМетод, ПараметрыЗапуска, ПараметрыВыполнения);
	КонецЦикла;
		
КонецПроцедуры

Процедура СоздатьИнтеграционныйДокумент(Параметры, АдресРезультата) Экспорт
		
	// в менеджер операции добавить метод на создание интеграционного документа (одноименный метод в каждую операцию)
	
	Если ТипЗнч(Параметры.Операция) = Тип("ДокументСсылка.биг_ОперацияПокупкаПродажа") Тогда
		Документы.биг_ОперацияПокупкаПродажа.СформироватьИнтеграционныйДокумент(Параметры.Операция, Параметры.Аккаунт);
	ИначеЕсли ТипЗнч(Параметры.Операция) = Тип("ДокументСсылка.биг_ОперацияТейкСтоп") Тогда
		Документы.биг_ОперацияТейкСтоп.СформироватьИнтеграционныйДокумент(Параметры.Операция, Параметры.Аккаунт);	
	ИначеЕсли ТипЗнч(Параметры.Операция) = Тип("ДокументСсылка.биг_ОперацияЗакрытьПозицию") Тогда
		Документы.биг_ОперацияЗакрытьПозицию.СформироватьИнтеграционныйДокумент(Параметры.Операция, Параметры.Аккаунт);		
	КонецЕсли;		
	
КонецПроцедуры

Процедура МенеджерОценкиУправляемыхАктивов(Дата = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	биг_УчастникиПортфелейСрезПоследних.Портфель КАК Портфель,
	|	биг_УчастникиПортфелейСрезПоследних.Аккаунт КАК Аккаунт
	|ПОМЕСТИТЬ ВТ_УчастникиПортфелей
	|ИЗ
	|	РегистрСведений.биг_УчастникиПортфелей.СрезПоследних(&ТекущаяДата, ) КАК биг_УчастникиПортфелейСрезПоследних
	|ГДЕ
	|	биг_УчастникиПортфелейСрезПоследних.Участник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	биг_РезультатыУправленияСрезПоследних.Портфель КАК Портфель,
	|	биг_РезультатыУправленияСрезПоследних.Аккаунт КАК Аккаунт,
	|	биг_РезультатыУправленияСрезПоследних.ВалютаОценкиПортфеля КАК ВалютаОценкиПортфеля,
	|	биг_РезультатыУправленияСрезПоследних.Монета КАК Монета
	|ПОМЕСТИТЬ ВТ_ПрошлыеПоказатели
	|ИЗ
	|	ВТ_УчастникиПортфелей КАК ВТ_УчастникиПортфелей
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.биг_РезультатыУправления.СрезПоследних(&ТекущаяДата, ) КАК биг_РезультатыУправленияСрезПоследних
	|		ПО ВТ_УчастникиПортфелей.Портфель = биг_РезультатыУправленияСрезПоследних.Портфель
	|			И ВТ_УчастникиПортфелей.Аккаунт = биг_РезультатыУправленияСрезПоследних.Аккаунт
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПрошлыеПоказатели.Аккаунт КАК Аккаунт,
	|	ВТ_ПрошлыеПоказатели.Монета КАК Монета
	|ПОМЕСТИТЬ ВТ_ТаблицаАктивов
	|ИЗ
	|	ВТ_ПрошлыеПоказатели КАК ВТ_ПрошлыеПоказатели
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.Account,
	|	биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.ccy
	|ИЗ
	|	РегистрСведений.биг_ОКХ_БаллансАккаунтовДетали.СрезПоследних(&ТекущаяДата, ) КАК биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаАктивов.Аккаунт КАК Аккаунт,
	|	ВТ_ТаблицаАктивов.Монета КАК Монета,
	|	ВТ_УчастникиПортфелей.Портфель КАК Портфель,
	|	ВТ_УчастникиПортфелей.Портфель.ВалютаОценкиПортфеля КАК ВалютаОценкиПортфеля
	|ПОМЕСТИТЬ ВТ_База
	|ИЗ
	|	ВТ_ТаблицаАктивов КАК ВТ_ТаблицаАктивов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_УчастникиПортфелей КАК ВТ_УчастникиПортфелей
	|		ПО ВТ_ТаблицаАктивов.Аккаунт = ВТ_УчастникиПортфелей.Аккаунт
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_База.Портфель КАК Портфель,
	|	ВТ_База.Аккаунт КАК Аккаунт,
	|	ВТ_База.ВалютаОценкиПортфеля КАК ВалютаОценкиПортфеля,
	|	ВЫБОР
	|		КОГДА биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.ccy ЕСТЬ NULL
	|			ТОГДА ВТ_База.Монета
	|		ИНАЧЕ биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.ccy
	|	КОНЕЦ КАК Монета,
	|	ЕСТЬNULL(биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.eq, 0) КАК Количество,
	|	ЕСТЬNULL(биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.eqUsd, 0) КАК Сумма,
	|	&ТекущаяДата КАК Период,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.eq, 0) > 0
	|			ТОГДА ЕСТЬNULL(биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.eqUsd, 0) / ЕСТЬNULL(биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.eq, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Цена
	|ИЗ
	|	ВТ_База КАК ВТ_База
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.биг_ОКХ_БаллансАккаунтовДетали.СрезПоследних(&ТекущаяДата, ) КАК биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних
	|		ПО ВТ_База.Аккаунт = биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.Account
	|			И ВТ_База.Монета = биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.ccy";
	
	ДатаПараметра 	= ?(Дата = Неопределено, ТекущаяДатаСеанса(), Дата);
	ДатаВЗапрос 	= НачалоДня(ДатаПараметра) - 1;
	
	Запрос.УстановитьПараметр("ТекущаяДата", ДатаВЗапрос);
	Выборка = Запрос.Выполнить().Выбрать();
	
	МассивСтейблов = биг_ОбщегоНазначенияКлиентСервер.ПолучитьМассивЗначенийПоИмени("Стейблкоин");
	
	Таблицакурсов = Новый ТаблицаЗначений;
	Таблицакурсов.Колонки.Добавить("База");
	Таблицакурсов.Колонки.Добавить("Квота");
	Таблицакурсов.Колонки.Добавить("Курс");
	
	Пока Выборка.Следующий() Цикл
		
		Набор = РегистрыСведений.биг_РезультатыУправления.СоздатьНаборЗаписей();
		Набор.Отбор.Портфель.Установить(Выборка.Портфель);
		Набор.Отбор.Аккаунт.Установить(Выборка.Аккаунт);
		Набор.Отбор.ВалютаОценкиПортфеля.Установить(Выборка.ВалютаОценкиПортфеля);
		Набор.Отбор.Монета.Установить(Выборка.Монета);
		Набор.Отбор.Период.Установить(ДатаВЗапрос);
		
		Запись = Набор.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		
		// по уму надо обход по группировкам и проверять один раз на аккаунт... но нет сил :) просто чтоб работало
		Если МассивСтейблов.Найти(Выборка.ВалютаОценкиПортфеля) = Неопределено Тогда
			
			// значит оценка не в стейблах и нужно пересчитывать сумму по текущим курсам
			// проверим получали ли уже в рамках этой сессии такой курс
			Поиск = Новый Структура("База, Квота", Выборка.Монета, Выборка.ВалютаОценкиПортфеля);
			СтрокиКурса = Таблицакурсов.НайтиСтроки(Поиск);
			Если СтрокиКурса.Количество() > 0 Тогда
				Курс = СтрокиКурса[0].Курс;
			Иначе
				
				Биржа = биг_ОбщегоНазначенияКлиентСервер.ЗначениеРеквизитаОбъекта(Выборка.Аккаунт, "Владелец");
				
				// получим курс
				ОбратныйКурс 	= Ложь;
				Инструмент 		= биг_ПортфельноеУправление.НайтиИнструментБиржиПоДвумМонетам(Биржа, Выборка.Монета, Выборка.ВалютаОценкиПортфеля);
				Если Инструмент = Неопределено Тогда
					Инструмент 		= биг_ПортфельноеУправление.НайтиИнструментБиржиПоДвумМонетам(Биржа, Выборка.ВалютаОценкиПортфеля, Выборка.Монета);
					ОбратныйКурс	= Истина;
				КонецЕсли;
				
				
				Если Инструмент <> Неопределено Тогда
					
					СтруктураОперации = биг_МаркетАпиКлиентСервер.СтруктураОперации_ПолучитьЦену();
					СтруктураОперации.Биржа			= Биржа;
					СтруктураОперации.ИнструментТип	= биг_ОбщегоНазначенияКлиентСервер.ЗначениеРеквизитаОбъекта(Инструмент, "instType");
					СтруктураОперации.ИнструментИД	= биг_ОбщегоНазначенияКлиентСервер.ЗначениеРеквизитаОбъекта(Инструмент, "instId");
					
					Курс	= Число(биг_МаркетАпи.ПолучитьЦенуТикета(СтруктураОперации));					
					Если ОбратныйКурс Тогда						
						Курс	= 1 / Курс;
					КонецЕсли;
					
					ЗаписьКурса 		= Таблицакурсов.Добавить();
					ЗаписьКурса.База 	= Выборка.Монета;
					ЗаписьКурса.Квота 	= Выборка.ВалютаОценкиПортфеля;
					ЗаписьКурса.Курс 	= Курс;
				Иначе
					Курс = 1;                                                                                                                 
					Комментарий = "" + Выборка.Монета + "-" + Выборка.ВалютаОценкиПортфеля + " - не удалось определить курс. Установен Курс = 1";
					ЗаписьЖурналаРегистрации("биг_ПортфельноеУправление.МенеджерОценкиУправляемыхАктивов", УровеньЖурналаРегистрации.Ошибка,,,Комментарий);
				КонецЕсли;
			КонецЕсли;
			
			Запись.Сумма = Запись.Количество * Курс;
		КонецЕсли;	
						
		Набор.Записать(Истина);
	КонецЦикла;
			
КонецПроцедуры

Процедура ВосстановитьПоследовательностьСебестоимостиМонет(Параметры = Неопределено, АдресРезультата = Неопределено) Экспорт

	Последовательности.биг_ПартииМонет.Восстановить();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьСуммуДепозитаПоДоле(Аккаунт, Монета, Доля) Экспорт
	
	Баланс 			= ПолучитьБалланс(Аккаунт, Монета);
	СуммаДепозита 	= Окр(Баланс / 100 * Доля, 8);
	
	Возврат СуммаДепозита;
		
КонецФункции

Функция ПолучитьБалланс(Аккаунт, Монета) Экспорт
	
	// TO DO: всё это нужно получать через прокси-модуль (МаркетАпи), который в зависимости от биржи будет обращаться к нужным документам
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.availBal КАК availBal,
	|	биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.availEq КАК availEq
	|ИЗ
	|	РегистрСведений.биг_ОКХ_БаллансАккаунтовДетали.СрезПоследних(
	|			,
	|			Account = &Аккаунт
	|				И ccy = &Монета) КАК биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних";
	
	Запрос.УстановитьПараметр("Аккаунт", Аккаунт);
	Запрос.УстановитьПараметр("Монета", Монета);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Баланс = 0;
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		Баланс = Выборка.availBal;
	КонецЕсли;                    
	
	Возврат Баланс;
	
КонецФункции

Функция ПолучитьинформациюОПозиции(Сделка, Аккаунт) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	биг_ПозицииПоСделкам.Позиция.Ссылка КАК ПозицияСсылка,
	|	биг_ПозицииПоСделкам.Позиция.pos КАК РазмерПозиции,
	|	биг_ПозицииПоСделкам.Позиция.posSide КАК СторонаПозиции
	|ИЗ
	|	РегистрСведений.биг_ПозицииПоСделкам КАК биг_ПозицииПоСделкам
	|ГДЕ
	|	биг_ПозицииПоСделкам.Сделка = &Сделка
	|	И биг_ПозицииПоСделкам.Аккаунт = &Аккаунт";
	
	Запрос.УстановитьПараметр("Сделка", 	Сделка);
	Запрос.УстановитьПараметр("Аккаунт", 	Аккаунт);
	
	Выборка = Запрос.Выполнить().Выбрать(); 
	Выборка.Следующий();
	
	Позиция = Новый Структура("РазмерПозиции, СторонаПозиции", "", Выборка.СторонаПозиции);
	Позиция.РазмерПозиции = ?(ЗначениеЗаполнено(Выборка.РазмерПозиции), Выборка.РазмерПозиции, 0);
	
	Возврат Позиция;
	
КонецФункции

Функция ОпределитьПортфельАккаунта(Аккаунт) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	биг_УчастникиПортфелейСрезПоследних.Портфель КАК Портфель
	|ИЗ
	|	РегистрСведений.биг_УчастникиПортфелей.СрезПоследних(, Аккаунт = &Аккаунт) КАК биг_УчастникиПортфелейСрезПоследних
	|ГДЕ
	|	биг_УчастникиПортфелейСрезПоследних.Участник";
	Запрос.УстановитьПараметр("Аккаунт", Аккаунт);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Портфель = Неопределено;
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Портфель = Выборка.Портфель;
	КонецЕсли;
	
	Возврат Портфель;
	
КонецФункции

Функция ОпределитьСделкуПоПозиции(Позиция, Аккаунт) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	биг_ПозицииПоСделкам.Сделка КАК Сделка
	|ИЗ
	|	РегистрСведений.биг_ПозицииПоСделкам КАК биг_ПозицииПоСделкам
	|ГДЕ
	|	биг_ПозицииПоСделкам.Аккаунт = &Аккаунт
	|	И биг_ПозицииПоСделкам.Позиция = &Позиция";
	
	Запрос.УстановитьПараметр("Позиция", Позиция);
	Запрос.УстановитьПараметр("Аккаунт", Аккаунт);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Сделка = Справочники.биг_Сделки.ПустаяСсылка();
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Сделка = Выборка.Сделка;
	КонецЕсли;                  
	
	Возврат Сделка;
	
КонецФункции

Функция ОпределитьПортфельИнтеграционногоДокумента(Документ) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	биг_ОперацииПортфеля.Портфель КАК Портфель
	|ИЗ
	|	РегистрСведений.биг_ОперацииПортфеля КАК биг_ОперацииПортфеля
	|ГДЕ
	|	биг_ОперацииПортфеля.ИнтеграционныйДокумент = &ИнтеграционныйДокумент";
	Запрос.УстановитьПараметр("ИнтеграционныйДокумент", Документ);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Портфель = Справочники.биг_Портфели.ПустаяСсылка();
	Иначе
		ВЫборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Портфель = Выборка.Портфель;
	КонецЕсли;
	
	Возврат Портфель;
	        
КонецФункции


Процедура ЗаполнитьСделкуДляПозиции(Позиция, СопоставитьСоСделкой, СопоставленаСоСделкой, ПараметрыПоиска) Экспорт

	// выполняем поиск
	Сделка = ПодобратьСделкуПоПозиции(ПараметрыПоиска);	
	
	Если ЗначениеЗаполнено(Сделка) Тогда
		
		// если нашли ставим в документ флаг ПозицияОбъект.СопоставитьСоСделкой = Ложь, ПозицияОбъект.СопоставленаСоСделкой = Истина
		СопоставитьСоСделкой = Ложь;
		СопоставленаСоСделкой = Истина;
		
		// заполняем запись в регистр
		Набор = РегистрыСведений.биг_ПозицииПоСделкам.СоздатьНаборЗаписей();
		Набор.Отбор.Сделка.Установить(Сделка);
		Набор.Отбор.Аккаунт.Установить(ПараметрыПоиска.Аккаунт);
		
		Запись = Набор.Добавить();
		Запись.Сделка 	= Сделка;
		Запись.Аккаунт	= ПараметрыПоиска.Аккаунт;
		Запись.Позиция	= Позиция;
		
		Набор.Записать(Истина);
	Иначе
		
		// иначе ПозицияОбъект.СопоставитьСоСделкой = Ложь (что бы больше не искать сделку при каждом обновлении позиции)
		СопоставитьСоСделкой = Ложь;
	КонецЕсли;
	  
КонецПроцедуры

Функция ПодобратьСделкуПоПозиции(ПараметрыПоиска)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	биг_Сделки.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.биг_Сделки КАК биг_Сделки
	|ГДЕ
	|	биг_Сделки.ТаймСтамп10 МЕЖДУ &ОтступОтПозиции И &ДатаПозиции
	|	И биг_Сделки.Инструмент = &Инструмент
	|	И биг_Сделки.СторонаСделки = &СторонаСделки
	|	И биг_Сделки.Плечо = &Плечо
	|	И биг_Сделки.РежимМаржи = &РежимМаржи
	|	И НЕ биг_Сделки.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	биг_Сделки.ТаймСтамп10 УБЫВ";
	
	Запрос.УстановитьПараметр("ОтступОтПозиции", 	ПараметрыПоиска.ДатаОткрытия - 120);
	Запрос.УстановитьПараметр("ДатаПозиции", 		ПараметрыПоиска.ДатаОткрытия);
	Запрос.УстановитьПараметр("Инструмент", 		ПараметрыПоиска.Инструмент);
	Запрос.УстановитьПараметр("СторонаСделки", 		ПараметрыПоиска.СторонаПозиции);
	Запрос.УстановитьПараметр("Плечо", 				ПараметрыПоиска.Плечо);
	Запрос.УстановитьПараметр("РежимМаржи", 		ПараметрыПоиска.РежимМаржи);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Сделка = Неопределено;
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Сделка = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Сделка;
	
КонецФункции

Функция НайтиИнструментБиржиПоДвумМонетам(Биржа, База, Квота) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	big_Instruments.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.big_Instruments КАК big_Instruments
	|ГДЕ
	|	big_Instruments.Владелец = &Владелец
	|	И big_Instruments.baseCcy = &baseCcy
	|	И big_Instruments.quoteCcy = &quoteCcy
	|	И big_Instruments.instType = Значение(Перечисление.big_OKX_InstrumentType.SPOT)";
	
	Запрос.УстановитьПараметр("Владелец", Биржа);
	Запрос.УстановитьПараметр("baseCcy", База);
	Запрос.УстановитьПараметр("quoteCcy", Квота);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Ссылка;
	КонецЕсли;	
	
КонецФункции


#КонецОбласти