

////////////////////////////////////////////////////////////////////////////////
// <Заголовок модуля: краткое описание и условия применения модуля.>
//  
////////////////////////////////////////////////////////////////////////////////


#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("АккаунтОбразец", Объект.АккаунтОбразец);
	Параметры.Свойство("ТекущийАккаунт", Объект.ТекущийАккаунт);
	Параметры.Свойство("МонетаУчетаПортфеля", Объект.МонетаУчетаПортфеля);
	Параметры.Свойство("ТипИнструмента", Объект.ТипИнструмента);
	
	СформироватьПланОперацийНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.ПланОпераций.Количество() = 0 Тогда
		Закрыть(Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура АккаунтОбразецПриИзменении(Элемент)
	ПроверкаЗаполненияШапки();
КонецПроцедуры

&НаКлиенте
Процедура ТекущийАккаунтПриИзменении(Элемент)
	ПроверкаЗаполненияШапки();
КонецПроцедуры

&НаКлиенте
Процедура МонетаУчетаПортфеляПриИзменении(Элемент)
	ПроверкаЗаполненияШапки();
КонецПроцедуры

&НаКлиенте
Процедура ТипИнструментаПриИзменении(Элемент)
	ПроверкаЗаполненияШапки();
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаЗаполненияШапки()
	
	Если НЕ ЗначениеЗаполнено(Объект.АккаунтОбразец) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ТекущийАккаунт) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.МонетаУчетаПортфеля) Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ТипИнструмента) Тогда
		Возврат;
	КонецЕсли;
	
	СформироватьПланОперацийНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаСервере
Процедура ВыровнятьСоставНаСервере()
	
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	ОбъектОбработки.ВыровнятьСостав();
	ЗначениеВРеквизитФормы(ОбъектОбработки, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ВыровнятьСостав(Команда)
	ВыровнятьСоставНаСервере();
	
	ВсеОк = Истина;
	Для каждого Строка Из Объект.ПланОпераций Цикл
		Если НЕ Строка.Успешно Тогда
			ВсеОк = Ложь;	
		КонецЕсли;	
	КонецЦикла;
	
	Если ВсеОК Тогда
		Закрыть(ВсеОк);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПланОперацийПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
	Сообщить("Изменять состав операций запрещено");
КонецПроцедуры

&НаКлиенте
Процедура ПланОперацийПередУдалением(Элемент, Отказ)
	Отказ = Истина;
	Сообщить("Изменять состав операций запрещено");
КонецПроцедуры



#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СформироватьПланОперацийНаСервере()

	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	ОбъектОбработки.СформироватьПланОпераций();
	ЗначениеВРеквизитФормы(ОбъектОбработки, "Объект");	
	
КонецПроцедуры




#КонецОбласти