
&НаСервере
Процедура АккаунтПриИзмененииНаСервере()
	
	Биржа = биг_ОбщегоНазначенияКлиентСервер.ЗначениеРеквизитаОбъекта(Объект.Аккаунт, "Владелец");
	Если НЕ ЗначениеЗаполнено(Объект.Дата) Тогда
		Объект.Дата = ТекущаяДатаСеанса();
	КонецЕсли;
	
	// обновим остатки аккаунта, что бы получить свежие
	СтруктураОперации = биг_МаркетАпиКлиентСервер.СтруктураОперации_ОбновитьБаллансСчета();
	
	СтруктураОперации.Аккаунт 	= Объект.Аккаунт;
	СтруктураОперации.Биржа 	= Биржа;	
	биг_МаркетАпи.ОбновитьБаллансСчета(Объект.Аккаунт, СтруктураОперации);
	
	// получим остатки аккаунта
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.ccy КАК Монета,
	|	биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.availBal КАК КоличествоДоступно,
	|	биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.eq КАК Количество,
	|	биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.frozenBal КАК КоличествоЗарезервировано,
	|	биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.eqUsd КАК СуммаВВалютеОценки,
	|	биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.eqUsd / биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.eq КАК КурсКВалютеОценки
	|ИЗ
	|	РегистрСведений.биг_ОКХ_БаллансАккаунтовДетали.СрезПоследних(&ДатаДокумента, Account = &Аккаунт) КАК биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних";
	
	Запрос.УстановитьПараметр("ДатаДокумента", 	Объект.Дата);
	Запрос.УстановитьПараметр("Аккаунт", 		Объект.Аккаунт); 
	
	Объект.ПортфельКлиента.Загрузить(Запрос.Выполнить().Выгрузить());
	
	МассивСтейблов = биг_ОбщегоНазначенияКлиентСервер.ПолучитьМассивЗначенийПоИмени("Стейблкоин");
	Если МассивСтейблов.Найти(Объект.ВалютаОценкиПортфеля) = Неопределено Тогда
		ОценкаВСтейбле = Ложь;
	Иначе
		ОценкаВСтейбле = Истина;
	КонецЕсли;
	
	Если НЕ ОценкаВСтейбле Тогда
		Для каждого Строка Из Объект.ПортфельКлиента Цикл		
			
			// функцию нужно вынести в маркет апи, т.к. на разных биржах тип "спот" может называться по своему		
			Если Объект.ВалютаОценкиПортфеля = Строка.Монета Тогда
				
				Строка.КурсКВалютеОценки 		= 1;
				Строка.СуммаВВалютеОценки		= Строка.Количество * Строка.КурсКВалютеОценки;
				
			Иначе
				
				ОбратныйКурс 	= Ложь;
				Инструмент 		= биг_ПортфельноеУправление.НайтиИнструментБиржиПоДвумМонетам(Биржа, Строка.Монета, Объект.ВалютаОценкиПортфеля);
				Если Инструмент = Неопределено Тогда
					Инструмент 		= биг_ПортфельноеУправление.НайтиИнструментБиржиПоДвумМонетам(Биржа, Объект.ВалютаОценкиПортфеля, Строка.Монета);
					ОбратныйКурс	= Истина;
				КонецЕсли;
				
				Если Инструмент <> Неопределено Тогда
				
					СтруктураОперации = биг_МаркетАпиКлиентСервер.СтруктураОперации_ПолучитьЦену();
					СтруктураОперации.Биржа			= Биржа;
					СтруктураОперации.ИнструментТип	= биг_ОбщегоНазначенияКлиентСервер.ЗначениеРеквизитаОбъекта(Инструмент, "instType");
					СтруктураОперации.ИнструментИД	= биг_ОбщегоНазначенияКлиентСервер.ЗначениеРеквизитаОбъекта(Инструмент, "instId");
					
					Строка.КурсКВалютеОценки 		= Число(биг_МаркетАпи.ПолучитьЦенуТикета(СтруктураОперации));
					Если НЕ ОбратныйКурс Тогда
						Строка.СуммаВВалютеОценки	= Строка.Количество * Строка.КурсКВалютеОценки;
					Иначе
						Строка.СуммаВВалютеОценки	= Строка.Количество / Строка.КурсКВалютеОценки;	
					КонецЕсли;
											 
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АккаунтПриИзменении(Элемент)
	
	Объект.ПортфельКлиента.Очистить();
	
	Если ЗначениеЗаполнено(Объект.Аккаунт) Тогда
		АккаунтПриИзмененииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.Дата = ТекущаяДатаСеанса();
	КонецЕсли;
	
КонецПроцедуры   


&НаКлиенте
Процедура ПортфельКлиентаКурсКВалютеОценкиПриИзменении(Элемент)
	
	ТекДанные = Элементы.ПортфельКлиента.ТекущиеДанные;
	ТекДанные.СуммаВВалютеОценки = ТекДанные.Количество * ТекДанные.КурсКВалютеОценки;
	
КонецПроцедуры

&НаКлиенте
Процедура ПортфельКлиентаСуммаВВалютеОценкиПриИзменении(Элемент)
	
	ТекДанные = Элементы.ПортфельКлиента.ТекущиеДанные;
	ТекДанные.КурсКВалютеОценки = ТекДанные.СуммаВВалютеОценки / ТекДанные.Количество;
	
КонецПроцедуры


&НаКлиенте
Процедура ВалютаОценкиПортфеляПриИзменении(Элемент)
	
	АккаунтПриИзменении(Неопределено);	
	
КонецПроцедуры

