
Функция sum(source, length) Экспорт
	
	// Проверяем, что длина данных достаточна для вычислений
    Если source.Количество() < length Тогда
        Возврат Неопределено;
    КонецЕсли;

    // Инициализируем переменную для накопления суммы
    Сумма = 0;

    // Вычисляем сумму последних Длина значений
    Для i = source.Количество() - length По source.Количество() - 1 Цикл
        Если Не ЗначениеЗаполнено(source[i]) Тогда
            Продолжить; // Игнорируем значения, равные Неопределено
        КонецЕсли;
        Сумма = Сумма + source[i];
    КонецЦикла;

    Возврат Сумма;
	
КонецФункции

Процедура sort(source) Экспорт

	КоличествоЭлементов = source.Количество();

    Для i = 0 По КоличествоЭлементов - 2 Цикл
        Для j = 0 По КоличествоЭлементов - i - 2 Цикл
            Если source[j] > source[j + 1] Тогда
                // Меняем местами элементы
                Временное = source[j];
                source[j] = source[j + 1];
                source[j + 1] = Временное;
            КонецЕсли;
        КонецЦикла;
    КонецЦикла;
	
КонецПроцедуры

// Функция - change
//
// Параметры:
//  source - Массив значений, для которых рассчитываются изменения
// 
// Возвращаемое значение:
//  Массив изменений
//
Функция change(barCollection, source = Неопределено) Экспорт
    Изменения = Новый Массив;

    Для Индекс = 1 По barCollection.Количество() - 1 Цикл
		Элемент1 = ?(source = Неопределено, barCollection[Индекс], barCollection[Индекс][source]); 
		Элемент2 = ?(source = Неопределено, barCollection[Индекс - 1], barCollection[Индекс - 1][source]);
		
		Изменение = Элемент1 - Элемент2;
        Изменения.Добавить(Изменение);
    КонецЦикла;

    Возврат Изменения;
КонецФункции

Функция reverse(source) Экспорт

	// Проверяем, что входной параметр действительно является массивом
    Если ТипЗнч(source) <> Тип("Массив") Тогда
        ВызватьИсключение "Входной параметр должен быть массивом.";
    КонецЕсли;

    // Создаем новый массив для хранения результата
    РезультирующийМассив = Новый Массив;

    // Проходим по исходному массиву с конца к началу
    Индекс = source.Количество() - 1;
    Пока Индекс >= 0 Цикл
        РезультирующийМассив.Добавить(source[Индекс]);
        Индекс = Индекс - 1;
    КонецЦикла;

    // Возвращаем перевернутый массив
    Возврат РезультирующийМассив;
	
КонецФункции
