
 
 #Область РаботаСоСвечами
 
/////////////////////////////////////////////////////////////////////////////////
//// В большинстве объектов время хранится в нескольких видах, хотя формат у всех формально ts (time stamp)
//// При этом в логике конфигурации приоритетно используется ts в виде Число(10)

// Функция ПолучитьДанныеСвечейПоТочке
//
// Параметры:
// ПараметрыЗапроса - Структура - описание см. биг_ОбщегоНазначения.ПолучитьСтруктуруПараметровЗапросаДанныхПоСвечам()
// ЗадачиРасчета - Структура - описание см. биг_УправлениеИндикаторамиКлиентСервер.ОписаниеЗадачиРасчетаИндикатора()
//
// Возвращаемое значение: 
// ТаблицаЗначений - Колонки см. РегистрСведений.биг_ДанныеСвечей + колонки со значениями индикаторов, имена задаются в Задачах расчета
Функция ПолучитьДанныеСвечейПоТочкеСИндикаторами(ПараметрыЗапроса, ЗадачиРасчета = Неопределено, РазрешитьОбращениеКБирже = Ложь) Экспорт
	
    ДанныеСвечей 	= биг_ОбщегоНазначения.ПолучитьДанныеСвечейПоТочке(ПараметрыЗапроса);	
    Если ДанныеСвечей = Неопределено ИЛИ ДанныеСвечей.Количество() = 0 И РазрешитьОбращениеКБирже Тогда
    		
    	// этот метод уже возвращает массив структур
    	ОсновныеДанные = ПолучитьСвечиГрафикаНаБирже(ПараметрыЗапроса);
    Иначе
    	ОсновныеДанные = ОбщегоНазначения.ТаблицаЗначенийВМассив(ДанныеСвечей);	
    КонецЕсли;
    
    Если ЗадачиРасчета <> Неопределено Тогда
    	// рассчитать дполнительные данные
    	МаксПериод = 0;
    	Для каждого Задача Из ЗадачиРасчета Цикл
    		МаксПериод = Макс(МаксПериод, Задача.Длина1, Задача.Длина2);
    	КонецЦикла;
    	
    	ПараметрыДопЗапроса = биг_ОбщегоНазначения.ПолучитьСтруктуруПараметровЗапросаДанныхПоСвечам();
    	ЗаполнитьЗначенияСвойств(ПараметрыДопЗапроса, ПараметрыЗапроса,, "СортировкаПоУбыванию");                                  
    	
    	РазмерБара												= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыЗапроса.Бар, "SecondsAmount");
    	ПараметрыДопЗапроса.ТочкаВремениТС_ЗавершениеПериода 	= ПараметрыЗапроса.ТочкаВремениТС_НачалоПериода - РазмерБара;
    	ПараметрыДопЗапроса.ТочкаВремениТС_НачалоПериода 		= ПараметрыДопЗапроса.ТочкаВремениТС_ЗавершениеПериода - (РазмерБара * МаксПериод);
    	ПараметрыДопЗапроса.КоличествоСвечей					= МаксПериод;
		ПараметрыДопЗапроса.ОграничениеПериода					= ПараметрыДопЗапроса.ТочкаВремениТС_ЗавершениеПериода;
    	
    	ДополнительныеДанные = биг_ОбщегоНазначения.ПолучитьДанныеСвечейПоТочке(ПараметрыДопЗапроса);
    	Если ДополнительныеДанные = Неопределено ИЛИ ДополнительныеДанные.Количество() = 0 И РазрешитьОбращениеКБирже Тогда
    		
    		// этот метод уже возвращает массив структур
    		ДополнительныеДанные = ПолучитьСвечиГрафикаНаБирже(ПараметрыЗапроса);
    	Иначе
    		ДополнительныеДанные = ОбщегоНазначения.ТаблицаЗначенийВМассив(ДополнительныеДанные);	
    	КонецЕсли;
    			
    	// получим данные с расчитанными индикаторами 
    	Данные = биг_УправлениеИндикаторамиКлиентСервер.РассчитатьИндикаторы(ОсновныеДанные, ДополнительныеДанные, ЗадачиРасчета);
    Иначе
    	Данные = ОсновныеДанные;	
    КонецЕсли;
 
    Возврат Данные;
	
КонецФункции

Функция ПолучитьСвечиГрафикаНаБирже(ПараметрыЗапроса)
	
	ТС 						= ПараметрыЗапроса.ТочкаВремениТС_ЗавершениеПериода;
	ГрузитьДоТочкиТС 		= ПараметрыЗапроса.ТочкаВремениТС_НачалоПериода;
		
	ТССтрока 				= биг_ОбщегоНазначенияКлиентСервер.TimeStampЧислоВСтроку(ТС);
	ГрузитьДоТочкиТССтрока	= биг_ОбщегоНазначенияКлиентСервер.TimeStampЧислоВСтроку(ГрузитьДоТочкиТС);
	
	СтруктураОперации = биг_МаркетАпиКлиентСервер.СтруктураОперации_ЗагрузитьИсториюСвечей();
	СтруктураОперации.Биржа            = ПараметрыЗапроса.Биржа;
	СтруктураОперации.ИнструментИД     = ПараметрыЗапроса.ИнструментИД;
	СтруктураОперации.Бар              = ПараметрыЗапроса.Бар;
	СтруктураОперации.ТочкаДо          = ТССтрока;
	СтруктураОперации.ТочкаПосле       = ГрузитьДоТочкиТССтрока;
	СтруктураОперации.КоличествоСвечей = 100;	

	МассивСвечей = биг_МаркетАпи.ПолучитьИсториюСвечей(СтруктураОперации);
	ОбратныйМассив = math.reverse(МассивСвечей);
	Возврат ОбратныйМассив;
	
КонецФункции

// Функция ПолучитьДанныеСвечейПоТочке
//
// Параметры:
// параметрыВыборки - Структура - описание см. биг_ОбщегоНазначения.ПолучитьСтруктуруПараметровЗапросаДанныхПоСвечам() 
//
// Возвращаемое значение: 
// ТаблицаЗначений - Колонки см. РегистрСведений.биг_ДанныеСвечей
Функция ПолучитьДанныеСвечейПоТочке(ПараметрыЗапроса) Экспорт
	
	// Пока что отключаю повторное использование.
	
	//Биржа 								= ПараметрыЗапроса.Биржа;
	//ИнструментИД 						= ПараметрыЗапроса.ИнструментИД;
	//Бар 								= ПараметрыЗапроса.Бар;
	//ТочкаВремениТС_НачалоПериода 		= ПараметрыЗапроса.ТочкаВремениТС_НачалоПериода;
	//ТочкаВремениТС_ЗавершениеПериода 	= ПараметрыЗапроса.ТочкаВремениТС_ЗавершениеПериода;
	//КоличествоСвечей 					= ПараметрыЗапроса.КоличествоСвечей;
	//ИсключаяПереданнуюТочку 			= ПараметрыЗапроса.ИсключаяПереданнуюТочку;
	//ТолькоЗавершенные 					= ПараметрыЗапроса.ТолькоЗавершенные;
	//ОграничениеПериода 					= ПараметрыЗапроса.ОграничениеПериода;
	//СортировкаПоУбыванию 				= ПараметрыЗапроса.СортировкаПоУбыванию;
	//ВыбратьПервые						= ПараметрыЗапроса.ВыбратьПервые;
	//
	//Возврат биг_ОбщегоНазначенияПовтИсп.ПолучитьДанныеСвечейПоТочке(Биржа, ИнструментИД, Бар, ТочкаВремениТС_НачалоПериода, ТочкаВремениТС_ЗавершениеПериода,
	//																КоличествоСвечей, ИсключаяПереданнуюТочку, ТолькоЗавершенные, ОграничениеПериода, СортировкаПоУбыванию, ВыбратьПервые);
	//
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ %Условие_Первые%
	|	биг_ДанныеСвечей.Биржа КАК Биржа,
	|	биг_ДанныеСвечей.ИнструментИД КАК ИнструментИД,
	|	биг_ДанныеСвечей.Бар КАК Бар,
	|	биг_ДанныеСвечей.TimeStamp КАК TimeStamp,
	|	биг_ДанныеСвечей.TimeStamp13 КАК TimeStamp13,
	|	биг_ДанныеСвечей.TimeStamp10 КАК TimeStamp10,
	|	биг_ДанныеСвечей.ДатаОткрытия КАК ДатаОткрытия,
	|	биг_ДанныеСвечей.ЦенаОткрытия КАК ЦенаОткрытия,
	|	биг_ДанныеСвечей.ЦенаМаксимум КАК ЦенаМаксимум,
	|	биг_ДанныеСвечей.ЦенаМинимум КАК ЦенаМинимум,
	|	биг_ДанныеСвечей.ЦенаЗакрытия КАК ЦенаЗакрытия,
	|	биг_ДанныеСвечей.Объем КАК Объем,
	|	биг_ДанныеСвечей.volCcy КАК volCcy,
	|	биг_ДанныеСвечей.volCcyQuote КАК volCcyQuote,
	|	биг_ДанныеСвечей.confirm КАК confirm
	|ИЗ
	|	РегистрСведений.биг_ДанныеСвечей КАК биг_ДанныеСвечей
	|ГДЕ
	|	биг_ДанныеСвечей.Биржа = &Биржа
	|	И биг_ДанныеСвечей.ИнструментИД = &ИнструментИД
	|	И биг_ДанныеСвечей.Бар = &Бар
	|	И биг_ДанныеСвечей.TimeStamp МЕЖДУ &НачалоПериода И &ЗавершениеПериода
	|	%УсловиеТолькоЗавершенная%	
	|	И биг_ДанныеСвечей.TimeStamp <= &ОграничениеПериода
	|УПОРЯДОЧИТЬ ПО
	|	TimeStamp %УсловиеСортировки%";
		
	
	
	биг_ОбщегоНазначения.ПолучитьДанныеСвечейПоТочке_УстановитьПараметрыЗапроса(Запрос, ПараметрыЗапроса);
	
	ДанныеСвечей = Запрос.Выполнить().Выгрузить();
	
	Возврат ДанныеСвечей;
			
КонецФункции

Процедура ПолучитьДанныеСвечейПоТочке_УстановитьПараметрыЗапроса(Запрос, СтруктураПараметров) Экспорт

	Запрос.Текст = СтрЗаменить(Запрос.Текст, "%УсловиеСортировки%", ?(СтруктураПараметров.СортировкаПоУбыванию, " УБЫВ", ""));		
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "%УсловиеТолькоЗавершенная%", ?(СтруктураПараметров.ТолькоЗавершенные, "И биг_ДанныеСвечей.confirm", ""));
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "%Условие_Первые%", ?(СтруктураПараметров.ВыбратьПервые > 0, " ПЕРВЫЕ " + СтруктураПараметров.ВыбратьПервые, ""));	
	
	Если СтруктураПараметров.ТочкаВремениТС_НачалоПериода = Неопределено И СтруктураПараметров.ТочкаВремениТС_ЗавершениеПериода = Неопределено Тогда
		
		// не передано ничего
		НачалоПериода 		= 0;
		ЗавершениеПериода 	= 9999999999; 
		
		Если СтруктураПараметров.ИсключаяПереданнуюТочку Тогда
			Сообщить("Передан флаг 'Исключая переданную точку', но точки не переданы. Флаг будет проигнорирован");
		КонецЕсли;
		
	ИначеЕсли СтруктураПараметров.ТочкаВремениТС_НачалоПериода = Неопределено И СтруктураПараметров.ТочкаВремениТС_ЗавершениеПериода <> Неопределено Тогда 
		
		// передана точка завершения --> вычислить начало периода
		ЗавершениеПериода		= СтруктураПараметров.ТочкаВремениТС_ЗавершениеПериода;
		НачалоПериода			= ЗавершениеПериода - (СтруктураПараметров.Бар.SecondsAmount * СтруктураПараметров.КоличествоСвечей);
		
		Если СтруктураПараметров.ИсключаяПереданнуюТочку Тогда
			ЗавершениеПериода	= ЗавершениеПериода - 1;	
		КонецЕсли;
		
	ИначеЕсли СтруктураПараметров.ТочкаВремениТС_НачалоПериода <> Неопределено И СтруктураПараметров.ТочкаВремениТС_ЗавершениеПериода = Неопределено Тогда
		
		// передана точка начала --> вычислить точку завершения    
		НачалоПериода			= СтруктураПараметров.ТочкаВремениТС_НачалоПериода;	
		ЗавершениеПериода		= НачалоПериода + (СтруктураПараметров.Бар.SecondsAmount * СтруктураПараметров.КоличествоСвечей);
		
		Если СтруктураПараметров.ИсключаяПереданнуюТочку Тогда
			НачалоПериода		= НачалоПериода + 1;	
		КонецЕсли;
		
	Иначе
		
		// передано всё, просто фиксируем значения
		НачалоПериода			= СтруктураПараметров.ТочкаВремениТС_НачалоПериода;
		ЗавершениеПериода		= СтруктураПараметров.ТочкаВремениТС_ЗавершениеПериода; 
		
		Если СтруктураПараметров.ИсключаяПереданнуюТочку Тогда
			НачалоПериода		= НачалоПериода + 1;
			ЗавершениеПериода	= ЗавершениеПериода - 1;	
		КонецЕсли;	
		
	КонецЕсли;
	      	
	
	Запрос.УстановитьПараметр("Биржа", 					СтруктураПараметров.Биржа);
	Запрос.УстановитьПараметр("ИнструментИД", 			СтруктураПараметров.ИнструментИД);
	Запрос.УстановитьПараметр("Бар", 					СтруктураПараметров.Бар);
	
	Запрос.УстановитьПараметр("НачалоПериода", 			НачалоПериода);
	Запрос.УстановитьПараметр("ЗавершениеПериода", 		ЗавершениеПериода);	
	Запрос.УстановитьПараметр("ОграничениеПериода", 	СтруктураПараметров.ОграничениеПериода);
	
КонецПроцедуры


// Функция Возвращает структуру параметров для функции биг_ОбщегоНазначения.ПолучитьДанныеСвечейПоТочке()
//
// Возвращаемое значение
// Структура, содержит ключи: 
// Биржа - СправочникСсылка.big_Markets - Биржа 
// ИнструментИД - СправочникСсылка.big_Instruments - Торговая пара
// Бар - СправочникСсылка.big_BarTypes - Фрейм свечи
// TimeStamp - ts - точка До которой или После которой отобрать свечи (сама точка в отбор не входит!!!)
// КоличествоСвечей - Число - число свечей, которые будут возвращены
// ТолькоЗавершенные - Булево - Признак, что незавершенные свечи не будут включены в выборку
// ОграничениеПериода - ts - точка, ограничивающая отбор "с права". Используется для "эмуляции", когда "текущая дата" должна быть в прошлом
Функция ПолучитьСтруктуруПараметровЗапросаДанныхПоСвечам() Экспорт
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Биржа");
	СтруктураПараметров.Вставить("ИнструментИД");
	СтруктураПараметров.Вставить("Бар");
	СтруктураПараметров.Вставить("ТочкаВремениТС_НачалоПериода", Неопределено);
	СтруктураПараметров.Вставить("ТочкаВремениТС_ЗавершениеПериода", Неопределено);
	
	СтруктураПараметров.Вставить("КоличествоСвечей", 72);
	СтруктураПараметров.Вставить("ИсключаяПереданнуюТочку", Ложь);
	СтруктураПараметров.Вставить("ТолькоЗавершенные", Истина);
	СтруктураПараметров.Вставить("ОграничениеПериода", 9999999999);
	СтруктураПараметров.Вставить("СортировкаПоУбыванию", Ложь);
	СтруктураПараметров.Вставить("ВыбратьПервые", 0);
	Возврат СтруктураПараметров;	
	
КонецФункции

Функция ПредыдущиеЗначенияRSI(ДанныеСвечи, Индикатор, ПараметрыИндикатора, КоличествоЗначений, TimeStamp) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	биг_ЗначенияИндикаторов.Биржа КАК Биржа,
	|	биг_ЗначенияИндикаторов.ИнструментИД КАК ИнструментИД,
	|	биг_ЗначенияИндикаторов.Бар КАК Бар,
	|	биг_ЗначенияИндикаторов.TimeStamp КАК TimeStamp,
	|	биг_ЗначенияИндикаторов.Индикатор КАК Индикатор,
	|	биг_ЗначенияИндикаторов.TimeStamp10 КАК TimeStamp10,
	|	биг_ЗначенияИндикаторов.Значение КАК Значение,
	|	биг_ЗначенияИндикаторов.ДатаВремя КАК ДатаВремя
	|ИЗ
	|	РегистрСведений.биг_ЗначенияИндикаторов КАК биг_ЗначенияИндикаторов
	|ГДЕ
	|	биг_ЗначенияИндикаторов.Биржа = &Биржа
	|	И биг_ЗначенияИндикаторов.ИнструментИД = &ИнструментИД
	|	И биг_ЗначенияИндикаторов.Бар = &Бар
	|	И биг_ЗначенияИндикаторов.TimeStamp МЕЖДУ &НачалоПериода И &ЗавершениеПериода
	|	И биг_ЗначенияИндикаторов.Индикатор = &Индикатор
	|	И биг_ЗначенияИндикаторов.ПараметрыИндикатора = &ПараметрыИндикатора";
	
	Запрос.УстановитьПараметр("Биржа", 				ДанныеСвечи.Биржа);
	Запрос.УстановитьПараметр("ИнструментИД", 		ДанныеСвечи.ИнструментИД);
	Запрос.УстановитьПараметр("Бар", 				ДанныеСвечи.Бар);
	Запрос.УстановитьПараметр("Индикатор", 			Индикатор);
	Запрос.УстановитьПараметр("ПараметрыИндикатора",ПараметрыИндикатора);
	Запрос.УстановитьПараметр("НачалоПериода", 		TimeStamp - (ДанныеСвечи.Бар.SecondsAmount * КоличествоЗначений));
	Запрос.УстановитьПараметр("ЗавершениеПериода", 	TimeStamp);

	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		МассивRSI = Новый Массив;
	Иначе
		МассивRSI = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Значение");	
	КонецЕсли;
	           
	Возврат МассивRSI;
		
КонецФункции

Функция ДополнитьДанныеСвечейДаннымиИндикаторов(ДанныеСвечей, Источник, Индикатор1, Параметр1, Индикатор2 = Неопределено, Параметр2 = Неопределено, ПустоеЗначение) Экспорт
	
	// конструктор-извращение, но как сделать красивее не придумал. Вроде через построитель можно, но я им не пользовался :) Прастите	
	
	Текст = 
	"ВЫБРАТЬ";
	
	ВсегоКолонок = ДанныеСвечей.Колонки.Количество();
	Сч = 0;
	Для каждого Колонка Из ДанныеСвечей.Колонки Цикл
		
		Сч = Сч + 1;
		
		Шаблон 	= "
					|	ДанныеСвечей.%1 КАК %1";
		Строка 	= СтрШаблон(Шаблон, Колонка.Имя);
		Если Сч < ВсегоКолонок Тогда
			Строка = Строка + ",";	
		КонецЕсли;
		
		Текст 	= Текст + Строка;
	КонецЦикла;
	
	
	Текст = Текст + "
	|ПОМЕСТИТЬ ВТ_ДанныеСвечей
	|ИЗ
	|	&ДанныеСвечей КАК ДанныеСвечей
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ";
	
	ВсегоКолонок = ДанныеСвечей.Колонки.Количество();
	Сч = 0;
	Для каждого Колонка Из ДанныеСвечей.Колонки Цикл
		
		Сч = Сч + 1;
		
		Шаблон 	= "
					|	ВТ_ДанныеСвечей.%1 КАК %1,";
		Строка 	= СтрШаблон(Шаблон, Колонка.Имя);		
		Текст 	= Текст + Строка;
	КонецЦикла;
	
	ИмяИндикатора = Строка(Источник) + Индикатор1 + Параметр1 + ?(Индикатор2 = Неопределено, "", "" + Индикатор2 + Параметр2);
	
	Текст = Текст + "
	|	ЕСТЬNULL(биг_ЗначенияИндикаторов.Значение, " + ПустоеЗначение + ") КАК " + ИмяИндикатора + "
	|ИЗ
	|	ВТ_ДанныеСвечей КАК ВТ_ДанныеСвечей
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.биг_ЗначенияИндикаторов КАК биг_ЗначенияИндикаторов
	|		ПО ВТ_ДанныеСвечей.Биржа = биг_ЗначенияИндикаторов.Биржа
	|			И ВТ_ДанныеСвечей.ИнструментИД = биг_ЗначенияИндикаторов.ИнструментИД
	|			И ВТ_ДанныеСвечей.Бар = биг_ЗначенияИндикаторов.Бар
	|			И ВТ_ДанныеСвечей.TimeStamp = биг_ЗначенияИндикаторов.TimeStamp
	|			И (биг_ЗначенияИндикаторов.Источник = &Источник)
	|			И (биг_ЗначенияИндикаторов.Индикатор1 = &Индикатор1)
	|			И (биг_ЗначенияИндикаторов.Параметр1 = &Параметр1)
	|			И (биг_ЗначенияИндикаторов.Индикатор2 = &Индикатор2)
	|			И (биг_ЗначенияИндикаторов.Параметр2 = &Параметр2)";
	              
	Запрос = Новый Запрос;
	Запрос.Текст = Текст;
	
	Запрос.УстановитьПараметр("ДанныеСвечей", 	ДанныеСвечей);
	Запрос.УстановитьПараметр("Источник", 		Источник);
	Запрос.УстановитьПараметр("Индикатор1", 	Индикатор1);
	Запрос.УстановитьПараметр("Параметр1", 		Параметр1);
	Запрос.УстановитьПараметр("Индикатор2", 	?(Индикатор2 = Неопределено, Перечисления.биг_ВидыИндикаторов.ПустаяСсылка(), Индикатор2));
	Запрос.УстановитьПараметр("Параметр2", 		Параметр2);
	
	Таблица = Запрос.Выполнить().Выгрузить();
	
	Возврат Таблица;			
	
КонецФункции

// Описание:
//
//
// Параметры (название, тип, дифференцированное значение)
//
// Возвращаемое значение: 
//
Функция ДетальнаяИнформацияОСвече(Биржа, ИнструментИД, Бар, TimeStamp) Экспорт
	
	// Пока что отключаю повторное использование.
	//Возврат биг_ОбщегоНазначенияПовтИсп.ДетальнаяИнформацияОСвече(Биржа, ИнструментИД, Бар, TimeStamp);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	биг_ДанныеСвечей.Биржа КАК Биржа,
	|	биг_ДанныеСвечей.ИнструментИД КАК ИнструментИД,
	|	биг_ДанныеСвечей.Бар КАК Бар,
	|	биг_ДанныеСвечей.TimeStamp КАК TimeStamp,
	|	биг_ДанныеСвечей.TimeStamp13 КАК TimeStamp13,
	|	биг_ДанныеСвечей.TimeStamp10 КАК TimeStamp10,
	|	биг_ДанныеСвечей.ДатаОткрытия КАК ДатаОткрытия,
	|	биг_ДанныеСвечей.ЦенаОткрытия КАК ЦенаОткрытия,
	|	биг_ДанныеСвечей.ЦенаМаксимум КАК ЦенаМаксимум,
	|	биг_ДанныеСвечей.ЦенаМинимум КАК ЦенаМинимум,
	|	биг_ДанныеСвечей.ЦенаЗакрытия КАК ЦенаЗакрытия,
	|	биг_ДанныеСвечей.Объем КАК Объем,
	|	биг_ДанныеСвечей.volCcy КАК volCcy,
	|	биг_ДанныеСвечей.volCcyQuote КАК volCcyQuote,
	|	биг_ДанныеСвечей.confirm КАК confirm
	|ИЗ
	|	РегистрСведений.биг_ДанныеСвечей КАК биг_ДанныеСвечей
	|ГДЕ
	|	биг_ДанныеСвечей.Биржа = &Биржа
	|	И биг_ДанныеСвечей.ИнструментИД = &ИнструментИД
	|	И биг_ДанныеСвечей.Бар = &Бар
	|	И биг_ДанныеСвечей.TimeStamp = &TimeStamp";
	
	Запрос.УстановитьПараметр("Биржа", 		Биржа);
	Запрос.УстановитьПараметр("ИнструментИД", ИнструментИД);
	Запрос.УстановитьПараметр("Бар", 		Бар);
	Запрос.УстановитьПараметр("TimeStamp", 	TimeStamp);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Свеча = биг_ОбщегоНазначенияКлиентСервер.ОписаниеСвечи();
	ЗаполнитьЗначенияСвойств(Свеча, Выборка);
	
	Возврат Свеча;
	
КонецФункции

// Описание:
//
//
// Параметры (название, тип, дифференцированное значение)
//
// Возвращаемое значение: 
//
Функция ЭтоКраснаяСвеча(Строка) Экспорт
	
	Возврат Строка.ЦенаЗакрытия < Строка.ЦенаОткрытия;
		
КонецФункции

// Описание:
//
//
// Параметры (название, тип, дифференцированное значение)
//
// Возвращаемое значение: 
//
Функция ЭтоЗеленаяСвеча(Строка) Экспорт
	
	Возврат Строка.ЦенаЗакрытия > Строка.ЦенаОткрытия;
		
КонецФункции

// Описание:
//
//
// Параметры (название, тип, дифференцированное значение)
//
// Возвращаемое значение: 
//
Функция ЭтоСвечаДоджи(Свеча, КлючНастроек) Экспорт
		
    // Вычисляем диапазон свечи (разницу между максимумом и минимумом)
    ДиапазонСвечи = Свеча.ЦенаМаксимум - Свеча.ЦенаМинимум;
    Если ДиапазонСвечи = 0 Тогда
        Возврат Ложь; // Свеча без движения (нет диапазона)
    КонецЕсли;

    // Вычисляем размер тела свечи (абсолютную разницу между открытием и закрытием)
    РазмерТела = ?(Свеча.ЦенаЗакрытия - Свеча.ЦенаОткрытия < 0, (Свеча.ЦенаЗакрытия - Свеча.ЦенаОткрытия) *-1, Свеча.ЦенаЗакрытия - Свеча.ЦенаОткрытия);

    // Определяем, является ли тело свечи достаточно маленьким относительно диапазона
    ОтносительныйРазмерТела = РазмерТела / ДиапазонСвечи;
	
	Порог = 0.15;
	
    // Если относительный размер тела меньше порога, это доджи
    Если ОтносительныйРазмерТела <= Порог Тогда
        ЭтоДоджи = Истина;
    Иначе
        ЭтоДоджи = Ложь;
    КонецЕсли;
		
	//ЭтоДоджи 				= Истина;
	//
	//РазмерТела 				= Свеча.ЦенаЗакрытия - Свеча.ЦенаОткрытия;
	//РазмерХвоста 			= Свеча.ЦенаОткрытия - Свеча.ЦенаМинимум;
	//
	//КоэффициентЭлементов 	= РазмерХвоста / РазмерТела;
	//
	//Настройки 			= РегистрыСведений.биг_ЗначенияКонтрольныхУровней;
	//ЦелевойКоэффициент	= Настройки.ЗначениеУровняПоИмени("ДИ_4_ПоискТочкиВходаОдин_ЦелевойКоэффициентХвостаКТелу_Доджи", КлючНастроек);
	//
	//Если КоэффициентЭлементов < ЦелевойКоэффициент Тогда
	//	ЭтоДоджи = Ложь;
	//КонецЕсли;          
	
	Возврат ЭтоДоджи;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
//
// Функция НачалоПериодаПоБару
//
// Описание: Определяет точку ts (time stamp), соответствующую началу фрейма по Бару
//
//
// Параметры (название, тип, дифференцированное значение)
//  ТаймСтамп - Число(10) - Точка времени в формате 'ts'
//	Бар - СправочникСсылка.big_BarTypes - Бар, описывающий текущий фрейм
//
// Возвращаемое значение: 
//	НачалоПериодаТС - Число(10) - Число, соответствующее точке начала фрейма
Функция НачалоПериодаПоБару(ТаймСтамп, Бар) Экспорт
	
	ВеличинаБара = Бар.SecondsAmount; 
	НачалоПериода = Цел(ТаймСтамп / ВеличинаБара) * ВеличинаБара;
	
	Возврат НачалоПериода;
		
КонецФункции

Функция НайтиСтаршийФрейм(Бар) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	big_BarTypes.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.big_BarTypes КАК big_BarTypes
	|ГДЕ
	|	big_BarTypes.SecondsAmount > &РазмерТекущегоФрейма
	|
	|УПОРЯДОЧИТЬ ПО
	|	big_BarTypes.SecondsAmount";
	Запрос.УстановитьПараметр("РазмерТекущегоФрейма", Бар.SecondsAmount);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	Иначе
		Выборка = Результат.Выбрать();	
		Возврат Выборка.Ссылка;	
	КонецЕсли;	
	
КонецФункции

Функция ТекущаяДатаНаСервере() Экспорт
	
	Возврат ТекущаяДатаСеанса();
		
КонецФункции

// Возвращает таблицу значений с датами за период
//
// Параметры:
//  НачДата  - Дата - Начало периода
//  КонДата  - Дата - Конец периода
//  Интервал - Строка - одно из следующих значений:
//             (Секунда, Минута, Час, День, Неделя, Месяц, Квартал, Полугодие, Год)
//
// Возвращаемое значение:
//   Таблица значений с датами за период. Содержит одну колонку "НачИнтервала"
//
Функция ПолучитьТаблицуДатЗаПериод(НачДата, КонДата, Интервал) Экспорт

    тзИнтервалов = Новый ТаблицаЗначений;
    тзИнтервалов.Колонки.Добавить("НачИнтервала", Новый ОписаниеТипов("Дата"));

    Запрос = Новый Запрос;
    Запрос.Текст = "ВЫБРАТЬ
    |   НАЧАЛОПЕРИОДА(&НачДата, День) КАК НачИнтервала
    |УПОРЯДОЧИТЬ ПО
    |   НачИнтервала
    |ИТОГИ ПО
    |   НачИнтервала ПЕРИОДАМИ("+Интервал+", &НачДата, &КонДата)";
    //Параметры запроса
    Запрос.УстановитьПараметр("НачДата", НачДата);
    Запрос.УстановитьПараметр("КонДата", КонДата);

    Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "НачИнтервала", "ВСЕ");
    Пока Выборка.Следующий() Цикл
        НоваяСтрока = тзИнтервалов.Добавить();
        НоваяСтрока.НачИнтервала = Выборка.НачИнтервала;
	КонецЦикла;
	
	тзИнтервалов.Сортировать("НачИнтервала Возр");

    Возврат  тзИнтервалов;

КонецФункции //ПолучитьТаблицуДатЗаПериод()

#КонецОбласти 
 
 
Процедура ЗаполнитьОбъектПоСоответствию(Объект, Соответствие, ПоляИсключения = "") Экспорт
	
	ПоляИсключения 			= СтрЗаменить(ПоляИсключения, " ", "");
	МассивПолей 			= СтрРазделить(ПоляИсключения, ",");
	КоличествоИсключений 	= МассивПолей.Количество();
	
		Для каждого Элемент Из Соответствие Цикл
		
		Если ТипЗнч(Элемент.Значение) <> Тип("Массив") Тогда
			
			Если ПроверитьНаличиеТребуемыхПолейВОбъекте(Объект, Элемент) Тогда
				
				Если ЭтоПростойТипЗначения(Объект[Элемент.Ключ]) Тогда
					
					Если КоличествоИсключений > 0 И МассивПолей.Найти(Элемент.Ключ) = Неопределено Тогда
						Объект[Элемент.Ключ] = Элемент.Значение;
					ИначеЕсли КоличествоИсключений = 0 Тогда
						Объект[Элемент.Ключ] = Элемент.Значение;
					КонецЕсли;
					
				КонецЕсли;				
			КонецЕсли;				
		КонецЕсли;		
	КонецЦикла;
	
КонецПроцедуры 

Функция ПроверитьНаличиеТребуемыхПолейВОбъекте(Объект, Элемент)
	
	Проверка = Ложь;
	
	Попытка
		А = Объект[Элемент.Ключ];
		Проверка = Истина;
	Исключение
		
		ТекстПредупреждения = "Для объекта " + Строка(Объект) + " отсутствует поле " + Элемент.Ключ + ", что бы сохранить значение " + Элемент.Значение;
		//ЗаписьЖурналаРегистрации("Интеграция.ЗаполнитьОбъектПоСоответствию", УровеньЖурналаРегистрации.Ошибка,,, ТекстПредупреждения);
	КонецПопытки;
	
	Возврат Проверка;
	
КонецФункции


Функция НайтиСоздатьВалюту(ИмяРеквизитаДляПоиска, ЗначениеРееквизитаПоиска) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ЗначениеРееквизитаПоиска) Тогда
		Возврат Справочники.big_Currencys.ПустаяСсылка();
	КонецЕсли;                                           
	
	Если НЕ ЗначениеЗаполнено(ИмяРеквизитаДляПоиска) Тогда
		Возврат Справочники.big_Currencys.ПустаяСсылка();
	КонецЕсли;
	
	Валюта = Справочники.big_Currencys.НайтиПоРеквизиту(ИмяРеквизитаДляПоиска, ЗначениеРееквизитаПоиска);
	Если Не ЗначениеЗаполнено(Валюта) Тогда
		Currencys = Справочники.big_Currencys.СоздатьЭлемент();
		Currencys[ИмяРеквизитаДляПоиска] 	= ЗначениеРееквизитаПоиска;
		Currencys.Наименование				= ЗначениеРееквизитаПоиска;
		
		Currencys.Записать();
		
		Валюта = Currencys.Ссылка;
	КонецЕсли;                    
	
	Возврат Валюта;
	
КонецФункции

#Область СлужебныеПроцедурыФункции

Функция ПолучитьЗначениеПоИмениСервер(Имя, СообщитьОбОтсутствии = Истина, ЗначениеПоУмолчанию = Неопределено) Экспорт
	
	Возврат РегистрыСведений.биг_ПредопределенныеЭлементы.ПолучитьЗначениеПоИмени(Имя, СообщитьОбОтсутствии, ЗначениеПоУмолчанию);
	
КонецФункции

Функция ПолучитьМассивЗначенийПоИмени(Имя, СообщитьОбОтсутствии = Истина, ЗначениеПоУмолчанию = Неопределено) Экспорт

	Возврат РегистрыСведений.биг_ПредопределенныеЭлементы.ПолучитьМассивЗначенийПоИмени(Имя, СообщитьОбОтсутствии);
	
КонецФункции

Процедура ПодключитьВнешнююОбработкуПоНаименованиюЗначенияСервер(Наименование) Экспорт
	
	Ссылка = ПолучитьЗначениеПоИмениСервер(Наименование, Истина, Неопределено);
	ДополнительныеОтчетыИОбработки.ПодключитьВнешнююОбработку(Ссылка);	
	
КонецПроцедуры

Процедура ЗаполнитьСтруктуруПоСсылке(СтруктураОперации, ДокументОперации) Экспорт
	
	СтруктураРеквизитов = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(СтруктураОперации);
	ОставитьВСтруктуреТолькоСтроки(СтруктураРеквизитов);
	
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОперации, СтруктураРеквизитов);
	
	Для каждого Элемент Из ЗначенияРеквизитов Цикл
		
		Если ТипЗнч(Элемент.Значение) <> Тип("Массив") Тогда
			
			СтруктураОперации[Элемент.Ключ] = XMLСтрока(Элемент.Значение);				
		КонецЕсли;		
	КонецЦикла;
	
КонецПроцедуры

Процедура Пауза(ДлительностьПаузы) Экспорт

	Сеанс = ПолучитьТекущийСеансИнформационнойБазы();
	Если Сеанс.ПолучитьФоновоеЗадание() = Неопределено Тогда		
		биг_ОбщегоНазначенияКлиентСервер.ПаузаВСекундах(ДлительностьПаузы);
	Иначе		
		ОбщегоНазначенияБТС.Пауза(ДлительностьПаузы);	
	КонецЕсли;
	
КонецПроцедуры

Функция ЗапуститьФоновоеЗадание(ВыполняемыйМетод, ПараметрыЗапуска) Экспорт
		
	ПараметрыВыполнения 	= ДлительныеОперации.ПараметрыВыполненияВФоне(Неопределено);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = ВыполняемыйМетод;
	ПараметрыВыполнения.ЗапуститьВФоне 				= Истина; 
	
	СтруктураФоновогоЗадания = ДлительныеОперации.ВыполнитьВФоне(ВыполняемыйМетод, ПараметрыЗапуска, ПараметрыВыполнения);
	Возврат СтруктураФоновогоЗадания;	
КонецФункции


Функция ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита, ВыбратьРазрешенные = Ложь) Экспорт
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита, ВыбратьРазрешенные);
		
КонецФункции

Функция ЗначенияРеквизитовОбъекта(Ссылка, Реквизиты, ВыбратьРазрешенные = Ложь) Экспорт
	
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, Реквизиты, ВыбратьРазрешенные);
		
КонецФункции


#КонецОбласти //СлужебныеПроцедурыФункции



Функция ЭтоПростойТипЗначения(Значение) Экспорт

	Тип = ТипЗнч(Значение);
	
	ЭтопростойТип = Ложь;
	
	Если Тип = Тип("Строка") Тогда
		ЭтопростойТип = Истина;
	ИначеЕсли Тип = Тип("Число") Тогда
		ЭтопростойТип = Истина;
	КонецЕсли;
	
	Возврат ЭтопростойТип;
	
КонецФункции


Функция ПолучитьЗначениеПеречисления(ИмяПеречисления, ИмяЗначения) Экспорт

	Если НЕ ЗначениеЗаполнено(ИмяПеречисления) Тогда
		Возврат Неопределено;	
	КонецЕсли;
	
	Если ТипЗнч(ИмяПеречисления) <> Тип("Строка") Тогда
		Возврат Неопределено;	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ИмяЗначения) Тогда
		Возврат Неопределено;	
	КонецЕсли;
	
	Если ВРЕГ(ИмяЗначения) = "NULL" Тогда
		Возврат Неопределено;	
	КонецЕсли;
	
	Если ТипЗнч(ИмяЗначения) <> Тип("Строка") Тогда
		Возврат Неопределено;	
	КонецЕсли;
	
	Возврат Перечисления[ИмяПеречисления][ИмяЗначения];
	
КонецФункции

Функция ФоновоеЗаданиеАктивно_ПоКлючу(Ключ) Экспорт
	
	Отбор 	= Новый Структура("Ключ, Состояние", Ключ, СостояниеФоновогоЗадания.Активно);
	Задания = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);
	
	Если Задания.Количество() > 1 Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
		
КонецФункции


Функция СтруктураРеквизитовПоМетаданным(Ссылка) Экспорт
	
	Структура = Новый Структура();
	МетаданныеСсылки = Ссылка.Метаданные();
	
	Для каждого Реквизит Из МетаданныеСсылки.Реквизиты Цикл
		Структура.Вставить(Реквизит.Имя, "");	
	КонецЦикла;                                                        
	
	Возврат Структура;
	
КонецФункции 

Процедура ЗаполнитьСтруктуруПоОбъектуСУчетомТипов(Приемник, Источник, СписокИсключений = "") Экспорт

	МассивИсключений = СтрРазделить(СписокИсключений, ",");
	
	Для каждого Элемент Из Приемник Цикл
		
		Если МассивИсключений.Найти(Элемент.Ключ) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НазваниеРеквизита 	= Элемент.Ключ;
		Реквизит 			= Источник[НазваниеРеквизита];
		ТипРеквизита 		= ТипЗнч(Реквизит);
		
		Если ТипРеквизита = Тип("Строка") Тогда
			
			Приемник[НазваниеРеквизита] = Реквизит; 
			
		ИначеЕсли ТипРеквизита = Тип("Число") Тогда 
			
			Приемник[НазваниеРеквизита] = Формат(Реквизит, "ЧЦ=30; ЧДЦ=8; ЧРД=.; ЧГ=0");
			
		Иначе
			
			Приемник[НазваниеРеквизита] = Строка(Реквизит);	
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

Процедура ОставитьВСтруктуреТолькоСтроки(СтруктураРеквизитов)
	
	МассивУдалить = Новый Массив;
	
	Для каждого Элемент Из СтруктураРеквизитов Цикл
		
		Если ТипЗнч(Элемент.Значение) <> Тип("Строка") Тогда
			МассивУдалить.Добавить(Элемент.Ключ);	
		КонецЕсли;
	КонецЦикла;
	
	Для каждого Ключ Из МассивУдалить Цикл
		СтруктураРеквизитов.Удалить(Ключ);
	КонецЦикла;                           
	
КонецПроцедуры





