// @strict-types

#Область ПрограммныйИнтерфейс

// Возвращает идентификатор хранилища в виде строки.
// @skip-check module-empty-method - особенность реализации.
// @skip-warning - обратная совместимость.
// 
// Возвращаемое значение:
//	Строка - идентификатор хранилища. 
//
Функция ИдентификаторХранилища() Экспорт
КонецФункции

// Возвращает новую структуру описания возвращаемых данных.
// @skip-check module-empty-method - особенность реализации.
// @skip-warning - обратная совместимость.
// 
// Возвращаемое значение:
//	Структура:
//	 * МодульМенеджер - ОбщийМодуль, СправочникиМенеджер, ОтчетыМенеджер - модуль менеджера получения данных.
//	 * Наименование - Строка - наименование возвращаемых данных.
//	 * Описание - Строка - подробное описание возвращаемых данных.
//	 * ТипыРезультата - Массив из Строка - типы возвращаемых данных.
//	 
Функция НовыйОписаниеВозвращаемыхДанных() Экспорт
КонецФункции

// Возвращает перечень доступных данных
// @skip-check module-empty-method - особенность реализации.
// @skip-warning - обратная совместимость.
// 
// Возвращаемое значение:
//	Соответствие из КлючИЗначение - перечень доступных возвращаемых данных:
//	 * Ключ - Строка - идентификатор данных.
//	 * Значение - см. АсинхронноеПолучениеДанных.НовыйОписаниеВозвращаемыхДанных
//	
Функция ДоступныеВозвращаемыеДанные() Экспорт
КонецФункции

// См. ОчередьЗаданийПереопределяемый.ПриОпределенииПсевдонимовОбработчиков.
// @skip-check module-empty-method - особенность реализации.
// @skip-warning - обратная совместимость.
// 
// Параметры:
//  СоответствиеИменПсевдонимам - см. ОчередьЗаданийПереопределяемый.ПриОпределенииПсевдонимовОбработчиков.СоответствиеИменПсевдонимам
// 
Процедура ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам) Экспорт
КонецПроцедуры

#Область ОбработчикиОчередиЗаданий

// Формирует данные для ответа по полученным параметрам.
// @skip-check module-empty-method - особенность реализации.
// @skip-warning - обратная совместимость.
//
// Параметры:
//	ИдентификаторДанных - Строка - идентификатор данных, которые нужно получить.
//	ИдентификаторПараметров - УникальныйИдентификатор - идентификатор файла параметров получения данных.
//
Процедура ПодготовитьДанные(ИдентификаторДанных, ИдентификаторПараметров) Экспорт
КонецПроцедуры

#КонецОбласти

#КонецОбласти
 
