
#Область ОповещенияОСигналах_DI

Процедура ВнутреннееОповещение_Произвольное(ТекстСообщения) Экспорт

	Бот 				= биг_ОбщегоНазначенияКлиентСервер.ПолучитьЗначениеПоИмени("Оповещения_ТГ_Бот_ГБИГ_Уведомления");
	Чат					= биг_ОбщегоНазначенияКлиентСервер.ПолучитьЗначениеПоИмени("ТГ_Группа_ДИСигналсТеч");
	
	Справочники.биг_Боты.ОтправитьСообщение(Бот, Чат, ТекстСообщения);
	
КонецПроцедуры


Процедура ВнутреннееОповещениеПоЗаписиСигнала(Сигнал, Запись) Экспорт

	Если НЕ Сигнал.Бектест Тогда
		
		ВыполнятьОповещение = биг_ОбщегоНазначенияКлиентСервер.ПолучитьЗначениеПоИмени("Оповещения_ТГ_СигналыДИ_КаждыйСигнал",, Ложь);
		Если ВыполнятьОповещение Тогда

			Бот 				= биг_ОбщегоНазначенияКлиентСервер.ПолучитьЗначениеПоИмени("Оповещения_ТГ_Бот_ГБИГ_Уведомления");
			Чат					= биг_ОбщегоНазначенияКлиентСервер.ПолучитьЗначениеПоИмени("ТГ_Группа_ДИСигналсТеч");
			
			ТекстСообщения 		= СформироватьСообщениеПоЗаписиСигнала(Запись);
			
			Справочники.биг_Боты.ОтправитьСообщение(Бот, Чат, ТекстСообщения);			
		КонецЕсли;	
	КонецЕсли;
	        
КонецПроцедуры

Функция СформироватьСообщениеПоЗаписиСигнала(Запись)
	
	Шаблон = "#K_%1_%2 
			|Точка начала падения, UTC = %3. Бар = %4
			|Стратегия: #%5
			|
			|Тек. состояние = %6
			|Сигнал завершен = %7
			|Результат = %8
			|
			|Ключ = %9";
			
	//ТекстСообщения = СтрШаблон(Шаблон, СтратегияДаблИмпакт());		
	ТекстСообщения = СтрШаблон(Шаблон, Запись.ТочкаНачалаПадения, Запись.ИнструментИД, 
								Запись.ТочкаНачалаПаденияДатой, Запись.Бар,
								Запись.КлючНастроек.Владелец,
								Запись.ТекущееСобытие, 
								?(Запись.СигналЗавершен, "Да", "Нет"), 
								?(Запись.ЗавершеноПоложительно, "Завершен успешно, смотри операции в 1С", Запись.ПричинаОтмены), 
								Запись.КлючНастроек);
								
	Возврат ТекстСообщения;

КонецФункции

Процедура ВнутреннееОповещениеИзменениеУровняСтопЛосс(Сигнал, СтруктураОперации) Экспорт

	Если НЕ Сигнал.Бектест Тогда
		
		ВыполнятьОповещение = биг_ОбщегоНазначенияКлиентСервер.ПолучитьЗначениеПоИмени("Оповещения_ТГ_СигналыДИ_КаждыйСигнал",, Ложь);
		Если ВыполнятьОповещение Тогда

			Бот 				= биг_ОбщегоНазначенияКлиентСервер.ПолучитьЗначениеПоИмени("Оповещения_ТГ_Бот_ГБИГ_Уведомления");
			Чат					= биг_ОбщегоНазначенияКлиентСервер.ПолучитьЗначениеПоИмени("ТГ_Группа_ДИСигналсТеч");
			
			ТекстСообщения 		= СформироватьСообщениеОбИзмененииУровняСтопЛосс(Сигнал, СтруктураОперации);
			
			Справочники.биг_Боты.ОтправитьСообщение(Бот, Чат, ТекстСообщения);			
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

Функция СформироватьСообщениеОбИзмененииУровняСтопЛосс(Сигнал, СтруктураОперации)
	
	Шаблон = "#K_%1_%2
			|Стратегия: #%3
			|
			|Создан / изменен стоп-ордер
			|Новый Триггер = %4
			|Новая Цена = %5";
	
	ТекстСообщения = СтрШаблон(Шаблон, Сигнал.ТочкаНачалаПадения, Сигнал.ИнструментИД,
								Сигнал.КлючНастроек.Владелец,
								СтруктураОперации.НовыйТриггерСтопЛос, СтруктураОперации.НовыйЦенаСтопЛос);
								
	Возврат ТекстСообщения;

КонецФункции

Процедура ВнутреннееОповещениеОСрабатыванииСтопЛосса(Выборка, ПрофитУбытокСигнала) Экспорт
	
	// algoId заполнено только у тех ордеров, что были отправлены на биржу. При бектестах ордера создаются, но на биржу не отправляются
	Если ЗначениеЗаполнено(Выборка.algoId) Тогда
		
		ВыполнятьОповещение = биг_ОбщегоНазначенияКлиентСервер.ПолучитьЗначениеПоИмени("Оповещения_ТГ_СигналыДИ_КаждыйСигнал",, Ложь);
		Если ВыполнятьОповещение Тогда

			Бот 				= биг_ОбщегоНазначенияКлиентСервер.ПолучитьЗначениеПоИмени("Оповещения_ТГ_Бот_ГБИГ_Уведомления");
			Чат					= биг_ОбщегоНазначенияКлиентСервер.ПолучитьЗначениеПоИмени("ТГ_Группа_ДИСигналсТеч");
			
			ТекстСообщения 		= СформироватьСообщениеОСрабатыванииАлгоОрдера(Выборка, ПрофитУбытокСигнала);
			
			Справочники.биг_Боты.ОтправитьСообщение(Бот, Чат, ТекстСообщения);			
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

Функция СформироватьСообщениеОСрабатыванииАлгоОрдера(Выборка, ПрофитУбытокСигнала)
	
	Шаблон = "#K_%1_%2			
			|Стратегия: #%3 
			|
			|Сработал стоп-лосс!
			|
			|Фин.результат сигнала = %4";
	
	ТекстСообщения = СтрШаблон(Шаблон, Выборка.ТочкаНачалаПадения, Выборка.ИнструментИД, Выборка.КлючНастроек.Владелец, ПрофитУбытокСигнала);								
	Возврат ТекстСообщения;

КонецФункции



Процедура ПубличноеОповещениеПоЗаписиСигнала(Сигнал, Запись) Экспорт

	Если НЕ Сигнал.Бектест Тогда
		
		ВыполнятьОповещение = биг_ОбщегоНазначенияКлиентСервер.ПолучитьЗначениеПоИмени("Оповещения_ТГ_СигналыДИ_ПубличныеОповещения",, Ложь);
		Если ВыполнятьОповещение Тогда

			Бот 				= биг_ОбщегоНазначенияКлиентСервер.ПолучитьЗначениеПоИмени("Оповещения_ТГ_Бот_ГБИГ_Уведомления");
			Чат					= биг_ОбщегоНазначенияКлиентСервер.ПолучитьЗначениеПоИмени("ТГ_Группа_ГБИГ_ОнЭйр");
			
			ТекстСообщения 		= СформироватьПубличноеСообщениеПоЗаписиСигнала(Запись);
			
			Справочники.биг_Боты.ОтправитьСообщение(Бот, Чат, ТекстСообщения);			
		КонецЕсли;	
	КонецЕсли;
	        
КонецПроцедуры   

Функция СформироватьПубличноеСообщениеПоЗаписиСигнала(Запись)
	
	Шаблон = "Сигнал #K_%1_%2 
			|Стратегия: #%3, Бар = %4
			|
			|%5";
	
	СтопЛосс = НайтиСтопЛос(Запись);
	Если Запись.ТекущееСобытие = Перечисления.биг_ДаблИмпактEvents.АИ_ОжиданиеУвеличенияПозиции Тогда
		Информация = "Команда GBIG приняла #решение_войти в позицию. Вход на 20% от депозита, выделенного на работу со стратегией.";
		Информация = Информация + " Обязательно ставим стоп-лосы: Триггер цена = " + СтопЛосс.slTriggerPx + " (в случае срабатывания будет продано по тек. Market Price)";
	ИначеЕсли Запись.ТекущееСобытие = Перечисления.биг_ДаблИмпактEvents.АИ_МониторингПозиции Тогда
		Информация = "Позиция подрастает успешно - команда GBIG #продолжает_вход в позицию. Вход на оставшиеся 80% от депозита, выделенного на работу со стратегией";
	КонецЕсли;
	ТекстСообщения = СтрШаблон(Шаблон, Запись.ТочкаНачалаПадения, Запись.ИнструментИД, Запись.КлючНастроек.Владелец, Запись.Бар,  Информация);
								
	Возврат ТекстСообщения;

КонецФункции

Процедура ПубличноеОповещениеИзменениеУровняСтопЛосс(Сигнал, СтруктураОперации) Экспорт

	Если НЕ Сигнал.Бектест Тогда
		
		ВыполнятьОповещение = биг_ОбщегоНазначенияКлиентСервер.ПолучитьЗначениеПоИмени("Оповещения_ТГ_СигналыДИ_ПубличныеОповещения",, Ложь);
		Если ВыполнятьОповещение Тогда

			Бот 				= биг_ОбщегоНазначенияКлиентСервер.ПолучитьЗначениеПоИмени("Оповещения_ТГ_Бот_ГБИГ_Уведомления");
			Чат					= биг_ОбщегоНазначенияКлиентСервер.ПолучитьЗначениеПоИмени("ТГ_Группа_ГБИГ_ОнЭйр");
			
			ТекстСообщения 		= СформироватьПубличноеСообщениеОбИзмененииУровняСтопЛосс(Сигнал, СтруктураОперации);
			
			Справочники.биг_Боты.ОтправитьСообщение(Бот, Чат, ТекстСообщения);			
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

Функция СформироватьПубличноеСообщениеОбИзмененииУровняСтопЛосс(Сигнал, СтруктураОперации)
	
	Шаблон = "Сигнал #K_%1_%2 
			|Стратегия: #%3
			|
			|Команда GBIG считает, что по текущему сигналу #пора_двигать стоп-лосс!
			|
			|Новый Триггер = %4
			|Новая Цена = %5 
			|
			|СПРАВКА
			|Цена = '-1' - это продажа по Market Price)
			|Стопов может быть несколько и корректировать нужно каждый";
	
	ТекстСообщения = СтрШаблон(Шаблон, Сигнал.ТочкаНачалаПадения, Сигнал.ИнструментИД,
								Сигнал.КлючНастроек.Владелец,
								СтруктураОперации.НовыйТриггерСтопЛос, СтруктураОперации.НовыйЦенаСтопЛос);
								
	Возврат ТекстСообщения;

КонецФункции 

Процедура ПубличноеОповещениеОСрабатыванииСтопЛосса(Объект, ФинРезВПроцентах) Экспорт

	// algoId заполнено только у тех ордеров, что были отправлены на биржу. При бектестах ордера создаются, но на биржу не отправляются
	Если ЗначениеЗаполнено(Объект.posId) Тогда
		
		ВыполнятьОповещение = биг_ОбщегоНазначенияКлиентСервер.ПолучитьЗначениеПоИмени("Оповещения_ТГ_СигналыДИ_ПубличныеОповещения",, Ложь);
		Если ВыполнятьОповещение Тогда

			Бот 				= биг_ОбщегоНазначенияКлиентСервер.ПолучитьЗначениеПоИмени("Оповещения_ТГ_Бот_ГБИГ_Уведомления");
			Чат					= биг_ОбщегоНазначенияКлиентСервер.ПолучитьЗначениеПоИмени("ТГ_Группа_ГБИГ_ОнЭйр");
			
			ТекстСообщения 		= СформироватьПубличноеСообщениеОСрабатыванииСтопЛосс(Объект, ФинРезВПроцентах);
			
			Справочники.биг_Боты.ОтправитьСообщение(Бот, Чат, ТекстСообщения);			
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

Функция СформироватьПубличноеСообщениеОСрабатыванииСтопЛосс(Выборка, ФинРезВПроцентах)
	
	Шаблон = "Сигнал #K_%1_%2 
			|Стратегия: #%3 
			|
			|Сработал стоп-лосс, #сигнал_завершен!
			|Фин.результат сигнала = %4";
	
	Если ФинРезВПроцентах > 0 Тогда
		Шаблон = Шаблон + "
		   	|
			|P.S. Поделитесь ответом на это сообщение, а сколько процентов на этом сигнале удалось заработать вам ? (за вычетом комиссий)";
	КонецЕсли;			
	
	ТекстСообщения = СтрШаблон(Шаблон, Выборка.ТочкаНачалаПадения, Выборка.ИнструментИД,  Выборка.КлючНастроек.Владелец, ФинРезВПроцентах);
	ТекстСообщения = ТекстСообщения + "%";
	Возврат ТекстСообщения;

КонецФункции

    
#КонецОбласти //ОповещенияОСигналах_DI 

#Область СлужебныеПроцедурыФункции

Функция НайтиСтопЛос(Сигнал) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	биг_ДаблИмпактОперации.Операция КАК Операция
	|ИЗ
	|	РегистрСведений.биг_ДаблИмпактОперации КАК биг_ДаблИмпактОперации
	|ГДЕ
	|	биг_ДаблИмпактОперации.Биржа = &Биржа
	|	И биг_ДаблИмпактОперации.ИнструментИД = &ИнструментИД
	|	И биг_ДаблИмпактОперации.ТочкаНачалаПадения = &ТочкаНачалаПадения
	|	И ВЫРАЗИТЬ(биг_ДаблИмпактОперации.Операция КАК Документ.big_AlgoOrders_OKX).slTriggerPx > 0
	|	И биг_ДаблИмпактОперации.НастройкаСтратегии = &НастройкаСтратегии";
	
	Запрос.УстановитьПараметр("Биржа", 				Сигнал.Биржа);
	Запрос.УстановитьПараметр("ИнструментИД", 		Сигнал.ИнструментИД);
	Запрос.УстановитьПараметр("ТочкаНачалаПадения", Сигнал.ТочкаНачалаПадения);
	Запрос.УстановитьПараметр("НастройкаСтратегии", Сигнал.КлючНастроек);
	                       
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Операция;	
	
КонецФункции

#КонецОбласти //СлужебныеПроцедурыФункции