#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ВыгрузитьНастройкиПользователейИнформационнойБазы(Контейнер, Обработчики, Сериализатор) Экспорт
	
	ТипыХранилищ = ВыгрузкаЗагрузкаДанныхСлужебный.ТипыСтандартныхХранилищНастроек();
	
	Для Каждого ТипХранилища Из ТипыХранилищ Цикл
		
		МенеджерВыгрузки = Создать();
		МенеджерВыгрузки.Инициализировать(Контейнер, ТипХранилища, Обработчики, Сериализатор);
		МенеджерВыгрузки.ВыгрузитьДанные();
		МенеджерВыгрузки.Закрыть();
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
