////////////////////////////////////////////////////////////////////////////////
// <Заголовок модуля: краткое описание и условия применения модуля.>
//  
////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗафиксироватьКлючСлушателя(Слушатель, Адрес, КлючКлиента, КлючСоединения, ТребуетсяАвторизация) Экспорт
	
	Набор = РегистрыСведений.биг_СоединенияВебСокет.СоздатьНаборЗаписей();
	Набор.Отбор.Слушатель.Установить(Слушатель);
	Набор.Отбор.Адрес.Установить(Адрес);
	
	Запись = Набор.Добавить();
	Запись.Слушатель 			= Слушатель;
	Запись.Адрес				= Адрес;
	Запись.КлючКлиента			= КлючКлиента;
	Запись.КлючСоединения		= КлючСоединения;
	Запись.ТребуетсяАвторизация	= ТребуетсяАвторизация;
	
	Набор.Записать(Истина);
	
КонецПроцедуры  

Функция ПолучитьКлючСоединенияСлушателя(Слушатель, Адрес) Экспорт
		
	Запись = РегистрыСведений.биг_СоединенияВебСокет.СоздатьМенеджерЗаписи();
	Запись.Слушатель 	= Слушатель;
	Запись.Адрес 		= Адрес;
	Запись.Прочитать();
	
	Возврат Запись.КлючСоединения;
		
КонецФункции      

Функция КлючКлиентаАдресаПоСлушателю(Слушатель, Адрес) Экспорт

	Запись = РегистрыСведений.биг_СоединенияВебСокет.СоздатьМенеджерЗаписи();
	Запись.Слушатель 	= Слушатель;
	Запись.Адрес 		= Адрес;
	Запись.Прочитать();
	
	Возврат Запись.КлючКлиента;
	
КонецФункции


Функция СлушательПоКлючуСоединения(КлючСоединения) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	биг_СоединенияВебСокет.Слушатель КАК Слушатель
	|ИЗ
	|	РегистрСведений.биг_СоединенияВебСокет КАК биг_СоединенияВебСокет
	|ГДЕ
	|	биг_СоединенияВебСокет.КлючСоединения = &КлючСоединения";
	Запрос.УстановитьПараметр("КлючСоединения", КлючСоединения);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Слушатель = Неопределено;
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		Слушатель = ВЫборка.Слушатель;
	КонецЕсли;                        
	
	Возврат Слушатель;
		
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
