
// ВНИМАНИЕ! ВСЯ ЦЕПОЧКА ВЫЗОВОВ ДОЛЖНА РЕАЛИЗОВЫВАТЬСЯ ЧЕРЕЗ ФУНКЦИИ С ВОЗВРАТОМ РЕЗУЛЬТАТА

#Область УнифицированныеМетоды

Функция СоздатьОрдер(ДокументОперации = Неопределено, ПараметрыОперации = Неопределено, Бектест = Ложь, ТаймСтамп = Неопределено) Экспорт
	
	Аккаунт			= ПолучитьАккаунт(ДокументОперации, ПараметрыОперации);	
	Интеграция 		= ПолучитьИнтеграционныйМодуль_ПоАккаунту(Аккаунт);		
	
	Если ДокументОперации 	= Неопределено Тогда
		ДокументОперации 	= Интеграция.СоздатьДокумент_Ордер(ПараметрыОперации, Бектест, ТаймСтамп);	
	КонецЕсли;
	    
	ПараметрыОперацииБиржи 	= Интеграция.ПараметрыОперацииБиржи_СоздатьОрдер(ДокументОперации);		
	Результат = Интеграция.СоздатьОрдер(ПараметрыОперацииБиржи, Аккаунт, Бектест);
	
	Если Бектест И ПараметрыОперации.БектестВычислитьPnL = Истина Тогда
		Интеграция.Ордер_Бектест_ВычислитьPnL(ДокументОперации);
	КонецЕсли;
	
	Если Результат = Истина Тогда
		МассивОпераций = Интеграция.ПолучитьМассивСвязанныхОпераций(ДокументОперации);
		биг_СтратегииСервер.ЗафиксироватьОперацию(МассивОпераций);	
	КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции

Функция ИзменитьОрдер(ПараметрыОперации = Неопределено, Бектест = Ложь) Экспорт

	Аккаунт			= ПолучитьАккаунт(, ПараметрыОперации);	
	Интеграция 		= ПолучитьИнтеграционныйМодуль_ПоАккаунту(Аккаунт);	
	
	ПараметрыОперацииБиржи = Интеграция.ПараметрыОперацииБиржи_ИзменитьОрдер(ПараметрыОперации);		
	Возврат Интеграция.ИзменитьОрдер(ПараметрыОперацииБиржи, Аккаунт, Бектест);
	
КонецФункции 

Функция ОтменитьОрдер(ДокументОперации = Неопределено, ПараметрыОперации = Неопределено, Бектест = Ложь) Экспорт

	Аккаунт			= ПолучитьАккаунт(ДокументОперации, ПараметрыОперации);	
	Интеграция 		= ПолучитьИнтеграционныйМодуль_ПоАккаунту(Аккаунт);	
	
	ПараметрыОперацииБиржи = Интеграция.ПараметрыОперацииБиржи_ОтменитьОрдер(ДокументОперации, ПараметрыОперации);		
	Возврат Интеграция.ОтменитьОрдер(ПараметрыОперацииБиржи, Аккаунт, Бектест);
	
КонецФункции    

Функция АктуализироватьОрдер(ДокументОперации = Неопределено, ПараметрыОперации = Неопределено) Экспорт

	Аккаунт			= ПолучитьАккаунт(ДокументОперации, ПараметрыОперации);	
	Интеграция 		= ПолучитьИнтеграционныйМодуль_ПоАккаунту(Аккаунт);	
	
	ПараметрыОперацииБиржи = Интеграция.ПараметрыОперацииБиржи_АктуализироватьОрдер(ДокументОперации, ПараметрыОперации);		
	Возврат Интеграция.АктуализироватьОрдер(ПараметрыОперацииБиржи, Аккаунт);
	
КонецФункции  

Функция ПолучитьСписокОрдеров(Аккаунт = Неопределено, ПараметрыОперации = Неопределено) Экспорт

	Интеграция 				= ПолучитьИнтеграционныйМодуль_ПоАккаунту(Аккаунт);	
	ПараметрыОперацииБиржи 	= Интеграция.ПараметрыОперацииБиржи_ПолучитьСписокОрдеров(ПараметрыОперации);
	
	Возврат Интеграция.ПолучитьСписокОрдеров(ПараметрыОперацииБиржи, Аккаунт);
	
КонецФункции

Функция ПолучитьИсториюОрдеров(Аккаунт = Неопределено, ПараметрыОперации = Неопределено) Экспорт

	Интеграция 				= ПолучитьИнтеграционныйМодуль_ПоАккаунту(Аккаунт);	
	ПараметрыОперацииБиржи 	= Интеграция.ПараметрыОперацииБиржи_ПолучитьИсториюОрдеров(ПараметрыОперации);
	
	Возврат Интеграция.ПолучитьИсториюОрдеров(ПараметрыОперацииБиржи, Аккаунт);
	
КонецФункции


Функция СоздатьАлгоОрдер(ДокументОперации = Неопределено, ПараметрыОперации = Неопределено, Бектест = Ложь) Экспорт

	Аккаунт			= ПолучитьАккаунт(ДокументОперации, ПараметрыОперации);	
	Интеграция 		= ПолучитьИнтеграционныйМодуль_ПоАккаунту(Аккаунт);	
	
	Если ДокументОперации 	= Неопределено Тогда
		ДокументОперации	= Интеграция.СоздатьДокумент_АлгоОрдер(ПараметрыОперации);	
	КонецЕсли;
	
	ПараметрыОперацииБиржи 	= Интеграция.ПараметрыОперацииБиржи_СоздатьАлгоОрдер(ДокументОперации, ПараметрыОперации);			
	Результат = Интеграция.СоздатьАлгоОрдер(ПараметрыОперацииБиржи, Аккаунт, Бектест);

	Если Результат = Истина Тогда
		МассивОпераций = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДокументОперации);
		биг_СтратегииСервер.ЗафиксироватьОперацию(МассивОпераций);	
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ИзменитьАлгоОрдер(ДокументОперации = Неопределено, ПараметрыОперации = Неопределено, Бектест = Ложь, ТаймСтамп = Неопределено) Экспорт

	Аккаунт			= ПолучитьАккаунт(ДокументОперации, ПараметрыОперации);	
	Интеграция 		= ПолучитьИнтеграционныйМодуль_ПоАккаунту(Аккаунт);	
	
	ПараметрыОперацииБиржи = Интеграция.ПараметрыОперацииБиржи_ИзменитьАлгоОрдер(ПараметрыОперации);		
	Возврат Интеграция.ИзменитьАлгоОрдер(ПараметрыОперацииБиржи, Аккаунт, Бектест, ТаймСтамп);
	
КонецФункции 

Функция ОтменитьАлгоОрдер(ДокументОперации = Неопределено, ПараметрыОперации = Неопределено, Бектест = Ложь) Экспорт

	Аккаунт			= ПолучитьАккаунт(ДокументОперации, ПараметрыОперации);	
	Интеграция 		= ПолучитьИнтеграционныйМодуль_ПоАккаунту(Аккаунт);	
	
	ПараметрыОперацииБиржи = Интеграция.ПараметрыОперацииБиржи_ОтменитьАлгоОрдер(ДокументОперации, ПараметрыОперации);		
	Возврат Интеграция.ОтменитьАлгоОрдер(ПараметрыОперацииБиржи, Аккаунт, Бектест);
	
КонецФункции    

Функция АктуализироватьАлгоОрдер(ДокументОперации = Неопределено, ПараметрыОперации = Неопределено) Экспорт

	Аккаунт			= ПолучитьАккаунт(ДокументОперации, ПараметрыОперации);	
	Интеграция 		= ПолучитьИнтеграционныйМодуль_ПоАккаунту(Аккаунт);	
	
	ПараметрыОперацииБиржи = Интеграция.ПараметрыОперацииБиржи_АктуализироватьАлгоОрдер(ДокументОперации, ПараметрыОперации);		
	Возврат Интеграция.АктуализироватьАлгоОрдер(ПараметрыОперацииБиржи, Аккаунт);
	
КонецФункции

Функция ПолучитьСписокАлгоОрдеров(Аккаунт = Неопределено, ПараметрыОперации = Неопределено) Экспорт

	Интеграция 				= ПолучитьИнтеграционныйМодуль_ПоАккаунту(Аккаунт);	
	ПараметрыОперацииБиржи 	= Интеграция.ПараметрыОперацииБиржи_ПолучитьСписокАлгоОрдеров(ПараметрыОперации);		
	
	Возврат Интеграция.ПолучитьСписокАлгоОрдеров(ПараметрыОперацииБиржи, Аккаунт);
	
КонецФункции

Функция ПолучитьИсториюАлгоОрдеров(Аккаунт = Неопределено, ПараметрыОперации = Неопределено) Экспорт

	Интеграция 				= ПолучитьИнтеграционныйМодуль_ПоАккаунту(Аккаунт);
	ПараметрыОперацииБиржи 	= Интеграция.ПараметрыОперацииБиржи_ПолучитьИсториюАлгоОрдеров(ПараметрыОперации);		
	
	Возврат Интеграция.ПолучитьИсториюАлгоОрдеров(ПараметрыОперацииБиржи, Аккаунт);
	
КонецФункции


Функция ОбновитьБаллансСчета(Аккаунт = Неопределено, ПараметрыОперации = Неопределено) Экспорт
	
	Интеграция 				= ПолучитьИнтеграционныйМодуль_ПоАккаунту(Аккаунт);
	ПараметрыОперацииБиржи 	= Интеграция.ПараметрыОперацииБиржи_ОбновитьБаллансСчета(ПараметрыОперации);
	
	Возврат Интеграция.ОбновитьБаллансСчета(ПараметрыОперацииБиржи, Аккаунт);
	
КонецФункции

Функция ПолучитьИнформациюОбАккаунте(Аккаунт = Неопределено, ПараметрыОперации = Неопределено) Экспорт
	
	Интеграция 				= ПолучитьИнтеграционныйМодуль_ПоАккаунту(Аккаунт);
	ПараметрыОперацииБиржи 	= Интеграция.ПараметрыОперацииБиржи_ПолучитьИнформациюОбАккаунте(ПараметрыОперации);		
	
	Возврат Интеграция.ПолучитьИнформациюОбАккаунте(ПараметрыОперацииБиржи, Аккаунт);
	
КонецФункции

Функция ЗагрузитьСвечи(ПараметрыОперации) Экспорт
	
	Интеграция 				= ПолучитьИнтеграционныйМодуль_ПоПараметрамОперации(ПараметрыОперации);	
	ПараметрыОперацииБиржи 	= Интеграция.ПараметрыОперацииБиржи_ЗагрузитьСвечи(ПараметрыОперации);		
	
	Возврат Интеграция.ЗагрузитьСвечи(ПараметрыОперацииБиржи);
	
КонецФункции

Функция ПолучитьПоследнююСвечу(ПараметрыОперации) Экспорт

	Интеграция 				= ПолучитьИнтеграционныйМодуль_ПоПараметрамОперации(ПараметрыОперации);	
	ПараметрыОперацииБиржи 	= Интеграция.ПараметрыОперацииБиржи_ЗагрузитьСвечи(ПараметрыОперации);		
	
	Возврат Интеграция.ПолучитьПоследнююСвечу(ПараметрыОперацииБиржи);
	
КонецФункции


Функция ЗагрузитьИсториюСвечей(ПараметрыОперации) Экспорт
	
	Интеграция 				= ПолучитьИнтеграционныйМодуль_ПоПараметрамОперации(ПараметрыОперации);	
	ПараметрыОперацииБиржи 	= Интеграция.ПараметрыОперацииБиржи_ЗагрузитьИсториюСвечей(ПараметрыОперации);		
	
	Возврат Интеграция.ЗагрузитьИсториюСвечей(ПараметрыОперацииБиржи);
	
КонецФункции

Функция ПолучитьИсториюСвечей(ПараметрыОперации) Экспорт
	
	Интеграция 				= ПолучитьИнтеграционныйМодуль_ПоПараметрамОперации(ПараметрыОперации);	
	ПараметрыОперацииБиржи 	= Интеграция.ПараметрыОперацииБиржи_ЗагрузитьИсториюСвечей(ПараметрыОперации);		
	
	Возврат Интеграция.ПолучитьИсториюСвечей(ПараметрыОперацииБиржи);
	
КонецФункции

Функция ЗагрузитьИнструменты(ПараметрыОперации) Экспорт
	
	Интеграция 				= ПолучитьИнтеграционныйМодуль_ПоПараметрамОперации(ПараметрыОперации);	
	ПараметрыОперацииБиржи 	= Интеграция.ПараметрыОперацииБиржи_ЗагрузитьИнструменты(ПараметрыОперации);		
	
	Возврат Интеграция.ЗагрузитьИнструменты(ПараметрыОперацииБиржи);
		
КонецФункции

Функция ЗагрузитьМонеты(ПараметрыОперации) Экспорт
	
	Интеграция 				= ПолучитьИнтеграционныйМодуль_ПоПараметрамОперации(ПараметрыОперации);	
	ПараметрыОперацииБиржи 	= Интеграция.ПараметрыОперацииБиржи_ЗагрузитьМонеты(ПараметрыОперации);		
	
	Возврат Интеграция.ЗагрузитьМонеты(ПараметрыОперацииБиржи);
		
КонецФункции

Функция ПолучитьЦену(ПараметрыОперации = Неопределено) Экспорт

	Интеграция 				= ПолучитьИнтеграционныйМодуль_ПоПараметрамОперации(ПараметрыОперации);	
	ПараметрыОперацииБиржи 	= Интеграция.ПараметрыОперацииБиржи_ПолучитьЦену(ПараметрыОперации);		
	
	Возврат Интеграция.ПолучитьЦену(ПараметрыОперацииБиржи);	
	
КонецФункции

Функция ПолучитьЦенуТикета(ПараметрыОперации = Неопределено) Экспорт

	Интеграция 				= ПолучитьИнтеграционныйМодуль_ПоПараметрамОперации(ПараметрыОперации);	
	ПараметрыОперацииБиржи 	= Интеграция.ПараметрыОперацииБиржи_ПолучитьЦену(ПараметрыОперации);		
	
	Возврат Интеграция.ПолучитьЦенуТикета(ПараметрыОперацииБиржи);	
	
КонецФункции


Функция ПолучитьОткрытыеПозиции(Аккаунт = Неопределено, ПараметрыОперации = Неопределено) Экспорт

	Интеграция 				= ПолучитьИнтеграционныйМодуль_ПоАккаунту(Аккаунт);	
	ПараметрыОперацииБиржи 	= Интеграция.ПараметрыОперацииБиржи_ПолучитьОткрытыеПозиции(ПараметрыОперации);
	
	Возврат Интеграция.ПолучитьОткрытыеПозиции(ПараметрыОперацииБиржи, Аккаунт);
	
КонецФункции

Функция ЗакрытьПозицию(ДокументОперации = Неопределено, Аккаунт = Неопределено, ПараметрыОперации = Неопределено, Бектест = Ложь) Экспорт
	
	Аккаунт			= ПолучитьАккаунт(ДокументОперации, ПараметрыОперации);	
	Интеграция 		= ПолучитьИнтеграционныйМодуль_ПоАккаунту(Аккаунт);	
	
	ПараметрыОперацииБиржи = Интеграция.ПараметрыОперацииБиржи_ЗакрытьПозицию(ДокументОперации, ПараметрыОперации);		
	Возврат Интеграция.ЗакрытьПозицию(ПараметрыОперацииБиржи, Аккаунт, Бектест);
	
КонецФункции

Функция ПолучитьИсториюПозиций(Аккаунт = Неопределено, ПараметрыОперации = Неопределено) Экспорт

	Интеграция 				= ПолучитьИнтеграционныйМодуль_ПоАккаунту(Аккаунт);	
	ПараметрыОперацииБиржи 	= Интеграция.ПараметрыОперацииБиржи_ПолучитьИсториюПозиций(ПараметрыОперации);
	
	Возврат Интеграция.ПолучитьИсториюПозиций(ПараметрыОперацииБиржи, Аккаунт);
	
КонецФункции

Функция ПолучитьДоступныеРежимыТорговли(ТипИнструмента, Биржа) Экспорт

	Модуль = ПолучитьМодульПоБирже(Биржа);
	Возврат Модуль.ПолучитьДоступныеРежимыТорговли(ТипИнструмента);
	
КонецФункции

Функция УстановитьМаржу(Аккаунт = Неопределено, ПараметрыОперации = Неопределено) Экспорт

	Интеграция 				= ПолучитьИнтеграционныйМодуль_ПоАккаунту(Аккаунт);
	ПараметрыОперацииБиржи 	= Интеграция.ПараметрыОперацииБиржи_УстановитьМаржу(ПараметрыОперации);		
	
	Возврат Интеграция.УстановитьМаржу(ПараметрыОперацииБиржи, Аккаунт);
	
КонецФункции

Функция УстановитьРежимАккаунта(Аккаунт = Неопределено, ПараметрыОперации = Неопределено) Экспорт

	Интеграция 				= ПолучитьИнтеграционныйМодуль_ПоАккаунту(Аккаунт);
	ПараметрыОперацииБиржи 	= Интеграция.ПараметрыОперацииБиржи_УстановитьРежимАккаунта(ПараметрыОперации);		
	
	Возврат Интеграция.УстановитьРежимАккаунта(ПараметрыОперацииБиржи, Аккаунт);
	
КонецФункции

Функция УстановитьРежимПозиций(Аккаунт = Неопределено, ПараметрыОперации = Неопределено) Экспорт

	Интеграция 				= ПолучитьИнтеграционныйМодуль_ПоАккаунту(Аккаунт);
	ПараметрыОперацииБиржи 	= Интеграция.ПараметрыОперацииБиржи_УстановитьРежимПозиций(ПараметрыОперации);		
	
	Возврат Интеграция.УстановитьРежимПозиций(ПараметрыОперацииБиржи, Аккаунт);
	
КонецФункции

Функция ПолучитьИсториюДвиженийСчета(Аккаунт = Неопределено, ПараметрыОперации = Неопределено) Экспорт

	Интеграция 				= ПолучитьИнтеграционныйМодуль_ПоАккаунту(Аккаунт);
	ПараметрыОперацииБиржи 	= Интеграция.ПараметрыОперацииБиржи_ПолучитьИсториюДвиженийСчета(ПараметрыОперации);		
	
	Возврат Интеграция.ПолучитьИсториюДвиженийСчета(ПараметрыОперацииБиржи, Аккаунт);
	
КонецФункции

Функция ПолучитьИсториюДвиженийСчетаТриМесяца(Аккаунт = Неопределено, ПараметрыОперации = Неопределено) Экспорт

	Интеграция 				= ПолучитьИнтеграционныйМодуль_ПоАккаунту(Аккаунт);
	ПараметрыОперацииБиржи 	= Интеграция.ПараметрыОперацииБиржи_ПолучитьИсториюДвиженийСчета(ПараметрыОперации);		
	
	Возврат Интеграция.ПолучитьИсториюДвиженийСчетаТриМесяца(ПараметрыОперацииБиржи, Аккаунт);
	
КонецФункции

// Получить список тикеров по инструментам
Функция ЗагрузитьТикеры(ПараметрыОперации) Экспорт
	
    Интеграция 				= ПолучитьИнтеграционныйМодуль_ПоПараметрамОперации(ПараметрыОперации);
    ПараметрыОперацииБиржи 	= Интеграция.ПараметрыОперацииБиржи_ЗагрузитьТикеры(ПараметрыОперации);
    Возврат Интеграция.ЗагрузитьТикеры(ПараметрыОперацииБиржи);
	
КонецФункции

Функция ЗагрузитьТопИнструментов(ПараметрыОперации) Экспорт 
	
    Интеграция 				= ПолучитьИнтеграционныйМодуль_ПоПараметрамОперации(ПараметрыОперации);
    ПараметрыОперацииБиржи 	= Интеграция.ПараметрыОперацииБиржи_ЗагрузитьТопИнструментов(ПараметрыОперации);
    Возврат Интеграция.ЗагрузитьТопИнструментов(ПараметрыОперацииБиржи);
	
КонецФункции

#КонецОбласти //УнифицированныеМетоды


#Область СлужебныеПроцедурыФункции

Функция ПолучитьАккаунт(ДокументОперации = Неопределено, ПараметрыОперации = Неопределено)
	
	Если ДокументОперации = Неопределено И ПараметрыОперации = Неопределено Тогда
		
		// todo: исключительная ситуация. фиксировать ошибку
		ОписаниеОшибки = "биг_МаркетАпи.ПолучитьАккаунт - Все входные параметры Неопределены";
		ВызватьИсключение ОписаниеОшибки;		
	КонецЕсли;
	
	Аккаунт = Неопределено;
	
	Если ДокументОперации <> Неопределено Тогда           		
		Аккаунт 	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОперации, 	"Аккаунт");		
	ИначеЕсли ПараметрыОперации <> Неопределено Тогда		
		ПараметрыОперации.Свойство("Аккаунт", Аккаунт);		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Аккаунт) Тогда
		ВызватьИсключение "биг_МаркетАпи.ПолучитьАккаунт - не удалось определеить аккаунт";	
	КонецЕсли;
	
	Возврат Аккаунт;
	
КонецФункции

Функция ПолучитьИнтеграционныйМодуль_ПоАккаунту(Аккаунт = Неопределено, ПараметрыОперации = Неопределено)

	Если Аккаунт = Неопределено И ПараметрыОперации = Неопределено Тогда
		
		// todo: исключительная ситуация. фикс ошибку
		ОписаниеОшибки = "биг_МаркетАпи.ПолучитьИнтеграционныйМодуль_ПоАккаунту() - не определен модуль интеграции";
		ВызватьИсключение ОписаниеОшибки;		
	КонецЕсли;
	
	Если Аккаунт <> Неопределено Тогда               
		
		Биржа		= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Аккаунт, "Владелец");		
	ИначеЕсли ПараметрыОперации <> Неопределено Тогда
		
		Биржа		= ПараметрыОперации.Биржа;		
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Биржа) Тогда
		ОписаниеОшибки = "биг_МаркетАпи.ПолучитьИнтеграционныйМодуль_ПоАккаунту() - не удалось определить биржу";
		ВызватьИсключение ОписаниеОшибки;	
	КонецЕсли;
	
	Модуль = ПолучитьМодульПоБирже(Биржа);	
	Возврат Модуль;
		
КонецФункции 

Функция ПолучитьИнтеграционныйМодуль_ПоПараметрамОперации(ПараметрыОперации)
	
	Биржа 	= Неопределено;
	Аккаунт = Неопределено;
	
	ПараметрыОперации.Свойство("Аккаунт", Аккаунт);
	ПараметрыОперации.Свойство("Биржа", Биржа);
	
	Если НЕ ЗначениеЗаполнено(Биржа) И НЕ ЗначениеЗаполнено(Аккаунт) Тогда		
		ОписаниеОшибки = "биг_МаркетАпи.ПолучитьИнтеграционныйМодуль_ПоПараметрамОперации() - не заполнены все входные параметры";
		ВызватьИсключение ОписаниеОшибки;	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Биржа) Тогда
		Биржа = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Аккаунт, "Владелец");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Биржа) Тогда
		ОписаниеОшибки = "биг_МаркетАпи.ПолучитьИнтеграционныйМодуль_ПоПараметрамОперации() - не удалось определить Биржу";
		ВызватьИсключение ОписаниеОшибки;
	КонецЕсли;
	
	Модуль = ПолучитьМодульПоБирже(Биржа);	
	Возврат Модуль;
		
КонецФункции

Функция ПолучитьМодульПоБирже(Биржа) Экспорт

	ИмяМодуля	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Биржа, "ОбщийМодульИнтеграции");
	
	Если НЕ ЗначениеЗаполнено(ИмяМодуля) Тогда
		ОписаниеОшибки = "биг_МаркетАпи.ПолучитьМодульПоБирже() - в элементе Биржа не указано Имя модуля интеграции";
		ВызватьИсключение ОписаниеОшибки;	
	КонецЕсли;
	
	Модуль 		= ?(ЗначениеЗаполнено(ИмяМодуля), ОбщегоНазначения.ОбщийМодуль(ИмяМодуля), Неопределено); 
    Если Модуль = Неопределено Тогда
		ОписаниеОшибки = "биг_МаркетАпи.ПолучитьМодульПоБирже() - по имени Интеграционного модуля не удалось получить Общий модуль";
		ВызватьИсключение ОписаниеОшибки;
	КонецЕсли;
	
	Возврат Модуль;
	
КонецФункции



#КонецОбласти //СлужебныеПроцедурыФункции

#Область Данные

Функция ПолучитьКлючевыеДанныеОперации(ДокументОперации) Экспорт
	
	Аккаунт 	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОперации, 	"Аккаунт");
	Интеграция 	= ПолучитьИнтеграционныйМодуль_ПоАккаунту(Аккаунт);
	
	Возврат Интеграция.ПолучитьКлючевыеДанныеОперации(ДокументОперации);
	
КонецФункции



#КонецОбласти //Данные


#Область РегламентныеЗадания_API

Процедура МенеджерОбновленияИнформацииОбАккаунтах() Экспорт
	
	// проверка, что задание уже выполняется (в моменте только один менеджер очереди. Ключ = Модуль.ИмяМетода из задания)
	Если биг_ОбщегоНазначения.ФоновоеЗаданиеАктивно_ПоКлючу("биг_МаркетАпи.МенеджерОбновленияИнформацииОбАккаунтах") Тогда
		Возврат;	
	КонецЕсли;
	
	ВыборкаАккаунтов = ПолучитьВыборкуАккаунтов();	
	Пока ВыборкаАккаунтов.Следующий() Цикл
		
		ВыполняемыйМетод 			= "биг_МаркетАпи.ОбновитьИнформациюОбАккаунте";		
		ПараметрыЗапуска			= Новый Структура("Аккаунт", ВыборкаАккаунтов.Аккаунт);		
		СтруктураФоновогоЗадания 	= биг_ОбщегоНазначения.ЗапуститьФоновоеЗадание(ВыполняемыйМетод, ПараметрыЗапуска);
	КонецЦикла;		
		
КонецПроцедуры

Процедура ОбновитьИнформациюОбАккаунте(Параметры, АдресХранилищаРезультата) Экспорт
	
	СтруктураОперации 			= биг_МаркетАпиКлиентСервер.СтруктураОперации_ПолучитьИнформациюОбАккаунте();	
	СтруктураОперации.Биржа 	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.Аккаунт, "Владелец");
	СтруктураОперации.Аккаунт	= Параметры.Аккаунт;
	
	Результат = ПолучитьИнформациюОбАккаунте(Параметры.Аккаунт, СтруктураОперации);
	
КонецПроцедуры

Процедура МенеджерОбновленияБаллансовАккаунтов() Экспорт
	
	// проверка, что задание уже выполняется (в моменте только один менеджер очереди. Ключ = Модуль.ИмяМетода из задания)
	Если биг_ОбщегоНазначения.ФоновоеЗаданиеАктивно_ПоКлючу("биг_МаркетАпи.МенеджерОбновленияБаллансовАккаунтов") Тогда
		Возврат;	
	КонецЕсли;
	
	ВыборкаАккаунтов = ПолучитьВыборкуАккаунтов();
	Пока ВыборкаАккаунтов.Следующий() Цикл
		
		ВыполняемыйМетод 			= "биг_МаркетАпи.ОбновитьБаллансАккаунта";		
		ПараметрыЗапуска			= Новый Структура("Аккаунт", ВыборкаАккаунтов.Аккаунт);		
		СтруктураФоновогоЗадания 	= биг_ОбщегоНазначения.ЗапуститьФоновоеЗадание(ВыполняемыйМетод, ПараметрыЗапуска);	
	КонецЦикла;
		
КонецПроцедуры

Процедура ОбновитьБаллансАккаунта(Параметры, АдресХранилищаРезультата) Экспорт
	
	СтруктураОперации			= биг_МаркетАпиКлиентСервер.СтруктураОперации_ОбновитьБаллансСчета();
	СтруктураОперации.Биржа 	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.Аккаунт, "Владелец");
	СтруктураОперации.Аккаунт	= Параметры.Аккаунт;
	
	Результат = ОбновитьБаллансСчета(Параметры.Аккаунт, СтруктураОперации);
	
КонецПроцедуры

Процедура МенеджерОбновленияАктивныхОрдеров() Экспорт

	// проверка, что задание уже выполняется (в моменте только один менеджер очереди. Ключ = Модуль.ИмяМетода из задания)
	Если биг_ОбщегоНазначения.ФоновоеЗаданиеАктивно_ПоКлючу("биг_МаркетАпи.МенеджерОбновленияАктивныхОрдеров") Тогда
		Возврат;	
	КонецЕсли;
	
	ВыборкаБирж = ПолучитьВыборкуБиржСИнтеграцией();
	Пока ВыборкаБирж.Следующий() Цикл
		
		Модуль = ПолучитьМодульПоБирже(ВыборкаБирж.Ссылка);
		Модуль.МенеджерОбновленияАктивныхОрдеров();	
	КонецЦикла;	
	
КонецПроцедуры

Функция ПолучитьВыборкуБиржСИнтеграцией()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	big_Markets.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.big_Markets КАК big_Markets
	|ГДЕ
	|	big_Markets.ОбщийМодульИнтеграции <> """"
	|	И НЕ big_Markets.ПометкаУдаления
	|	И big_Markets.НеТорговаяБиржа = ЛОЖЬ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат Выборка;
	     		
КонецФункции

Процедура МенеджерОбновленияОткрытыхПозицийИОрдеров() Экспорт
	
	// проверка, что задание уже выполняется (в моменте только один менеджер очереди. Ключ = Модуль.ИмяМетода из задания)
	Если биг_ОбщегоНазначения.ФоновоеЗаданиеАктивно_ПоКлючу("биг_МаркетАпи.МенеджерОбновленияОткрытыхПозицийИОрдеров") Тогда
		Возврат;	
	КонецЕсли;
	
	ВыборкаБирж = ПолучитьВыборкуБиржСИнтеграцией();
	Пока ВыборкаБирж.Следующий() Цикл
		
		Модуль = ПолучитьМодульПоБирже(ВыборкаБирж.Ссылка);
		Модуль.МенеджерОбновленияОткрытыхПозицийИОрдеров();	
	КонецЦикла;	
	
КонецПроцедуры

Процедура МенеджерОбновленияИсторииОрдеровПозиций(НачалоПериода = Неопределено) Экспорт
	
	// проверка, что задание уже выполняется (в моменте только один менеджер очереди. Ключ = Модуль.ИмяМетода из задания)
	Если биг_ОбщегоНазначения.ФоновоеЗаданиеАктивно_ПоКлючу("биг_МаркетАпи.МенеджерОбновленияИсторииОрдеровПозиций") Тогда
		Возврат;	
	КонецЕсли;

	ЗавершениеПериода = ТекущаяДатаСеанса();
	Если НачалоПериода = Неопределено Тогда         
		// за последние сутки
		НачалоПериода = ЗавершениеПериода - 86400;
	КонецЕсли;
	
	ВыборкаБирж = ПолучитьВыборкуБиржСИнтеграцией();
	Пока ВыборкаБирж.Следующий() Цикл
		
		Модуль = ПолучитьМодульПоБирже(ВыборкаБирж.Ссылка);
		Модуль.МенеджерОбновленияИсторииОрдеровПозиций();	
	КонецЦикла;	
	
КонецПроцедуры

Процедура МенеджерОбновленияИнструментовБирж() Экспорт

	// проверка, что задание уже выполняется (в моменте только один менеджер очереди. Ключ = Модуль.ИмяМетода из задания)
	Если биг_ОбщегоНазначения.ФоновоеЗаданиеАктивно_ПоКлючу("биг_МаркетАпи.МенеджерОбновленияОткрытыхПозицийИОрдеров") Тогда
		Возврат;	
	КонецЕсли;
	
	ВыборкаБирж = ПолучитьВыборкуБиржСИнтеграцией();
	Пока ВыборкаБирж.Следующий() Цикл
		
		Модуль = ПолучитьМодульПоБирже(ВыборкаБирж.Ссылка);
		Модуль.МенеджерОбновленияИнструментовБирж();	
	КонецЦикла;
	
КонецПроцедуры

Процедура МенеджерОбновленияДоступныхМонет() Экспорт

	// проверка, что задание уже выполняется (в моменте только один менеджер очереди. Ключ = Модуль.ИмяМетода из задания)
	Если биг_ОбщегоНазначения.ФоновоеЗаданиеАктивно_ПоКлючу("биг_МаркетАпи.МенеджерОбновленияДоступныхМонет") Тогда
		Возврат;	
	КонецЕсли;
	
	ВыборкаБирж = ПолучитьВыборкуБиржСИнтеграцией();
	Пока ВыборкаБирж.Следующий() Цикл
		
		Модуль = ПолучитьМодульПоБирже(ВыборкаБирж.Ссылка);
		Модуль.МенеджерОбновленияДоступныхМонет();	
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти //РегламентныеЗадания

#Область РегламентныеЗадания_Служебное

Функция ПолучитьВыборкуАккаунтов()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	big_MarketAccounts.Ссылка КАК Аккаунт
	|ИЗ
	|	Справочник.big_MarketAccounts КАК big_MarketAccounts
	|ГДЕ
	|	НЕ big_MarketAccounts.ПометкаУдаления
	|	И big_MarketAccounts.Владелец.НеТорговаяБиржа = ЛОЖЬ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат Выборка;
		
КонецФункции


#КонецОбласти //РегламентныеЗадания_Служебное


