
&НаСервере
Процедура ЗагрузкаСвечейНаСервере()
	
	биг_АлгоИмпакт.ЗагрузитьИнформациюОСвечах();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаСвечей(Команда)
	ЗагрузкаСвечейНаСервере();
КонецПроцедуры

&НаСервере
Процедура ИсполнениеСтратегииНаСервере()
	
	биг_АлгоИмпакт.ИсполнениеСтратегии();
	
КонецПроцедуры

&НаКлиенте
Процедура ИсполнениеСтратегии(Команда)
	ИсполнениеСтратегииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьБаллансыАккаунтовНаСервере()
	
	биг_МаркетАпи.МенеджерОбновленияБаллансовАккаунтов();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьБаллансыАккаунтов(Команда)
	ОбновитьБаллансыАккаунтовНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьИнформациюОбАккаунтеНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	big_MarketAccounts.Ссылка КАК Аккаунт
	|ИЗ
	|	Справочник.big_MarketAccounts КАК big_MarketAccounts
	|ГДЕ
	|	НЕ big_MarketAccounts.ПометкаУдаления";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ПараметрыЗапуска			= Новый Структура("Аккаунт", Выборка.Аккаунт);		
		биг_МаркетАпи.ОбновитьИнформациюОбАккаунте(ПараметрыЗапуска, неопределено);		
	КонецЦикла;

	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИнформациюОбАккаунте(Команда)
	ОбновитьИнформациюОбАккаунтеНаСервере();
КонецПроцедуры

&НаСервере
Процедура МенеджерОперацийНаСервере()
	
	биг_ПортфельноеУправление.МенеджерОбработкиОпераций();
		
КонецПроцедуры

&НаКлиенте
Процедура МенеджерОпераций(Команда)
	МенеджерОперацийНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПозицииИОрдераНаСервере()
	биг_ОКХ_Сервер.МенеджерОбновленияОткрытыхПозицийИОрдеров();
КонецПроцедуры

&НаКлиенте
Процедура ПозицииИОрдера(Команда)
	ПозицииИОрдераНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбработатьОперациюТейкСтопНаСервере()

	Документы.биг_ОперацияТейкСтоп.СформироватьИнтеграционныйДокумент(АлгоОрдер, Аккаунт);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьОперациюТейкСтоп(Команда)
	ОбработатьОперациюТейкСтопНаСервере();
КонецПроцедуры
