

#Область ПрограммныйИнтерфейс

// ВНИМАНИЕ! ВСЯ ЦЕПОЧКА ВЫЗОВОВ ДОЛЖНА РЕАЛИЗОВЫВАТЬСЯ ЧЕРЕЗ ФУНКЦИИ С ВОЗВРАТОМ РЕЗУЛЬТАТА

Функция ПараметрыОперацииБиржи_СоздатьОрдер(ДокументОперации) Экспорт
	
	СтруктураОперации = СтруктураЗапроса_СоздатьОрдер();
	биг_ОбщегоНазначения.ЗаполнитьСтруктуруПоСсылке(СтруктураОперации, ДокументОперации);
	
	Для каждого Строка Из ДокументОперации.attachAlgoOrds Цикл
		СтруктураАлго = СтруктураЗапроса_СоздатьСвязанныйАлгоОрдер();
		биг_ОбщегоНазначения.ЗаполнитьСтруктуруПоСсылке(СтруктураАлго, Строка.АлгоОрдер);
		СтруктураОперации.attachAlgoOrds.Добавить(СтруктураАлго);
	КонецЦикла;
	
	биг_МаркетАпиКлиентСервер.ПреобразоватьВСтрокуПараметрыОперации(СтруктураОперации);
	
	Возврат СтруктураОперации;
		
КонецФункции

Функция ПараметрыОперацииБиржи_ИзменитьОрдер(ПараметрыОперации) Экспорт
	
	СтруктураОперации = КонвертироватьПараметрыОперации_ИзменитьОрдер(ПараметрыОперации); 	
	биг_МаркетАпиКлиентСервер.ПреобразоватьВСтрокуПараметрыОперации(СтруктураОперации);
	
	Возврат СтруктураОперации;
		
КонецФункции

Функция ПараметрыОперацииБиржи_ОтменитьОрдер(ДокументОперации, ПараметрыОперации) Экспорт
	
	Если ЗначениеЗаполнено(ДокументОперации) Тогда 
		
		СтруктураОперации = СтруктураЗапроса_ОтменитьОрдер();
		биг_ОбщегоНазначения.ЗаполнитьСтруктуруПоСсылке(СтруктураОперации, ДокументОперации);
	Иначе                   
		
		СтруктураОперации = КонвертироватьПараметрыОперации_ОтменитьОрдер(ПараметрыОперации); 
	КонецЕсли;
	
	биг_МаркетАпиКлиентСервер.ПреобразоватьВСтрокуПараметрыОперации(СтруктураОперации);
	
	Возврат СтруктураОперации;
		
КонецФункции

Функция ПараметрыОперацииБиржи_АктуализироватьОрдер(ДокументОперации, ПараметрыОперации) Экспорт
	
	Если ЗначениеЗаполнено(ДокументОперации) Тогда 
		
		СтруктураОперации = СтруктураЗапроса_АктуализироватьОрдер();
		биг_ОбщегоНазначения.ЗаполнитьСтруктуруПоСсылке(СтруктураОперации, ДокументОперации);
	Иначе                   
		
		СтруктураОперации = КонвертироватьПараметрыОперации_АктуализироватьОрдер(ПараметрыОперации); 
	КонецЕсли;

	биг_МаркетАпиКлиентСервер.ПреобразоватьВСтрокуПараметрыОперации(СтруктураОперации);
	
	Возврат СтруктураОперации;
		
КонецФункции

Функция ПараметрыОперацииБиржи_ПолучитьСписокОрдеров(ПараметрыОперации) Экспорт
	
	СтруктураОперации = КонвертироватьПараметрыОперации_ПолучитьСписокОрдеров(ПараметрыОперации);	
	биг_МаркетАпиКлиентСервер.ПреобразоватьВСтрокуПараметрыОперации(СтруктураОперации);
	
	Возврат СтруктураОперации;
		
КонецФункции

Функция ПараметрыОперацииБиржи_ПолучитьИсториюОрдеров(ПараметрыОперации) Экспорт
	
	СтруктураОперации = КонвертироватьПараметрыОперации_ПолучитьИсториюОрдеров(ПараметрыОперации); 	
	биг_МаркетАпиКлиентСервер.ПреобразоватьВСтрокуПараметрыОперации(СтруктураОперации);
	
	Возврат СтруктураОперации;
		
КонецФункции
    

Функция ПараметрыОперацииБиржи_СоздатьАлгоОрдер(ДокументОперации, ПараметрыОперации) Экспорт
	
	Если ЗначениеЗаполнено(ДокументОперации) Тогда 
		
		СтруктураОперации = СтруктураЗапроса_СоздатьАлгоОрдер();
		биг_ОбщегоНазначения.ЗаполнитьСтруктуруПоСсылке(СтруктураОперации, ДокументОперации);
	Иначе                   
		
		СтруктураОперации = КонвертироватьПараметрыОперации_СоздатьАлгоОрдер(ПараметрыОперации); 
	КонецЕсли;
	
	биг_МаркетАпиКлиентСервер.ПреобразоватьВСтрокуПараметрыОперации(СтруктураОперации);
	
	Возврат СтруктураОперации;
		
КонецФункции

Функция ПараметрыОперацииБиржи_ИзменитьАлгоОрдер(ПараметрыОперации) Экспорт
	
	СтруктураОперации = КонвертироватьПараметрыОперации_ИзменитьАлгоОрдер(ПараметрыОперации); 	
	биг_МаркетАпиКлиентСервер.ПреобразоватьВСтрокуПараметрыОперации(СтруктураОперации);
	
	Возврат СтруктураОперации;
		
КонецФункции

Функция ПараметрыОперацииБиржи_ОтменитьАлгоОрдер(ДокументОперации, ПараметрыОперации) Экспорт
	
	Если ЗначениеЗаполнено(ДокументОперации) Тогда 
		
		СтруктураБезМассива = СтруктураЗапроса_ОтменитьАлгоОрдер();
		
		биг_ОбщегоНазначения.ЗаполнитьСтруктуруПоСсылке(СтруктураБезМассива, ДокументОперации);
		СтруктураОперации = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СтруктураБезМассива);
	Иначе                   
		
		СтруктураОперации = КонвертироватьПараметрыОперации_ОтменитьАлгоОрдер(ПараметрыОперации); 
	КонецЕсли;

	биг_МаркетАпиКлиентСервер.ПреобразоватьВСтрокуПараметрыОперации(СтруктураОперации);
	
	Возврат СтруктураОперации;
		
КонецФункции 

Функция ПараметрыОперацииБиржи_АктуализироватьАлгоОрдер(ДокументОперации, ПараметрыОперации) Экспорт
	
	Если ЗначениеЗаполнено(ДокументОперации) Тогда 
		
		СтруктураОперации = СтруктураЗапроса_АктуализироватьАлгоОрдер();
		биг_ОбщегоНазначения.ЗаполнитьСтруктуруПоСсылке(СтруктураОперации, ДокументОперации);
	Иначе                   
		
		СтруктураОперации = КонвертироватьПараметрыОперации_АктуализироватьАлгоОрдер(ПараметрыОперации); 
	КонецЕсли;
	
	биг_МаркетАпиКлиентСервер.ПреобразоватьВСтрокуПараметрыОперации(СтруктураОперации);
	
	Возврат СтруктураОперации;
		
КонецФункции 

Функция ПараметрыОперацииБиржи_ПолучитьСписокАлгоОрдеров(ПараметрыОперации) Экспорт
	
	СтруктураОперации = КонвертироватьПараметрыОперации_ПолучитьСписокАлгоОрдеров(ПараметрыОперации); 	
	биг_МаркетАпиКлиентСервер.ПреобразоватьВСтрокуПараметрыОперации(СтруктураОперации);
	
	Возврат СтруктураОперации;
		
КонецФункции

Функция ПараметрыОперацииБиржи_ПолучитьИсториюАлгоОрдеров(ПараметрыОперации) Экспорт
	
	СтруктураОперации = КонвертироватьПараметрыОперации_ПолучитьИсториюАлгоОрдеров(ПараметрыОперации); 	
	биг_МаркетАпиКлиентСервер.ПреобразоватьВСтрокуПараметрыОперации(СтруктураОперации);
	
	Возврат СтруктураОперации;
		
КонецФункции


Функция ПараметрыОперацииБиржи_ОбновитьБаллансСчета(ПараметрыОперации) Экспорт
	
	СтруктураОперации = КонвертироватьПараметрыОперации_ОбновитьБаллансСчета(ПараметрыОперации); 	
	биг_МаркетАпиКлиентСервер.ПреобразоватьВСтрокуПараметрыОперации(СтруктураОперации);
	
	Возврат СтруктураОперации;
		
КонецФункции

Функция ПараметрыОперацииБиржи_ПолучитьИнформациюОбАккаунте(ПараметрыОперации) Экспорт
	
	СтруктураОперации = КонвертироватьПараметрыОперации_ПолучитьИнформациюОбАккаунте(ПараметрыОперации); 	
	биг_МаркетАпиКлиентСервер.ПреобразоватьВСтрокуПараметрыОперации(СтруктураОперации);
	
	Возврат СтруктураОперации;
		
КонецФункции

Функция ПараметрыОперацииБиржи_ЗагрузитьСвечи(ПараметрыОперации) Экспорт
	
	СтруктураОперации = КонвертироватьПараметрыОперации_ЗагрузитьСвечи(ПараметрыОперации); 
	биг_МаркетАпиКлиентСервер.ПреобразоватьВСтрокуПараметрыОперации(СтруктураОперации);
	
	Возврат СтруктураОперации;
		
КонецФункции

Функция ПараметрыОперацииБиржи_ЗагрузитьИсториюСвечей(ПараметрыОперации) Экспорт
	
	СтруктураОперации = КонвертироватьПараметрыОперации_ЗагрузитьИсториюСвечей(ПараметрыОперации); 
	биг_МаркетАпиКлиентСервер.ПреобразоватьВСтрокуПараметрыОперации(СтруктураОперации);
	
	Возврат СтруктураОперации;
		
КонецФункции

Функция ПараметрыОперацииБиржи_ЗагрузитьИнструменты(ПараметрыОперации) Экспорт
	
	СтруктураОперации = КонвертироватьПараметрыОперации_ЗагрузитьИнструменты(ПараметрыОперации); 
	биг_МаркетАпиКлиентСервер.ПреобразоватьВСтрокуПараметрыОперации(СтруктураОперации);
	
	Возврат СтруктураОперации;
		
КонецФункции

Функция ПараметрыОперацииБиржи_ЗагрузитьМонеты(ПараметрыОперации) Экспорт
	
	СтруктураОперации = КонвертироватьПараметрыОперации_ЗагрузитьМонеты(ПараметрыОперации); 
	биг_МаркетАпиКлиентСервер.ПреобразоватьВСтрокуПараметрыОперации(СтруктураОперации);
	
	Возврат СтруктураОперации;
		
КонецФункции



Функция ПараметрыОперацииБиржи_ПолучитьЦену(ПараметрыОперации) Экспорт
	
	СтруктураОперации = КонвертироватьПараметрыОперации_ПолучитьЦену(ПараметрыОперации); 
	биг_МаркетАпиКлиентСервер.ПреобразоватьВСтрокуПараметрыОперации(СтруктураОперации);
	
	Возврат СтруктураОперации;
		
КонецФункции


Функция ПараметрыОперацииБиржи_ПолучитьОткрытыеПозиции(ПараметрыОперации) Экспорт
	
	СтруктураОперации = КонвертироватьПараметрыОперации_ПолучитьОткрытыеПозиции(ПараметрыОперации); 	
	биг_МаркетАпиКлиентСервер.ПреобразоватьВСтрокуПараметрыОперации(СтруктураОперации);
	
	Возврат СтруктураОперации;
		
КонецФункции

Функция ПараметрыОперацииБиржи_ЗакрытьПозицию(ДокументОперации, ПараметрыОперации) Экспорт
	
	Если ЗначениеЗаполнено(ДокументОперации) Тогда 
		
		СтруктураОперации = СтруктураЗапроса_ЗакрытьПозицию();		
		биг_ОбщегоНазначения.ЗаполнитьСтруктуруПоСсылке(СтруктураОперации, ДокументОперации);
	Иначе                   
		
		СтруктураОперации = КонвертироватьПараметрыОперации_ЗакрытьПозицию(ПараметрыОперации); 
	КонецЕсли;

	биг_МаркетАпиКлиентСервер.ПреобразоватьВСтрокуПараметрыОперации(СтруктураОперации);
	
	Возврат СтруктураОперации;
		
КонецФункции

Функция ПараметрыОперацииБиржи_ПолучитьИсториюПозиций(ПараметрыОперации) Экспорт
	
	СтруктураОперации = КонвертироватьПараметрыОперации_ПолучитьИсториюПозиций(ПараметрыОперации); 	
	биг_МаркетАпиКлиентСервер.ПреобразоватьВСтрокуПараметрыОперации(СтруктураОперации);
	
	Возврат СтруктураОперации;
		
КонецФункции


Функция ПараметрыОперацииБиржи_УстановитьМаржу(ПараметрыОперации) Экспорт
	
	СтруктураОперации = КонвертироватьПараметрыОперации_УстановитьМаржу(ПараметрыОперации); 	
	биг_МаркетАпиКлиентСервер.ПреобразоватьВСтрокуПараметрыОперации(СтруктураОперации);
	
	Возврат СтруктураОперации;
		
КонецФункции

Функция ПараметрыОперацииБиржи_УстановитьРежимАккаунта(ПараметрыОперации) Экспорт
	
	СтруктураОперации = КонвертироватьПараметрыОперации_УстановитьРежимАккаунта(ПараметрыОперации); 	
	биг_МаркетАпиКлиентСервер.ПреобразоватьВСтрокуПараметрыОперации(СтруктураОперации);
	
	Возврат СтруктураОперации;
		
КонецФункции

Функция ПараметрыОперацииБиржи_УстановитьРежимПозиций(ПараметрыОперации) Экспорт
	
	СтруктураОперации = КонвертироватьПараметрыОперации_УстановитьРежимПозиций(ПараметрыОперации); 	
	биг_МаркетАпиКлиентСервер.ПреобразоватьВСтрокуПараметрыОперации(СтруктураОперации);
	
	Возврат СтруктураОперации;
		
КонецФункции

Функция ПараметрыОперацииБиржи_ПолучитьИсториюДвиженийСчета(ПараметрыОперации) Экспорт
	
	СтруктураОперации = КонвертироватьПараметрыОперации_ПолучитьИсториюДвиженийСчета(ПараметрыОперации); 	
	биг_МаркетАпиКлиентСервер.ПреобразоватьВСтрокуПараметрыОперации(СтруктураОперации);
	
	Возврат СтруктураОперации;
		
КонецФункции

// Конвертирует универсальные параметры в специфичные для OKX под метод "ЗагрузитьТикеры"
Функция ПараметрыОперацииБиржи_ЗагрузитьТикеры(ПараметрыОперации) Экспорт 
	
    СтруктураОперации = КонвертироватьПараметрыОперации_ЗагрузитьТикеры(ПараметрыОперации);
    биг_МаркетАпиКлиентСервер.ПреобразоватьВСтрокуПараметрыОперации(СтруктураОперации);
	
    Возврат СтруктураОперации;
	
КонецФункции

#КонецОбласти //ПрограммныйИнтерфейс


#Область СтруктураПараметровМетодовБиржи

// ВНИМАНИЕ! ЗНАЧЕНИЯ ВСЕХ СТРУКТУР ДОЛЖНЫ БЫТЬ ИНИЦИАЛИЗИРОВАНЫ ПУСТОЙ СТРОКОЙ
// ВНИМАНИЕ! ВЫЗЫВАТЬ ЭКСПОРТНЫЕ СТРУКТУРЫ ЭТОЙ ОБЛАСТИ МОЖНО ТОЛЬКО ИЗ МОДУЛЯ <<< БИГ_ОКХ_СЕРВЕР >>>


Функция СтруктураЗапроса_СоздатьОрдер()
	
	СтруктураОперации = Новый Структура();	
	СтруктураОперации.Вставить("banAmend", 		"");
	СтруктураОперации.Вставить("instType", 		"");
	СтруктураОперации.Вставить("instId", 		"");
	СтруктураОперации.Вставить("tdMode", 		"");	
	СтруктураОперации.Вставить("ccy", 			"");
	СтруктураОперации.Вставить("clOrdId", 		"");
	СтруктураОперации.Вставить("tag", 			"");
	СтруктураОперации.Вставить("side", 			"");
	СтруктураОперации.Вставить("posSide", 		"");
	СтруктураОперации.Вставить("ordType", 		"");
	СтруктураОперации.Вставить("sz", 			"");
	СтруктураОперации.Вставить("px", 			"");
	СтруктураОперации.Вставить("pxUsd", 		"");
	СтруктураОперации.Вставить("pxVol", 		"");
	СтруктураОперации.Вставить("reduceOnly", 	"");
	СтруктураОперации.Вставить("tgtCcy", 		"");
	СтруктураОперации.Вставить("quickMgnType",	"");	
	СтруктураОперации.Вставить("stpId", 		"");
	СтруктураОперации.Вставить("stpMode", 		"");
	СтруктураОперации.Вставить("attachAlgoOrds",Новый Массив);
	            	
	Возврат СтруктураОперации;
	
КонецФункции

Функция СтруктураЗапроса_ИзменитьОрдер()
	
	// https://www.okx.com/docs-v5/en/?shell#order-book-trading-trade-post-amend-order
	
	СтруктураОперации = Новый Структура();	
	СтруктураОперации.Вставить("instId", 		"");
	СтруктураОперации.Вставить("ordId", 		"");
	СтруктураОперации.Вставить("cxlOnFail", 	"");	
	СтруктураОперации.Вставить("clOrdId", 		"");
	СтруктураОперации.Вставить("reqId", 		"");
	СтруктураОперации.Вставить("newSz", 		"");
	СтруктураОперации.Вставить("newPx", 		"");
	СтруктураОперации.Вставить("newPxUsd", 		"");
	СтруктураОперации.Вставить("newPxVol", 		"");
	
	Возврат СтруктураОперации;
		
КонецФункции

Функция СтруктураЗапроса_ОтменитьОрдер()
	
	// https://www.okx.com/docs-v5/en/?shell#order-book-trading-trade-post-cancel-order
	
	СтруктураОперации = Новый Структура();	
	СтруктураОперации.Вставить("instId", 		"");
	СтруктураОперации.Вставить("ordId", 		"");	
	СтруктураОперации.Вставить("clOrdId", 		"");
	
	Возврат СтруктураОперации;
		
КонецФункции

Функция СтруктураЗапроса_АктуализироватьОрдер() Экспорт
	
	// https://www.okx.com/docs-v5/en/?shell#order-book-trading-trade-get-order-details
	СтруктураОперации = Новый Структура();	
	СтруктураОперации.Вставить("instId", 		"");
	СтруктураОперации.Вставить("ordId", 		"");
	СтруктураОперации.Вставить("clOrdId", 		"");
	
	Возврат СтруктураОперации;
		
КонецФункции

Функция СтруктураЗапроса_ПолучитьСписокОрдеров()
	
	СтруктураОперации = Новый Структура();
	
	СтруктураОперации.Вставить("sprdId", 		"");
	СтруктураОперации.Вставить("ordType", 		"");
	СтруктураОперации.Вставить("state", 		"");
	СтруктураОперации.Вставить("after", 		"");
	СтруктураОперации.Вставить("before", 		"");
	СтруктураОперации.Вставить("limit", 		"");
	СтруктураОперации.Вставить("instId", 		"");
	
	Возврат СтруктураОперации;
		
КонецФункции

Функция СтруктураЗапроса_ПолучитьИсториюОрдеров()
	
	// https://www.okx.com/docs-v5/en/#order-book-trading-trade-get-order-history-last-7-days					
						
	// after, before - содержит orderId
	// begin, end - содержит ts

	// uly - Applicable to FUTURES/SWAP/OPTION
	// instFamily - Applicable to FUTURES/SWAP/OPTION
	// category - может принимать значения: twap, adl, full_liquidation, partial_liquidation, delivery, ddh: Delta dynamic hedge

	СтруктураОперации = Новый Структура();
	
	СтруктураОперации.Вставить("instType", 		"");	
	СтруктураОперации.Вставить("uly", 			"");
	СтруктураОперации.Вставить("instFamily", 	"");
	СтруктураОперации.Вставить("instId", 		"");
	СтруктураОперации.Вставить("ordType", 		"");
	СтруктураОперации.Вставить("state", 		"");
	СтруктураОперации.Вставить("category", 		"");	
	СтруктураОперации.Вставить("after", 		"");
	СтруктураОперации.Вставить("before", 		"");
	СтруктураОперации.Вставить("begin", 		"");
	СтруктураОперации.Вставить("end", 			"");
	СтруктураОперации.Вставить("limit", 		"");
	
	Возврат СтруктураОперации;
		
КонецФункции


Функция СтруктураЗапроса_СоздатьСвязанныйАлгоОрдер()
	
	СтруктураОперации = Новый Структура();	
	СтруктураОперации.Вставить("attachAlgoClOrdId", 	"");
	СтруктураОперации.Вставить("tpTriggerPx", 			"");
	СтруктураОперации.Вставить("tpOrdPx", 				"");
	СтруктураОперации.Вставить("tpOrdKind", 			"");
	СтруктураОперации.Вставить("tpTriggerPxType", 		"");
	СтруктураОперации.Вставить("slTriggerPx", 			"");
	СтруктураОперации.Вставить("slOrdPx", 				"");
	СтруктураОперации.Вставить("slTriggerPxType", 		"");
	СтруктураОперации.Вставить("sz", 					"");
	СтруктураОперации.Вставить("amendPxOnTriggerType",	"");		
	
	Возврат СтруктураОперации;
		
КонецФункции

Функция СтруктураЗапроса_СоздатьАлгоОрдер()
	
	СтруктураОперации = Новый Структура();	
		
	СтруктураОперации.Вставить("instId",        "");
	СтруктураОперации.Вставить("tdMode",        "");
	СтруктураОперации.Вставить("ccy",           "");
	СтруктураОперации.Вставить("side",          "");
	СтруктураОперации.Вставить("posSide",       "");
	СтруктураОперации.Вставить("ordType",       "");
	СтруктураОперации.Вставить("sz",            "");
	СтруктураОперации.Вставить("tag",           "");
	СтруктураОперации.Вставить("tgtCcy",	    "");
	СтруктураОперации.Вставить("algoClOrdId",   "");
	СтруктураОперации.Вставить("closeFraction",	"");
		
	Возврат СтруктураОперации;
		
КонецФункции

Функция СтруктураЗапроса_ИзменитьАлгоОрдер()
	
	// https://www.okx.com/docs-v5/en/?shell#order-book-trading-algo-trading-post-amend-algo-order
	СтруктураОперации = Новый Структура();	
	СтруктураОперации.Вставить("instId", 				""); //Required
	СтруктураОперации.Вставить("algoId", 				"");
	СтруктураОперации.Вставить("algoClOrdId", 			""); //Conditional
	СтруктураОперации.Вставить("cxlOnFail", 			"");
	СтруктураОперации.Вставить("reqId", 				"");
	СтруктураОперации.Вставить("newSz", 				"");
	СтруктураОперации.Вставить("newTpTriggerPx", 		"");
	СтруктураОперации.Вставить("newTpOrdPx", 			"");
	СтруктураОперации.Вставить("newSlTriggerPx", 		"");
	СтруктураОперации.Вставить("newSlOrdPx", 			"");
	СтруктураОперации.Вставить("newTpTriggerPxType", 	"");
	СтруктураОперации.Вставить("newSlTriggerPxType", 	"");
	
	Возврат СтруктураОперации;
		
КонецФункции

Функция СтруктураЗапроса_ОтменитьАлгоОрдер()

	СтруктураОперации = Новый Структура();	
	СтруктураОперации.Вставить("algoId", 		"");
	СтруктураОперации.Вставить("instId", 		"");
	
	Возврат СтруктураОперации;
	
КонецФункции

Функция СтруктураЗапроса_АктуализироватьАлгоОрдер() Экспорт
	
	СтруктураОперации = Новый Структура();	
	СтруктураОперации.Вставить("algoId", 		"");
	СтруктураОперации.Вставить("algoClOrdId", 	"");
	
	Возврат СтруктураОперации;
		
КонецФункции

Функция СтруктураЗапроса_ПолучитьСписокАлгоОрдеров()
	
	// https://www.okx.com/docs-v5/en/?shell#order-book-trading-algo-trading-get-algo-order-list
	СтруктураОперации = Новый Структура();
	
	СтруктураОперации.Вставить("ordType", 		"");
	СтруктураОперации.Вставить("algoClOrdId", 	"");
	СтруктураОперации.Вставить("instType", 		"");
	СтруктураОперации.Вставить("instId", 		"");
	СтруктураОперации.Вставить("after", 		"");
	СтруктураОперации.Вставить("before", 		"");
	СтруктураОперации.Вставить("limit", 		100);
	
	Возврат СтруктураОперации;
		
КонецФункции

Функция СтруктураЗапроса_ПолучитьИсториюАлгоОрдеров()
	
	СтруктураОперации = Новый Структура();
	
	СтруктураОперации.Вставить("ordType", 		"");
	СтруктураОперации.Вставить("state", 		"");
	СтруктураОперации.Вставить("algoId", 		"");
	СтруктураОперации.Вставить("instType", 		"");
	СтруктураОперации.Вставить("instId", 		"");
	СтруктураОперации.Вставить("after", 		"");	
	СтруктураОперации.Вставить("before", 		"");
	СтруктураОперации.Вставить("limit", 		"");
	
	Возврат СтруктураОперации;
		
КонецФункции


Функция СтруктураЗапроса_ОбновитьБаллансСчета()
	
	// процедура воткнута для однотипности, метод не требует передачи параметров
	Возврат Новый Структура();
		
КонецФункции

Функция СтруктураЗапроса_ПолучитьИнформациюОбАккаунте()
	
	// процедура воткнута для однотипности, метод не требует передачи параметров
	Возврат Новый Структура();
		
КонецФункции

Функция СтруктураЗапроса_ЗагрузитьСвечи()

	СтруктураОперации = Новый Структура();	
	СтруктураОперации.Вставить("instId", 	"");
	СтруктураОперации.Вставить("bar", 		"");
	СтруктураОперации.Вставить("limit", 	"");
	
	Возврат СтруктураОперации;
		
КонецФункции

Функция СтруктураЗапроса_ЗагрузитьИсториюСвечей()
	
	Возврат Новый Структура("instId, bar, after, before, limit");
		
КонецФункции

Функция СтруктураЗапроса_ЗагрузитьИнструменты()
	
	Возврат Новый Структура("instType, uly, instFamily, instId");
		
КонецФункции

Функция СтруктураЗапроса_ЗагрузитьМонеты()
	
	Возврат Новый Структура("ccy", "");
		
КонецФункции


Функция СтруктураЗапроса_ПолучитьЦену()

	СтруктураОперации = Новый Структура();	
	СтруктураОперации.Вставить("instType", 	"");
	СтруктураОперации.Вставить("uly", 		"");
	СтруктураОперации.Вставить("instFamily","");
	СтруктураОперации.Вставить("instId", 	"");
	
	Возврат СтруктураОперации;
		
КонецФункции


Функция СтруктураЗапроса_ПолучитьОткрытыеПозиции()
	
	СтруктураОперации = Новый Структура();
	
	СтруктураОперации.Вставить("instType", 		"");
	СтруктураОперации.Вставить("instId", 		"");
	СтруктураОперации.Вставить("posId", 		"");
	
	Возврат СтруктураОперации;
		
КонецФункции

Функция СтруктураЗапроса_ЗакрытьПозицию()
	
	СтруктураОперации = Новый Структура();	
	
	СтруктураОперации.Вставить("instId", 	"");
	СтруктураОперации.Вставить("posSide",	"");
	СтруктураОперации.Вставить("mgnMode", 	"");	
	СтруктураОперации.Вставить("ccy", 		"");
	СтруктураОперации.Вставить("autoCxl", 	"");	
	СтруктураОперации.Вставить("clOrdId", 	"");
	СтруктураОперации.Вставить("tag", 		"");
	СтруктураОперации.Вставить("posId", 	"");	
	
	Возврат СтруктураОперации;
		
КонецФункции

Функция СтруктураЗапроса_ПолучитьИсториюПозиций()
	
	СтруктураОперации = Новый Структура();
	
	СтруктураОперации.Вставить("instType", 		"");
	СтруктураОперации.Вставить("instId", 		"");
	СтруктураОперации.Вставить("mgnMode", 		"");
	СтруктураОперации.Вставить("type", 			"");
	СтруктураОперации.Вставить("posId", 		"");
	СтруктураОперации.Вставить("after", 		"");	
	СтруктураОперации.Вставить("before", 		"");
	СтруктураОперации.Вставить("limit", 		"");
	
	Возврат СтруктураОперации;
		
КонецФункции


Функция СтруктураЗапроса_УстановитьМаржу()
	
	СтруктураОперации = Новый Структура();
	
	СтруктураОперации.Вставить("instId", 	"");
	СтруктураОперации.Вставить("ccy", 		"");
	СтруктураОперации.Вставить("lever", 	"");
	СтруктураОперации.Вставить("mgnMode", 	"");
	СтруктураОперации.Вставить("posSide", 	"");
	
	Возврат СтруктураОперации;
		
КонецФункции

Функция СтруктураЗапроса_УстановитьРежимАккаунта()
	
	СтруктураОперации = Новый Структура();
	
	СтруктураОперации.Вставить("acctLv", 	"");
	
	Возврат СтруктураОперации;
		
КонецФункции

Функция СтруктураЗапроса_УстановитьРежимПозиций()
	
	СтруктураОперации = Новый Структура();
	
	СтруктураОперации.Вставить("posMode", 	"");
	
	Возврат СтруктураОперации;
		
КонецФункции

Функция СтруктураЗапроса_ПолучитьИсториюДвиженийСчета()
	
	СтруктураОперации = Новый Структура();
	
	СтруктураОперации.Вставить("instType", 	"");
	СтруктураОперации.Вставить("instId", 	"");
	СтруктураОперации.Вставить("ccy", 		"");
	СтруктураОперации.Вставить("mgnMode", 	"");
	СтруктураОперации.Вставить("ctType", 	"");
	СтруктураОперации.Вставить("type", 		"");
	СтруктураОперации.Вставить("subType", 	"");
	СтруктураОперации.Вставить("after", 	"");
	СтруктураОперации.Вставить("before", 	"");
	СтруктураОперации.Вставить("begin", 	"");
	СтруктураОперации.Вставить("end", 		"");
	СтруктураОперации.Вставить("limit", 	"");
	
	Возврат СтруктураОперации;
		
КонецФункции

// Структура запроса, соответствующая API OKX
Функция СтруктураЗапроса_ЗагрузитьТикеры()
	
    СтруктураЗапроса = Новый Структура();
    СтруктураЗапроса.Вставить("instType", 	"");
    СтруктураЗапроса.Вставить("instId", 	"");
    СтруктураЗапроса.Вставить("baseCcy", 	"");
	
    Возврат СтруктураЗапроса;
	
КонецФункции

#КонецОбласти //СтруктураПараметровМетодовБиржи 


#Область МэппингПараметровМетодовИнтеграционныхМодулей

Функция КонвертироватьПараметрыОперации_ИзменитьОрдер(ПараметрыОперации)

	СтруктураОперации = СтруктураЗапроса_ИзменитьОрдер();
	СтруктураОперации.instType 	= ПараметрыОперации.ИнструментТип;
	СтруктураОперации.instId 	= ПараметрыОперации.ИнструментИД;
	
	Возврат СтруктураОперации;
	
КонецФункции

Функция КонвертироватьПараметрыОперации_ОтменитьОрдер(ПараметрыОперации)

	СтруктураОперации = СтруктураЗапроса_ОтменитьОрдер();
	СтруктураОперации.instType 	= ПараметрыОперации.ИнструментТип;
	СтруктураОперации.instId 	= ПараметрыОперации.ИнструментИД;
	
	Возврат СтруктураОперации;
	
КонецФункции

Функция КонвертироватьПараметрыОперации_АктуализироватьОрдер(ПараметрыОперации)

	СтруктураОперации = СтруктураЗапроса_АктуализироватьОрдер();
	СтруктураОперации.ordId 	= ПараметрыОперации.ОрдерИД;
	СтруктураОперации.instId 	= ПараметрыОперации.ИнструментИД;
	СтруктураОперации.clOrdId 	= ПараметрыОперации.КлиентОрдерИД;
	
	Возврат СтруктураОперации;
	
КонецФункции

Функция КонвертироватьПараметрыОперации_ПолучитьСписокОрдеров(ПараметрыОперации)

	СтруктураОперации = СтруктураЗапроса_ПолучитьСписокОрдеров();
	СтруктураОперации.ordType 	= ПараметрыОперации.ОрдерТип;
	СтруктураОперации.after 	= ПараметрыОперации.ПослеОрдерИД;
	СтруктураОперации.before 	= ПараметрыОперации.ДоОрдерИД;
	СтруктураОперации.limit 	= ПараметрыОперации.Лимит;
	СтруктураОперации.instId	= параметрыоперации.ИнструментИД;
	
	Возврат СтруктураОперации;
	
КонецФункции

Функция КонвертироватьПараметрыОперации_ПолучитьИсториюОрдеров(ПараметрыОперации)

	СтруктураОперации = СтруктураЗапроса_ПолучитьИсториюОрдеров();
	СтруктураОперации.instType	= ПараметрыОперации.ИнструментТип;
	СтруктураОперации.instId 	= ПараметрыОперации.ИнструментИД;
	СтруктураОперации.ordType 	= ПараметрыОперации.ОрдерТип;
	СтруктураОперации.after 	= ПараметрыОперации.ПослеОрдерИД;
	СтруктураОперации.before 	= ПараметрыОперации.ДоОрдерИД;
	СтруктураОперации.begin 	= ПараметрыОперации.НачалоТочкаТС;
	СтруктураОперации.end 		= ПараметрыОперации.ЗавершениеТочкаТС;
	СтруктураОперации.limit 	= ПараметрыОперации.Лимит;
	
	Возврат СтруктураОперации;
	
КонецФункции


Функция КонвертироватьПараметрыОперации_СоздатьСвязанныйАлгоОрдер(ПараметрыОперации)

	СтруктураОперации = СтруктураЗапроса_СоздатьАлгоОрдер();
	СтруктураОперации.instId 	= ПараметрыОперации.ИнструментИД;
	
	Возврат СтруктураОперации;
	
КонецФункции

Функция КонвертироватьПараметрыОперации_СоздатьАлгоОрдер(ПараметрыОперации)

	СтруктураОперации = СтруктураЗапроса_СоздатьАлгоОрдер();
	СтруктураОперации.instId 		= ПараметрыОперации.ИнструментИД;
	СтруктураОперации.tdMode		= ПараметрыОперации.РежимТорговли;
	СтруктураОперации.ccy       	= ПараметрыОперации.Монета;
	СтруктураОперации.side      	= ПараметрыОперации.СторонаОрдера;
	СтруктураОперации.posSide   	= ПараметрыОперации.СторонаПозиции;
	СтруктураОперации.ordType   	= ПараметрыОперации.ТипАлгоОрдера;
	СтруктураОперации.sz   			= ПараметрыОперации.Объем;
	СтруктураОперации.algoClOrdId   = ПараметрыОперации.АлгоОрдерИД;	
	
	Возврат СтруктураОперации;
	
КонецФункции

Функция КонвертироватьПараметрыОперации_ИзменитьАлгоОрдер(ПараметрыОперации)

	СтруктураОперации = СтруктураЗапроса_ИзменитьАлгоОрдер();
	
	СтруктураОперации.instId 				= ПараметрыОперации.ИнструментИД;	
	СтруктураОперации.algoId 				= ПараметрыОперации.АлгоОрдерИД;
	СтруктураОперации.algoClOrdId 			= ПараметрыОперации.КлиентАлгоОрдерИД;
	СтруктураОперации.cxlOnFail 			= ""; // ПараметрыОперации.???;
	СтруктураОперации.reqId 				= ""; // ПараметрыОперации.???;
	СтруктураОперации.newSz 				= ПараметрыОперации.НовыйОбъем;
	СтруктураОперации.newTpTriggerPx 		= ПараметрыОперации.НовыйТриггерТейкПрофит;
	СтруктураОперации.newTpOrdPx 			= ПараметрыОперации.НовыйЦенаТейкПрофит;
	СтруктураОперации.newSlTriggerPx 		= ПараметрыОперации.НовыйТриггерСтопЛос;
	СтруктураОперации.newSlOrdPx 			= ПараметрыОперации.НовыйЦенаСтопЛос;
	СтруктураОперации.newTpTriggerPxType 	= ""; // ПараметрыОперации.???;
	СтруктураОперации.newSlTriggerPxType 	= ""; // ПараметрыОперации.???;
	
	Возврат СтруктураОперации;
	
КонецФункции

Функция КонвертироватьПараметрыОперации_ОтменитьАлгоОрдер(ПараметрыОперации)
	
	Массив = Новый Массив;
	
	СтруктураОперации = СтруктураЗапроса_ОтменитьАлгоОрдер();
	СтруктураОперации.algoId 	= ПараметрыОперации.АлгоОрдерИД;
	СтруктураОперации.instId 	= ПараметрыОперации.ИнструментИД;
	
	Массив.Добавить(СтруктураОперации);
	
	Возврат Массив;
	
КонецФункции

Функция КонвертироватьПараметрыОперации_АктуализироватьАлгоОрдер(ПараметрыОперации)

	СтруктураОперации = СтруктураЗапроса_АктуализироватьАлгоОрдер();
	СтруктураОперации.algoId 		= ПараметрыОперации.АлгоОрдерИД;
	СтруктураОперации.algoClOrdId 	= ПараметрыОперации.КлиентАлгоОрдерИД;
	
	Возврат СтруктураОперации;
	
КонецФункции

Функция КонвертироватьПараметрыОперации_ПолучитьСписокАлгоОрдеров(ПараметрыОперации)

	СтруктураОперации = СтруктураЗапроса_ПолучитьСписокАлгоОрдеров();
	СтруктураОперации.ordType 	= ПараметрыОперации.ОрдерТип;
	СтруктураОперации.instId 	= ПараметрыОперации.ИнструментИД;
	
	Возврат СтруктураОперации;
	
КонецФункции

Функция КонвертироватьПараметрыОперации_ПолучитьИсториюАлгоОрдеров(ПараметрыОперации)

	СтруктураОперации = СтруктураЗапроса_ПолучитьИсториюАлгоОрдеров();
	СтруктураОперации.ordType 	= ПараметрыОперации.ОрдерТип;
	СтруктураОперации.instId 	= ПараметрыОперации.ИнструментИД;
	СтруктураОперации.state 	= ПараметрыОперации.Состояние;
	СтруктураОперации.after 	= ПараметрыОперации.ПослеОрдерИД;
	СтруктураОперации.before 	= ПараметрыОперации.ДоОрдерИД;
	СтруктураОперации.limit 	= ПараметрыОперации.Лимит;
	
	Возврат СтруктураОперации;
	
КонецФункции


Функция КонвертироватьПараметрыОперации_ОбновитьБаллансСчета(ПараметрыОперации)
	
	СтруктураОперации = СтруктураЗапроса_ОбновитьБаллансСчета();
	
	Возврат СтруктураОперации;
	
КонецФункции

Функция КонвертироватьПараметрыОперации_ПолучитьИнформациюОбАккаунте(ПараметрыОперации)
	
	СтруктураОперации = СтруктураЗапроса_ПолучитьИнформациюОбАккаунте();
	
	Возврат СтруктураОперации;
	
КонецФункции

Функция КонвертироватьПараметрыОперации_ЗагрузитьСвечи(ПараметрыОперации)

	СтруктураОперации = СтруктураЗапроса_ЗагрузитьСвечи();
	СтруктураОперации.instId 	= ПараметрыОперации.ИнструментИД;
	СтруктураОперации.bar 		= ПараметрыОперации.Бар;
	СтруктураОперации.limit 	= ПараметрыОперации.КоличествоСвечей;
	
	Возврат СтруктураОперации;
	
КонецФункции

Функция КонвертироватьПараметрыОперации_ЗагрузитьИсториюСвечей(ПараметрыОперации)

	СтруктураОперации = СтруктураЗапроса_ЗагрузитьИсториюСвечей();
	СтруктураОперации.instId 	= ПараметрыОперации.ИнструментИД;
	СтруктураОперации.bar 		= ПараметрыОперации.Бар;
	СтруктураОперации.after 	= ПараметрыОперации.ТочкаДо;
	СтруктураОперации.before 	= ПараметрыОперации.ТочкаПосле;
	СтруктураОперации.limit 	= ПараметрыОперации.КоличествоСвечей;
	
	Возврат СтруктураОперации;
	
КонецФункции

Функция КонвертироватьПараметрыОперации_ЗагрузитьИнструменты(ПараметрыОперации)

	СтруктураОперации = СтруктураЗапроса_ЗагрузитьИнструменты();
	СтруктураОперации.instType 	= ПараметрыОперации.ИнструментТип;
	СтруктураОперации.instId 	= ПараметрыОперации.ИнструментИД;
	
	Возврат СтруктураОперации;
	
КонецФункции

Функция КонвертироватьПараметрыОперации_ЗагрузитьМонеты(ПараметрыОперации)

	СтруктураОперации = СтруктураЗапроса_ЗагрузитьМонеты();
	СтруктураОперации.ccy 	= ПараметрыОперации.Монета;
	
	Возврат СтруктураОперации;
	
КонецФункции


Функция КонвертироватьПараметрыОперации_ПолучитьЦену(ПараметрыОперации)

	СтруктураОперации = СтруктураЗапроса_ЗагрузитьИнструменты();
	СтруктураОперации.instType 	= ПараметрыОперации.ИнструментТип;
	СтруктураОперации.instId 	= ПараметрыОперации.ИнструментИД;
	
	Возврат СтруктураОперации;
	
КонецФункции


Функция КонвертироватьПараметрыОперации_ПолучитьОткрытыеПозиции(ПараметрыОперации)

	СтруктураОперации = СтруктураЗапроса_ПолучитьОткрытыеПозиции();
	СтруктураОперации.instType 	= ПараметрыОперации.ИнструментТип;
	СтруктураОперации.instId 	= ПараметрыОперации.ИнструментИД;
	СтруктураОперации.posId 	= ПараметрыОперации.ПозицияИД;
	
	Возврат СтруктураОперации;
	
КонецФункции

Функция КонвертироватьПараметрыОперации_ЗакрытьПозицию(ПараметрыОперации)

	СтруктураОперации = СтруктураЗапроса_ЗакрытьПозицию();
	СтруктураОперации.instId 	= ПараметрыОперации.ИнструментИД;
	СтруктураОперации.posSide 	= ПараметрыОперации.СторонаПозиции;
	СтруктураОперации.mgnMode 	= ПараметрыОперации.ВидМаржи;
	СтруктураОперации.ccy 		= ПараметрыОперации.Монета;
	СтруктураОперации.autoCxl 	= ПараметрыОперации.ЗакрытьОтложенныеОрдера;
	СтруктураОперации.clOrdId 	= ПараметрыОперации.ОрдерИД;
	
	Возврат СтруктураОперации;
	
КонецФункции

Функция КонвертироватьПараметрыОперации_ПолучитьИсториюПозиций(ПараметрыОперации)

	СтруктураОперации = СтруктураЗапроса_ПолучитьИсториюПозиций();
	СтруктураОперации.instType 	= ПараметрыОперации.ИнструментТип;
	СтруктураОперации.instId 	= ПараметрыОперации.ИнструментИД;
	СтруктураОперации.before 	= ПараметрыОперации.НачалоТочкаТС;
	
	Возврат СтруктураОперации;
	
КонецФункции


Функция КонвертироватьПараметрыОперации_УстановитьМаржу(ПараметрыОперации)

	СтруктураОперации = СтруктураЗапроса_УстановитьМаржу();
	СтруктураОперации.instId 	= ПараметрыОперации.ИнструментИД;
	СтруктураОперации.ccy 		= ПараметрыОперации.МонетаИД;
	СтруктураОперации.lever 	= ПараметрыОперации.УровеньМаржи;
	СтруктураОперации.mgnMode 	= ПараметрыОперации.РежимТорговли;
	СтруктураОперации.posSide 	= ПараметрыОперации.СторонаПозиции;
	
	Возврат СтруктураОперации;
	
КонецФункции

Функция КонвертироватьПараметрыОперации_УстановитьРежимАккаунта(ПараметрыОперации)

	СтруктураОперации = СтруктураЗапроса_УстановитьРежимАккаунта();
	
	СтруктураОперации.acctLv 	= ПараметрыОперации.УровеньАккаунта;
	
	Возврат СтруктураОперации;
	
КонецФункции

Функция КонвертироватьПараметрыОперации_УстановитьРежимПозиций(ПараметрыОперации)

	СтруктураОперации = СтруктураЗапроса_УстановитьРежимПозиций();
	
	СтруктураОперации.posMode 	= ПараметрыОперации.РежимПозиций;
	
	Возврат СтруктураОперации;
	
КонецФункции

Функция КонвертироватьПараметрыОперации_ПолучитьИсториюДвиженийСчета(ПараметрыОперации)

	СтруктураОперации = СтруктураЗапроса_ПолучитьИсториюДвиженийСчета();
	
	СтруктураОперации.instType 	= ПараметрыОперации.ИнструментТип;
	СтруктураОперации.instId 	= ПараметрыОперации.ИнструментИД;
	СтруктураОперации.ccy 		= ПараметрыОперации.Монета;
	СтруктураОперации.mgnMode 	= ПараметрыОперации.ТипМаржи;
	СтруктураОперации.ctType 	= ПараметрыОперации.ТипКонтракта;
	СтруктураОперации.type 		= ПараметрыОперации.ТипСчета;
	СтруктураОперации.subType 	= ПараметрыОперации.ПодтипСчета;
	СтруктураОперации.begin 	= ПараметрыОперации.НачалоТочкаТС;
	СтруктураОперации.end 		= ПараметрыОперации.ОкончаниеТочкаТС;
	
	Возврат СтруктураОперации;
	
КонецФункции

// Конвертировать параметры операции для метода "ЗагрузитьТикеры" под API OKX
Функция КонвертироватьПараметрыОперации_ЗагрузитьТикеры(ПараметрыОперации)
	
    СтруктураОперации 			= СтруктураЗапроса_ЗагрузитьТикеры();
	
	// instType — тип инструмента (SPOT, SWAP, FUTURES и т.д.)
    СтруктураОперации.instType 	= ПараметрыОперации.ИнструментТип;
	
	// instId — ID инструмента (например, BTC-USDT-SWAP)
    СтруктураОперации.instId 	= ПараметрыОперации.ИнструментИД;
	
	// baseCcy — базовая валюта (например, BTC)
    СтруктураОперации.baseCcy 	= ПараметрыОперации.БазоваяВалюта;
	
    Возврат СтруктураОперации;
	
КонецФункции

#КонецОбласти //МэппингПараметровМетодовИнтеграционныхМодулей


#Область СлужебныеПроцедурыФункции

Функция БиржаOKX() Экспорт	
	
	Возврат биг_ОбщегоНазначенияКлиентСервер.ПолучитьЗначениеПоИмени("OKX");
	
КонецФункции

Функция КлиентскийИдентификатор(Ссылка) Экспорт
	
	Возврат СтрЗаменить(XMLСтрока(Ссылка), "-", "");
	
КонецФункции

#КонецОбласти //СлужебныеПроцедурыФункции

 


