
#Область УниверсальныеМетоды

// ВНИМАНИЕ! ВСЯ ЦЕПОЧКА ВЫЗОВОВ ДОЛЖНА РЕАЛИЗОВЫВАТЬСЯ ЧЕРЕЗ ФУНКЦИИ С ВОЗВРАТОМ РЕЗУЛЬТАТА

// НЕ ЗАБЫВАТЬ ПРО ФУНКЦИОНАЛ БЕКТЕСТОВ

Функция СоздатьОрдер(ПараметрыОперацииБиржи, Аккаунт, Бектест = Ложь) Экспорт
	
	УдалитьНеЗаполненныеПараметры(ПараметрыОперацииБиржи);
	
	Модуль = ИнициализироватьМодуль();
	
	Если Бектест Тогда
		Возврат Истина; // документ уже создан, а отправлять на биржу не будем
	Иначе
		Результат = Модуль.POST_PlaceOrder(ПараметрыОперацииБиржи, Аккаунт);
		
		// !!! TODO: по хорошему для таких вызовов нужно формировать очередь и обрабатывать отдельно
		Если Результат Тогда
			// раньше сразу запрашивал детали ордера. После запуска WebSocket-клиента не актуально
			//ПолучитьДанныеБиржиОбОрдере(ПараметрыОперацииБиржи, Аккаунт);	
		КонецЕсли;
		
		Возврат Результат;	
	КонецЕсли;	
	
КонецФункции

Функция ИзменитьОрдер(ПараметрыОперацииБиржи, Аккаунт, Бектест = Ложь) Экспорт
    
	УдалитьНеЗаполненныеПараметры(ПараметрыОперацииБиржи);
	
	Модуль = ИнициализироватьМодуль();
	Возврат Модуль.POST_AmendOrder(ПараметрыОперацииБиржи, Аккаунт);
	
КонецФункции

Функция ОтменитьОрдер(ПараметрыОперацииБиржи, Аккаунт, Бектест = Ложь) Экспорт
    
	УдалитьНеЗаполненныеПараметры(ПараметрыОперацииБиржи);
	
	Модуль = ИнициализироватьМодуль();
	Возврат Модуль.POST_CancelOrder(ПараметрыОперацииБиржи, Аккаунт);
	
КонецФункции

Функция АктуализироватьОрдер(ПараметрыОперацииБиржи, Аккаунт) Экспорт
    
	УдалитьНеЗаполненныеПараметры(ПараметрыОперацииБиржи);
	
	Модуль = ИнициализироватьМодуль();
	Возврат Модуль.GET_OrderDetails(ПараметрыОперацииБиржи, Аккаунт);
	
КонецФункции

Функция ПолучитьСписокОрдеров(ПараметрыОперацииБиржи, Аккаунт) Экспорт

	УдалитьНеЗаполненныеПараметры(ПараметрыОперацииБиржи);
	
	Модуль = ИнициализироватьМодуль();
	Возврат Модуль.GET_PendingOrders(ПараметрыОперацииБиржи, Аккаунт);
	
КонецФункции 

Функция ПолучитьИсториюОрдеров(ПараметрыОперацииБиржи, Аккаунт) Экспорт

	УдалитьНеЗаполненныеПараметры(ПараметрыОперацииБиржи);
	
	Модуль = ИнициализироватьМодуль();
	Возврат Модуль.GET_OrdersHistory_7(ПараметрыОперацииБиржи, Аккаунт);
	
КонецФункции


Функция СоздатьАлгоОрдер(ПараметрыОперацииБиржи, Аккаунт, Бектест = Ложь) Экспорт
    
	УдалитьНеЗаполненныеПараметры(ПараметрыОперацииБиржи);
	
	Модуль = ИнициализироватьМодуль();
	
	Если Бектест Тогда                
		
		ЗаписатьДанныеАлгоордераВИсторию(ПараметрыОперацииБиржи);
		Возврат Истина; // документ уже создан, а отправлять на биржу не нужно
	Иначе
		
		Результат = Модуль.POST_PlaceAlgoOrder(ПараметрыОперацииБиржи, Аккаунт);
		
		// !!! TODO: по хорошему для таких вызовов нужно формировать очередь и обрабатывать отдельно
		Если Результат Тогда
			ПараметрыЗапроса = биг_ОКХ_КлиентСервер.СтруктураЗапроса_АктуализироватьАлгоОрдер();
			ПараметрыЗапроса.algoClOrdId = ПараметрыОперацииБиржи.algoClOrdId;
			АктуализироватьАлгоОрдер(ПараметрыОперацииБиржи, Аккаунт);
			ЗаписатьДанныеАлгоордераВИсторию(ПараметрыОперацииБиржи);
		КонецЕсли;
		
		Возврат Результат; 	
	КонецЕсли;
	
КонецФункции

Функция ИзменитьАлгоОрдер(ПараметрыОперацииБиржи, Аккаунт, Бектест = Ложь, ТаймСтамп = Неопределено) Экспорт
    
	УдалитьНеЗаполненныеПараметры(ПараметрыОперацииБиржи);
	
	Модуль = ИнициализироватьМодуль();
	
	Если Бектест Тогда
		
		Модуль.АлгоОрдер_Изменить_ПрименитьКДокументу(ПараметрыОперацииБиржи, ТаймСтамп);
		ЗаписатьДанныеАлгоордераВИсторию(ПараметрыОперацииБиржи);
		Возврат Истина;
	Иначе
		
		ЗаписатьДанныеАлгоордераВИсторию(ПараметрыОперацииБиржи); 
		
		Возврат Модуль.POST_AmendAlgoOrder(ПараметрыОперацииБиржи, Аккаунт);	
	КонецЕсли;	
	
КонецФункции

Функция ОтменитьАлгоОрдер(ПараметрыОперацииБиржи, Аккаунт, Бектест = Ложь) Экспорт
	
	Для каждого Структура Из ПараметрыОперацииБиржи Цикл
		УдалитьНеЗаполненныеПараметры(Структура);	
	КонецЦикла;  
	
	Модуль = ИнициализироватьМодуль();
	
	Если Бектест Тогда
		Бектест_АлгоОрдер_УстановитьСтатусОтменен(ПараметрыОперацииБиржи);
		Возврат Истина;
	Иначе
		Возврат Модуль.POST_CancelAlgoOrder(ПараметрыОперацииБиржи, Аккаунт);	
	КонецЕсли;
	  
КонецФункции

Функция АктуализироватьАлгоОрдер(ПараметрыОперацииБиржи, Аккаунт) Экспорт
    
	УдалитьНеЗаполненныеПараметры(ПараметрыОперацииБиржи);
	
	Модуль = ИнициализироватьМодуль();
	Возврат Модуль.GET_AlgoOrderDetails(ПараметрыОперацииБиржи, Аккаунт);
	
КонецФункции

Функция ПолучитьСписокАлгоОрдеров(ПараметрыОперацииБиржи, Аккаунт) Экспорт

	УдалитьНеЗаполненныеПараметры(ПараметрыОперацииБиржи);
	
	Модуль = ИнициализироватьМодуль();
	Возврат Модуль.GET_AlgoOrderList(ПараметрыОперацииБиржи, Аккаунт);
	
КонецФункции 

Функция ПолучитьИсториюАлгоОрдеров(ПараметрыОперацииБиржи, Аккаунт) Экспорт

	УдалитьНеЗаполненныеПараметры(ПараметрыОперацииБиржи);
	
	Модуль = ИнициализироватьМодуль();
	Возврат Модуль.GET_AlgoOrderHistory(ПараметрыОперацииБиржи, Аккаунт);
	
КонецФункции


Функция ОбновитьБаллансСчета(ПараметрыОперацииБиржи, Аккаунт) Экспорт
    
	УдалитьНеЗаполненныеПараметры(ПараметрыОперацииБиржи);
	
	Модуль = ИнициализироватьМодуль();
	Возврат Модуль.GET_AccountBalance(ПараметрыОперацииБиржи, Аккаунт);
	
КонецФункции

Функция ПолучитьИнформациюОбАккаунте(ПараметрыОперацииБиржи = Неопределено, Аккаунт) Экспорт
    
	Модуль = ИнициализироватьМодуль();
	Возврат Модуль.GET_AccountConfiguration(Аккаунт);
	
КонецФункции

Функция ЗагрузитьСвечи(ПараметрыОперацииБиржи) Экспорт
    
	УдалитьНеЗаполненныеПараметры(ПараметрыОперацииБиржи);
	
	Модуль = ИнициализироватьМодуль();
	Возврат Модуль.GET_DownloadCandles(ПараметрыОперацииБиржи);
	
КонецФункции

Функция ПолучитьПоследнююСвечу(ПараметрыОперацииБиржи) Экспорт
    
	УдалитьНеЗаполненныеПараметры(ПараметрыОперацииБиржи);
	
	Модуль = ИнициализироватьМодуль();
	Возврат Модуль.GET_Candles(ПараметрыОперацииБиржи);
	
КонецФункции

Функция ЗагрузитьИсториюСвечей(ПараметрыОперацииБиржи) Экспорт
    
	УдалитьНеЗаполненныеПараметры(ПараметрыОперацииБиржи);
	
	Модуль = ИнициализироватьМодуль();
	Возврат Модуль.GET_CandlesHistory(ПараметрыОперацииБиржи);
	
КонецФункции

Функция ПолучитьИсториюСвечей(ПараметрыОперацииБиржи) Экспорт
    
	УдалитьНеЗаполненныеПараметры(ПараметрыОперацииБиржи);
	
	Модуль = ИнициализироватьМодуль();
	Возврат Модуль.GET_CandlesHistoryData(ПараметрыОперацииБиржи);
	
КонецФункции

Функция ЗагрузитьИнструменты(ПараметрыОперацииБиржи) Экспорт
    
	УдалитьНеЗаполненныеПараметры(ПараметрыОперацииБиржи);
	
	Модуль = ИнициализироватьМодуль();
	Возврат Модуль.GET_DownloadInstruments(ПараметрыОперацииБиржи);
	
КонецФункции

Функция ЗагрузитьМонеты(ПараметрыОперацииБиржи) Экспорт
    
	УдалитьНеЗаполненныеПараметры(ПараметрыОперацииБиржи);
	
	ТехАккаунт = биг_ОбщегоНазначенияКлиентСервер.ПолучитьЗначениеПоИмени("ТехническийАккаунтOKX");
	Модуль = ИнициализироватьМодуль();
	Возврат Модуль.GET_DownloadCurrencies(ПараметрыОперацииБиржи, ТехАккаунт);
	
КонецФункции


Функция ПолучитьЦену(ПараметрыОперацииБиржи) Экспорт

	УдалитьНеЗаполненныеПараметры(ПараметрыОперацииБиржи);
	
	Модуль = ИнициализироватьМодуль();
	Возврат Модуль.GET_Price(ПараметрыОперацииБиржи);
	
КонецФункции

Функция ПолучитьЦенуТикета(ПараметрыОперацииБиржи) Экспорт

	УдалитьНеЗаполненныеПараметры(ПараметрыОперацииБиржи);
	
	Модуль = ИнициализироватьМодуль();
	Возврат Модуль.GET_PriceTickers(ПараметрыОперацииБиржи);
	
КонецФункции


Функция ПолучитьОткрытыеПозиции(ПараметрыОперацииБиржи, Аккаунт) Экспорт

	УдалитьНеЗаполненныеПараметры(ПараметрыОперацииБиржи);
	
	Модуль = ИнициализироватьМодуль();
	Возврат Модуль.GET_Positions(ПараметрыОперацииБиржи, Аккаунт);
	
КонецФункции

Функция ЗакрытьПозицию(ПараметрыОперацииБиржи, Аккаунт, Бектест = Ложь) Экспорт

	УдалитьНеЗаполненныеПараметры(ПараметрыОперацииБиржи);
	
	Модуль = ИнициализироватьМодуль(); 
	
	Если Бектест Тогда
		
		// TODO: написать процедуру, посмотреть как выглядит закрытая позиция
		//Бектест_Позиция_ЗакрытьПозицию(ПараметрыОперацииБиржи);
		Возврат Истина;
	Иначе
		Возврат Модуль.POST_ClosePosition(ПараметрыОперацииБиржи, Аккаунт);	
	КонецЕсли;
	
КонецФункции

Функция ПолучитьИсториюПозиций(ПараметрыОперацииБиржи, Аккаунт) Экспорт

	УдалитьНеЗаполненныеПараметры(ПараметрыОперацииБиржи);
	
	Модуль = ИнициализироватьМодуль();
	Возврат Модуль.GET_PositionHistory(ПараметрыОперацииБиржи, Аккаунт);
	
КонецФункции


Функция ПолучитьДоступныеРежимыТорговли(ТипИнструмента) Экспорт

	МассивДопустимыхРежимов = Новый Массив();
	
	Если ТипИнструмента = Перечисления.big_OKX_InstrumentType.FUTURES Тогда
		
		МассивДопустимыхРежимов.Добавить(Перечисления.big_OKX_tdModes.isolated);
		МассивДопустимыхРежимов.Добавить(Перечисления.big_OKX_tdModes.cross);
		
	ИначеЕсли ТипИнструмента = Перечисления.big_OKX_InstrumentType.MARGIN Тогда
		
		МассивДопустимыхРежимов.Добавить(Перечисления.big_OKX_tdModes.isolated);
		МассивДопустимыхРежимов.Добавить(Перечисления.big_OKX_tdModes.cross);
		
	ИначеЕсли ТипИнструмента = Перечисления.big_OKX_InstrumentType.OPTION Тогда
		
		МассивДопустимыхРежимов.Добавить(Перечисления.big_OKX_tdModes.cash);
		
	ИначеЕсли ТипИнструмента = Перечисления.big_OKX_InstrumentType.SPOT Тогда
		
		МассивДопустимыхРежимов.Добавить(Перечисления.big_OKX_tdModes.cash);
		МассивДопустимыхРежимов.Добавить(Перечисления.big_OKX_tdModes.spot_isolated);
		
	ИначеЕсли ТипИнструмента = Перечисления.big_OKX_InstrumentType.SWAP Тогда
		
		МассивДопустимыхРежимов.Добавить(Перечисления.big_OKX_tdModes.isolated);
		МассивДопустимыхРежимов.Добавить(Перечисления.big_OKX_tdModes.cross);	
		
	Иначе
		
		Сообщить("Для переданного Типа инструмента не задано соответствие в модуле биг_ОКХ_Сервер.ПолучитьДоступныеРежимыТорговли()");
	КонецЕсли;
	
	Возврат МассивДопустимыхРежимов;
	
КонецФункции

Функция УстановитьМаржу(ПараметрыОперацииБиржи, Аккаунт) Экспорт

	УдалитьНеЗаполненныеПараметры(ПараметрыОперацииБиржи);
	
	Модуль = ИнициализироватьМодуль();
	Возврат Модуль.POST_SetLeverage(ПараметрыОперацииБиржи, Аккаунт);
	
КонецФункции

Функция УстановитьРежимАккаунта(ПараметрыОперацииБиржи, Аккаунт) Экспорт

	УдалитьНеЗаполненныеПараметры(ПараметрыОперацииБиржи);
	
	Модуль = ИнициализироватьМодуль();
	Возврат Модуль.POST_SetAccountMode(ПараметрыОперацииБиржи, Аккаунт);
	
КонецФункции

Функция УстановитьРежимПозиций(ПараметрыОперацииБиржи, Аккаунт) Экспорт

	УдалитьНеЗаполненныеПараметры(ПараметрыОперацииБиржи);
	
	Модуль = ИнициализироватьМодуль();
	Возврат Модуль.POST_SetPositionMode(ПараметрыОперацииБиржи, Аккаунт);
	
КонецФункции

Функция ПолучитьИсториюДвиженийСчета(ПараметрыОперацииБиржи, Аккаунт) Экспорт

	УдалитьНеЗаполненныеПараметры(ПараметрыОперацииБиржи);
	
	Модуль = ИнициализироватьМодуль();
	Возврат Модуль.GET_Bills(ПараметрыОперацииБиржи, Аккаунт);
	
КонецФункции

Функция ПолучитьИсториюДвиженийСчетаТриМесяца(ПараметрыОперацииБиржи, Аккаунт) Экспорт

	УдалитьНеЗаполненныеПараметры(ПараметрыОперацииБиржи);
	
	Модуль = ИнициализироватьМодуль();
	Возврат Модуль.GET_BillsThreeMonths(ПараметрыОперацииБиржи, Аккаунт);
	
КонецФункции

#КонецОбласти //УниверсальныеМетоды	


#Область ПрограммныйИнтерфейс

Процедура МенеджерОбновленияАктивныхОрдеров() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	big_Order_OKX.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.big_Order_OKX КАК big_Order_OKX
	|ГДЕ
	|	(big_Order_OKX.Статус = ЗНАЧЕНИЕ(Перечисление.big_СтатусыТорговыхОбъектов.Новый)
	|			ИЛИ big_Order_OKX.Статус = ЗНАЧЕНИЕ(Перечисление.big_СтатусыТорговыхОбъектов.Активный))
	|	И big_Order_OKX.ordId <> """"";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ВыполняемыйМетод 		= "биг_ОКХ_Сервер.ОбновлениеИнформацииОбОрдере";
		
		ПараметрыЗапуска		= Новый Структура("Ордер", Выборка.Ссылка);
		
		ПараметрыВыполнения 	= ДлительныеОперации.ПараметрыВыполненияВФоне(Неопределено);
		ПараметрыВыполнения.НаименованиеФоновогоЗадания = ВыполняемыйМетод;
		ПараметрыВыполнения.ЗапуститьВФоне 				= Истина; 
		
		СтруктураФоновогоЗадания = ДлительныеОперации.ВыполнитьВФоне(ВыполняемыйМетод, ПараметрыЗапуска, ПараметрыВыполнения);		
	КонецЦикла;             	
	
КонецПроцедуры

Процедура ОбновлениеИнформацииОбОрдере(Параметры, АдресХранилищаРезультата) Экспорт
	
	биг_МаркетАпи.АктуализироватьОрдер(Параметры.Ордер);
	
КонецПроцедуры

Процедура МенеджерОбновленияОткрытыхПозицийИОрдеров() Экспорт
	
	// сейчас здесь только АлгоОрдера, потому что Ордера и Позиции уехали в веб-сокет
	Биржа = Биржа();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	big_AlgoOrders_OKX.Аккаунт КАК Аккаунт,
	               |	big_AlgoOrders_OKX.algoId КАК ОрдерИД
	               |ИЗ
	               |	Документ.big_AlgoOrders_OKX КАК big_AlgoOrders_OKX
	               |ГДЕ
	               |	(big_AlgoOrders_OKX.Статус = ЗНАЧЕНИЕ(Перечисление.big_СтатусыТорговыхОбъектов.Активный)
	               |			ИЛИ big_AlgoOrders_OKX.Статус = ЗНАЧЕНИЕ(Перечисление.big_СтатусыТорговыхОбъектов.Новый))
	               |	И big_AlgoOrders_OKX.algoId <> """"
	               |	И big_AlgoOrders_OKX.Проведен";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл	
		
		// АЛГО ОРДЕРА
		АлгоОрдерДетали	= биг_МаркетАпиКлиентСервер.СтруктураОперации_АктуализироватьАлгоОрдер();
		АлгоОрдерДетали.Биржа         	= Биржа;
		АлгоОрдерДетали.Аккаунт       	= Выборка.Аккаунт;
		АлгоОрдерДетали.АлгоОрдерИД		= Выборка.ОрдерИД;
		
		биг_МаркетАпи.АктуализироватьАлгоОрдер(, АлгоОрдерДетали);
        						
	КонецЦикла;
	         	
КонецПроцедуры                                       

Процедура МенеджерОбновленияИсторииОрдеровПозиций(НачалоПериода = Неопределено) Экспорт
		
	Биржа = Биржа();
	
	// TODO: собирать аккаунты не срезом последних, а все кто был активен в периоде
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	big_MarketAccounts.Ссылка КАК Аккаунт,
	               |	big_Instruments.instType КАК ИнструментТип,
	               |	биг_ИнструментыСтратегийСрезПоследних.ИнструментИД КАК ИнструментИД
	               |ИЗ
	               |	Справочник.big_MarketAccounts КАК big_MarketAccounts
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.биг_УчастникиСтратегий.СрезПоследних(, Участник = ИСТИНА) КАК биг_УчастникиСтратегийСрезПоследних
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.биг_ИнструментыСтратегий.СрезПоследних(, Участие = ИСТИНА) КАК биг_ИнструментыСтратегийСрезПоследних
	               |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.big_Instruments КАК big_Instruments
	               |				ПО биг_ИнструментыСтратегийСрезПоследних.ИнструментИД = big_Instruments.instId
	               |			ПО биг_УчастникиСтратегийСрезПоследних.Participiant.Владелец = биг_ИнструментыСтратегийСрезПоследних.Биржа
	               |		ПО big_MarketAccounts.Ссылка = биг_УчастникиСтратегийСрезПоследних.Participiant
	               |ГДЕ
	               |	big_MarketAccounts.Владелец = &Биржа
	               |
	               |ОБЪЕДИНИТЬ
	               |
	               |ВЫБРАТЬ
	               |	big_MarketAccounts.Ссылка,
	               |	биг_ПортфелиИнструменты.Инструмент.instType,
	               |	биг_ПортфелиИнструменты.Инструмент.instId
	               |ИЗ
	               |	Справочник.big_MarketAccounts КАК big_MarketAccounts
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.биг_УчастникиПортфелей.СрезПоследних(, Участник = ИСТИНА) КАК биг_УчастникиПортфелейСрезПоследних
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.биг_Портфели.Инструменты КАК биг_ПортфелиИнструменты
	               |			ПО биг_УчастникиПортфелейСрезПоследних.Портфель = биг_ПортфелиИнструменты.Ссылка
	               |		ПО big_MarketAccounts.Ссылка = биг_УчастникиПортфелейСрезПоследних.Аккаунт
	               |ГДЕ
	               |	big_MarketAccounts.Владелец = &Биржа";
	
	Запрос.УстановитьПараметр("Биржа", Биржа);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		    			
		ПараметрыЗапроса = биг_МаркетАпиКлиентСервер.СтруктураОперации_ПолучитьИсториюОрдеров();
		ПараметрыЗапроса.Биржа = Биржа;
		ЗаполнитьЗначенияСвойств(ПараметрыЗапроса, Выборка);
		
		Ответ = биг_МаркетАпи.ПолучитьИсториюОрдеров(Выборка.Аккаунт, ПараметрыЗапроса);			
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьОткрытыеПозиции(Параметры, АдресХранилищаРезультата) Экспорт
	
	Попытка
		биг_МаркетАпи.ПолучитьОткрытыеПозиции(Параметры.Аккаунт, Параметры);		
	Исключение
	    ЗаписьЖурналаРегистрации("Интеграция.биг_ОКХ_Сервер.ОбновитьОткрытыеПозиции", УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

Процедура ОбновитьИсториюПозиций(Параметры, АдресХранилищаРезультата) Экспорт
	
	Попытка
		биг_МаркетАпи.ПолучитьИсториюПозиций(Параметры.Аккаунт, Параметры);		
	Исключение
	    ЗаписьЖурналаРегистрации("Интеграция.биг_ОКХ_Сервер.ОбновитьИсториюПозиций", УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры

Процедура ОбновитьОткрытыеОрдера(Параметры, АдресХранилищаРезультата) Экспорт
	
	Попытка
		биг_МаркетАпи.ПолучитьСписокОрдеров(Параметры.Аккаунт, Параметры);		
	Исключение
	    ЗаписьЖурналаРегистрации("Интеграция.биг_ОКХ_Сервер.ОбновитьОткрытыеОрдера", УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки());
	КонецПопытки;	
	
КонецПроцедуры

Процедура ОбновитьИсториюОрдеров(Параметры, АдресХранилищаРезультата) Экспорт
	
	Попытка
		биг_МаркетАпи.ПолучитьИсториюОрдеров(Параметры.Аккаунт, Параметры);		
	Исключение
	    ЗаписьЖурналаРегистрации("Интеграция.биг_ОКХ_Сервер.ОбновитьИсториюОрдеров", УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки());
	КонецПопытки;	
	
КонецПроцедуры

Процедура ОбновитьИсториюАлгоОрдеров(Параметры, АдресХранилищаРезультата) Экспорт
	
	Попытка
		биг_МаркетАпи.ПолучитьИсториюАлгоОрдеров(Параметры.Аккаунт, Параметры);		
	Исключение
	    ЗаписьЖурналаРегистрации("Интеграция.биг_ОКХ_Сервер.ОбновитьИсториюАлгоОрдеров", УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки());
	КонецПопытки;	
	
КонецПроцедуры

Процедура МенеджерОбновленияИнструментовБирж() Экспорт
	
	Биржа = Биржа();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	big_OKX_InstrumentType.Ссылка КАК Ссылка
	|ИЗ
	|	Перечисление.big_OKX_InstrumentType КАК big_OKX_InstrumentType
	|ГДЕ
	|	big_OKX_InstrumentType.Ссылка <> ЗНАЧЕНИЕ(Перечисление.big_OKX_InstrumentType.OPTION)";

	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтруктураОперации = биг_МаркетАпиКлиентСервер.СтруктураОперации_ЗагрузитьИнструменты();
		СтруктураОперации.Биржа 			= Биржа;
		СтруктураОперации.ИнструментТип 	= Выборка.Ссылка;

		биг_МаркетАпи.ЗагрузитьИнструменты(СтруктураОперации);			
	КонецЦикла;
    
КонецПроцедуры

Процедура МенеджерОбновленияДоступныхМонет() Экспорт

	Параметры = биг_МаркетАпиКлиентСервер.СтруктураОперации_ЗагрузитьМонеты();
	Параметры.Биржа = Биржа();
	биг_МаркетАпи.ЗагрузитьМонеты(Параметры);
	
КонецПроцедуры

// Вызов метода GET /api/v5/market/tickers через унифицированную точку входа
Функция ЗагрузитьТикеры(ПараметрыОперацииБиржи) Экспорт
	
	УдалитьНеЗаполненныеПараметры(ПараметрыОперацииБиржи);
    Модуль = ИнициализироватьМодуль();
	
    Возврат Модуль.GET_Tickers(ПараметрыОперацииБиржи);
КонецФункции

#КонецОбласти //ПрограммныйИнтерфейс


#Область РаботаСДокументами

Функция СоздатьДокумент_Ордер(ПараметрыОперации, Бектест = Ложь, ТаймСтамп = Неопределено) Экспорт
	
	УИД 			= Новый УникальныйИдентификатор();
	СсылкаНаОрдер 	= Документы.big_Order_OKX.ПолучитьСсылку(УИД);		
	Ордер			= НайтиСоздатьОрдер(ПараметрыОперации, СсылкаНаОрдер);
	
	ПараметрыОперации.КлиентОрдерИД = биг_ОКХ_КлиентСервер.КлиентскийИдентификатор(СсылкаНаОрдер);
	
	// сперва нужно создать алгоордера, если они есть
	Если ПараметрыОперации.МассивСвязанныхАлгоОрдеров.Количество() > 0 Тогда
		Для каждого СтруктураАлгоОрдера Из ПараметрыОперации.МассивСвязанныхАлгоОрдеров Цикл
						
			УИДАлго 			= Новый УникальныйИдентификатор;
			СсылкаНаАлгоОрдер	= Документы.big_AlgoOrders_OKX.ПолучитьСсылку(УИДАлго);			
			АлгоОрдер 			= НайтиСоздатьАлгоОрдер(СтруктураАлгоОрдера, СсылкаНаАлгоОрдер);			
			
			СтруктураАлгоОрдера.КлиентАлгоОрдерИД = биг_ОКХ_КлиентСервер.КлиентскийИдентификатор(СсылкаНаАлгоОрдер); 
			
			СтруктураАлгоОрдера.Ордер = СсылкаНаОрдер;
			АлгоОрдер.Заполнить(СтруктураАлгоОрдера);
			
			Если Бектест Тогда
				СоздатьДокумент_АлгоОрдер_Бектест(СтруктураАлгоОрдера, АлгоОрдер, ТаймСтамп);
				АлгоОрдер.Записать(РежимЗаписиДокумента.Проведение);
			Иначе
				// в "рабочем" режиме документ будет проведен после загрузки деталей операции с биржи
				// т.е. после подтверждения, что ордер размещен
				АлгоОрдер.Записать(РежимЗаписиДокумента.Запись);
			КонецЕсли;
			
			ЗаписатьДанныеАлгоордераВИсторию(СтруктураАлгоОрдера);
			
			НС = Ордер.attachAlgoOrds.Добавить();
			НС.АлгоОрдер = АлгоОрдер.Ссылка; 
		КонецЦикла;	
	КонецЕсли;
	     
	Ордер.Заполнить(ПараметрыОперации);
	 	
	Если Бектест Тогда   		
		СоздатьДокумент_Ордер_Бектест(ПараметрыОперации, Ордер, ТаймСтамп);
 		Ордер.Записать(РежимЗаписиДокумента.Проведение);
	Иначе
		// в "рабочем" режиме документ будет проведен после загрузки деталей операции с биржи
		// т.е. после подтверждения, что ордер размещен
		Ордер.Записать(РежимЗаписиДокумента.Запись);
	КонецЕсли;
		
	Возврат Ордер.Ссылка;
	
КонецФункции

Функция СоздатьДокумент_АлгоОрдер(ПараметрыОперации, Бектест = Ложь, ТаймСтамп = Неопределено) Экспорт

	АлгоОрдер = Документы.big_AlgoOrders_OKX.СоздатьДокумент();
	АлгоОрдер.Заполнить(ПараметрыОперации);
	
	Если Бектест Тогда
		СоздатьДокумент_АлгоОрдер_Бектест(ПараметрыОперации, АлгоОрдер, ТаймСтамп);
	КонецЕсли; 
		
	АлгоОрдер.Записать(РежимЗаписиДокумента.Запись);
		
	Возврат АлгоОрдер.Ссылка;
	
КонецФункции

Функция ПолучитьМассивСвязанныхОпераций(Операция) Экспорт
	
	ТипЗначения 	= ТипЗнч(Операция);
	МассивОпераций 	= ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Операция);
	
	Если ТипЗначения = Тип("ДокументСсылка.big_Order_OKX") Тогда
		Для каждого Строка Из Операция.attachAlgoOrds Цикл
			МассивОпераций.Добавить(Строка.АлгоОрдер);
		КонецЦикла;	
	КонецЕсли;
	
	Возврат МассивОпераций;
	
КонецФункции

Функция НайтиСоздатьОрдер(ПараметрыОперации, СсылкаНаОрдер)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	big_Order_OKX.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.big_Order_OKX КАК big_Order_OKX
	|ГДЕ
	|	big_Order_OKX.ТочкаНачалаПадения = &ТочкаНачалаПадения
	|	И big_Order_OKX.НастройкаСтратегии = &КлючНастроек
	|	И big_Order_OKX.Аккаунт = &Аккаунт
	|	И big_Order_OKX.instId = &ИнструментИД
	|	И big_Order_OKX.Событие = &Событие";
	
	Запрос.УстановитьПараметр("ТочкаНачалаПадения", ПараметрыОперации.Сигнал);
	Запрос.УстановитьПараметр("КлючНастроек", 		ПараметрыОперации.КлючНастроек);
	Запрос.УстановитьПараметр("Аккаунт", 			ПараметрыОперации.Аккаунт);
	Запрос.УстановитьПараметр("Событие", 			ПараметрыОперации.Событие);
	Запрос.УстановитьПараметр("ИнструментИД", 		ПараметрыОперации.ИнструментИД);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ОрдерОбъект = Документы.big_Order_OKX.СоздатьДокумент();
		ОрдерОбъект.УстановитьСсылкуНового(СсылкаНаОрдер);
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ОрдерОбъект 	= Выборка.Ссылка.ПолучитьОбъект();
		
		// очистка документа
		ОрдерОбъект.attachAlgoOrds.Очистить();
		ОрдерОбъект.uTime = 0;
		ОрдерОбъект.cTime = 0;
		ОрдерОбъект.state = "";
		
		СсылкаНаОрдер 	= Выборка.Ссылка;
	КонецЕсли;                                        
	
	Возврат ОрдерОбъект;	
	
КонецФункции

Функция НайтиСоздатьАлгоОрдер(ПараметрыОперации, СсылкаНаАлгоОрдер)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	big_AlgoOrders_OKX.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.big_AlgoOrders_OKX КАК big_AlgoOrders_OKX
	|ГДЕ
	|	big_AlgoOrders_OKX.ТочкаНачалаПадения = &ТочкаНачалаПадения
	|	И big_AlgoOrders_OKX.НастройкаСтратегии = &КлючНастроек
	|	И big_AlgoOrders_OKX.Аккаунт = &Аккаунт
	|	И big_AlgoOrders_OKX.instId = &ИнструментИД
	|	И big_AlgoOrders_OKX.Событие = &Событие";
	
	Запрос.УстановитьПараметр("ТочкаНачалаПадения", ПараметрыОперации.Сигнал);
	Запрос.УстановитьПараметр("КлючНастроек", 		ПараметрыОперации.КлючНастроек);
	Запрос.УстановитьПараметр("Аккаунт", 			ПараметрыОперации.Аккаунт);
	Запрос.УстановитьПараметр("Событие", 			ПараметрыОперации.Событие);
	Запрос.УстановитьПараметр("ИнструментИД", 		ПараметрыОперации.ИнструментИД);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ОрдерОбъект = Документы.big_AlgoOrders_OKX.СоздатьДокумент();
		ОрдерОбъект.УстановитьСсылкуНового(СсылкаНаАлгоОрдер);
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ОрдерОбъект 		= Выборка.Ссылка.ПолучитьОбъект();
		
		// стираем состояние, которое могло быть установлено в предыдущих итерациях
		// очистка документа
		ОрдерОбъект.uTime 		= 0;
		ОрдерОбъект.cTime 		= 0;
		ОрдерОбъект.state 		= "";
		ОрдерОбъект.tpTriggerPx	= 0;
		ОрдерОбъект.tpOrdPx     = 0;
		ОрдерОбъект.slTriggerPx = 0;
		ОрдерОбъект.slOrdPx     = 0;
		ОрдерОбъект.sz          = 0;
		
		СсылкаНаАлгоОрдер 	= Выборка.Ссылка;
	КонецЕсли;                                        
	
	Возврат ОрдерОбъект;
	
КонецФункции

#КонецОбласти //РаботаСДокументами


#Область ПереадресацияСтруктурПараметров

Функция ПараметрыОперацииБиржи_СоздатьОрдер(ДокументОперации) Экспорт
	
	Возврат биг_ОКХ_КлиентСервер.ПараметрыОперацииБиржи_СоздатьОрдер(ДокументОперации);
		
КонецФункции

Функция ПараметрыОперацииБиржи_ИзменитьОрдер(ПараметрыОперации) Экспорт
	
	Возврат биг_ОКХ_КлиентСервер.ПараметрыОперацииБиржи_ИзменитьОрдер(ПараметрыОперации);
		
КонецФункции

Функция ПараметрыОперацииБиржи_ОтменитьОрдер(ДокументОперации, ПараметрыОперации) Экспорт
	
	Возврат биг_ОКХ_КлиентСервер.ПараметрыОперацииБиржи_ОтменитьОрдер(ДокументОперации, ПараметрыОперации);
		
КонецФункции

Функция ПараметрыОперацииБиржи_АктуализироватьОрдер(ДокументОперации, ПараметрыОперации) Экспорт
	
	Возврат биг_ОКХ_КлиентСервер.ПараметрыОперацииБиржи_АктуализироватьОрдер(ДокументОперации, ПараметрыОперации);
		
КонецФункции

Функция ПараметрыОперацииБиржи_ПолучитьСписокОрдеров(ПараметрыОперации) Экспорт
	
	Возврат биг_ОКХ_КлиентСервер.ПараметрыОперацииБиржи_ПолучитьСписокОрдеров(ПараметрыОперации);
		
КонецФункции

Функция ПараметрыОперацииБиржи_ПолучитьИсториюОрдеров(ПараметрыОперации) Экспорт
	
	Возврат биг_ОКХ_КлиентСервер.ПараметрыОперацииБиржи_ПолучитьИсториюОрдеров(ПараметрыОперации);
		
КонецФункции


Функция ПараметрыОперацииБиржи_СоздатьАлгоОрдер(ДокументОперации, ПараметрыОперации) Экспорт
	
	Возврат биг_ОКХ_КлиентСервер.ПараметрыОперацииБиржи_СоздатьАлгоОрдер(ДокументОперации, ПараметрыОперации);
		
КонецФункции

Функция ПараметрыОперацииБиржи_ИзменитьАлгоОрдер(ПараметрыОперации) Экспорт
	
	Возврат биг_ОКХ_КлиентСервер.ПараметрыОперацииБиржи_ИзменитьАлгоОрдер(ПараметрыОперации);
		
КонецФункции

Функция ПараметрыОперацииБиржи_ОтменитьАлгоОрдер(ДокументОперации, ПараметрыОперации) Экспорт
	
	Возврат биг_ОКХ_КлиентСервер.ПараметрыОперацииБиржи_ОтменитьАлгоОрдер(ДокументОперации, ПараметрыОперации);
		
КонецФункции 

Функция ПараметрыОперацииБиржи_АктуализироватьАлгоОрдер(ДокументОперации, ПараметрыОперации) Экспорт
	
	Возврат биг_ОКХ_КлиентСервер.ПараметрыОперацииБиржи_АктуализироватьАлгоОрдер(ДокументОперации, ПараметрыОперации);
		
КонецФункции 

Функция ПараметрыОперацииБиржи_ПолучитьСписокАлгоОрдеров(ПараметрыОперации) Экспорт
	
	Возврат биг_ОКХ_КлиентСервер.ПараметрыОперацииБиржи_ПолучитьСписокАлгоОрдеров(ПараметрыОперации);
		
КонецФункции

Функция ПараметрыОперацииБиржи_ПолучитьИсториюАлгоОрдеров(ПараметрыОперации) Экспорт
	
	Возврат биг_ОКХ_КлиентСервер.ПараметрыОперацииБиржи_ПолучитьИсториюАлгоОрдеров(ПараметрыОперации);
		
КонецФункции


Функция ПараметрыОперацииБиржи_ОбновитьБаллансСчета(ПараметрыОперации) Экспорт
	 	
	Возврат биг_ОКХ_КлиентСервер.ПараметрыОперацииБиржи_ОбновитьБаллансСчета(ПараметрыОперации);
		
КонецФункции

Функция ПараметрыОперацииБиржи_ПолучитьИнформациюОбАккаунте(ПараметрыОперации) Экспорт
	 	
	Возврат биг_ОКХ_КлиентСервер.ПараметрыОперацииБиржи_ПолучитьИнформациюОбАккаунте(ПараметрыОперации);
		
КонецФункции

Функция ПараметрыОперацииБиржи_ЗагрузитьСвечи(ПараметрыОперации) Экспорт
	
	Возврат биг_ОКХ_КлиентСервер.ПараметрыОперацииБиржи_ЗагрузитьСвечи(ПараметрыОперации);
		
КонецФункции

Функция ПараметрыОперацииБиржи_ЗагрузитьИсториюСвечей(ПараметрыОперации) Экспорт
	
	Возврат биг_ОКХ_КлиентСервер.ПараметрыОперацииБиржи_ЗагрузитьИсториюСвечей(ПараметрыОперации);
		
КонецФункции

Функция ПараметрыОперацииБиржи_ЗагрузитьИнструменты(ПараметрыОперации) Экспорт
	
	Возврат биг_ОКХ_КлиентСервер.ПараметрыОперацииБиржи_ЗагрузитьИнструменты(ПараметрыОперации);
		
КонецФункции

Функция ПараметрыОперацииБиржи_ЗагрузитьМонеты(ПараметрыОперации) Экспорт
	
	Возврат биг_ОКХ_КлиентСервер.ПараметрыОперацииБиржи_ЗагрузитьМонеты(ПараметрыОперации);
		
КонецФункции


Функция ПараметрыОперацииБиржи_ПолучитьЦену(ПараметрыОперации) Экспорт
	
	Возврат биг_ОКХ_КлиентСервер.ПараметрыОперацииБиржи_ПолучитьЦену(ПараметрыОперации);
		
КонецФункции


Функция ПараметрыОперацииБиржи_ПолучитьОткрытыеПозиции(ПараметрыОперации) Экспорт
	
	Возврат биг_ОКХ_КлиентСервер.ПараметрыОперацииБиржи_ПолучитьОткрытыеПозиции(ПараметрыОперации);
		
КонецФункции

Функция ПараметрыОперацииБиржи_ЗакрытьПозицию(ДокументОперации, ПараметрыОперации) Экспорт
	
	Возврат биг_ОКХ_КлиентСервер.ПараметрыОперацииБиржи_ЗакрытьПозицию(ДокументОперации, ПараметрыОперации);
		
КонецФункции 

Функция ПараметрыОперацииБиржи_ПолучитьИсториюПозиций(ПараметрыОперации) Экспорт
	
	Возврат биг_ОКХ_КлиентСервер.ПараметрыОперацииБиржи_ПолучитьИсториюПозиций(ПараметрыОперации);
		
КонецФункции


Функция ПараметрыОперацииБиржи_УстановитьМаржу(ПараметрыОперации) Экспорт
	
	Возврат биг_ОКХ_КлиентСервер.ПараметрыОперацииБиржи_УстановитьМаржу(ПараметрыОперации);
		
КонецФункции

Функция ПараметрыОперацииБиржи_УстановитьРежимАккаунта(ПараметрыОперации) Экспорт
	
	Возврат биг_ОКХ_КлиентСервер.ПараметрыОперацииБиржи_УстановитьРежимАккаунта(ПараметрыОперации);
		
КонецФункции

Функция ПараметрыОперацииБиржи_УстановитьРежимПозиций(ПараметрыОперации) Экспорт
	
	Возврат биг_ОКХ_КлиентСервер.ПараметрыОперацииБиржи_УстановитьРежимПозиций(ПараметрыОперации);
		
КонецФункции

Функция ПараметрыОперацииБиржи_ПолучитьИсториюДвиженийСчета(ПараметрыОперации) Экспорт
	
	Возврат биг_ОКХ_КлиентСервер.ПараметрыОперацииБиржи_ПолучитьИсториюДвиженийСчета(ПараметрыОперации);
		
КонецФункции

// Унифицированный метод для подготовки параметров под вызов API OKX для загрузки тикеров
Функция ПараметрыОперацииБиржи_ЗагрузитьТикеры(ПараметрыОперации) Экспорт 
	
    Возврат биг_ОКХ_КлиентСервер.ПараметрыОперацииБиржи_ЗагрузитьТикеры(ПараметрыОперации);
	
КонецФункции

#КонецОбласти //ПереадресацияСтруктурПараметров
						  
						  
#Область Служебные

Функция ИнициализироватьМодуль()
	
	Модуль = Обработки.big_OKX_API.Создать();
	Возврат Модуль;
		
КонецФункции

Процедура УдалитьНеЗаполненныеПараметры(ОбъектПроверки)
	
	Если ТипЗнч(ОбъектПроверки) = Тип("Структура") ИЛИ ТипЗнч(ОбъектПроверки) = Тип("Соответствие") Тогда
		МассивКоллекцийКлючЗначение = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ОбъектПроверки);
	ИначеЕсли ТипЗнч(ОбъектПроверки) = Тип("Массив") Тогда
		МассивКоллекцийКлючЗначение = ОбъектПроверки;
	Иначе
		ВызватьИсключение "Не верный тип данных для проверки пустых параметров";
	КонецЕсли;
	
	Для каждого КоллекцияПараметров Из МассивКоллекцийКлючЗначение Цикл 
		
		МассивУдалить = Новый Массив;
		
		Для каждого Элемент Из КоллекцияПараметров Цикл
			
			ТипЗначения = ТипЗнч(Элемент.Значение);
			Если ТипЗначения = Тип("Строка") Тогда
				
				Если НЕ ЗначениеЗаполнено(Элемент.Значение) ИЛИ Элемент.Значение = "0" Тогда
					МассивУдалить.Добавить(Элемент.Ключ);
				КонецЕсли; 
				
			ИначеЕсли ТипЗначения = Тип("Массив") Тогда 
				
				УдалитьНеЗаполненныеПараметры(Элемент.Значение);	
			КонецЕсли;	
		КонецЦикла;
		
		Для каждого Ключ Из МассивУдалить Цикл
			КоллекцияПараметров.Удалить(Ключ);
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры  

Процедура Бектест_АлгоОрдер_УстановитьСтатусОтменен(ПараметрыОперацииБиржи)
	
	Для каждого СтруктураПараметров Из ПараметрыОперацииБиржи Цикл
		
		АлгоОрдер = Документы.big_AlgoOrders_OKX.НайтиПоРеквизиту("algoId", СтруктураПараметров.algoId);
		ОрдерОбъект = АлгоОрдер.ПолучитьОбъект();
		ОрдерОбъект.state = "canceled";
		ОрдерОбъект.Статус = Перечисления.big_СтатусыТорговыхОбъектов.Отменен;
		ОрдерОбъект.Записать(РежимЗаписиДокумента.Проведение);
	КонецЦикла;
		
КонецПроцедуры

Процедура ПолучитьДанныеБиржиОбОрдере(ПараметрыОперацииБиржи, Аккаунт)
	
	ПараметрыАктуализироватьОрдер = биг_ОКХ_КлиентСервер.СтруктураЗапроса_АктуализироватьОрдер();
	ПараметрыАктуализироватьОрдер.clOrdId 	= ПараметрыОперацииБиржи.clOrdId;
	ПараметрыАктуализироватьОрдер.instId 	= ПараметрыОперацииБиржи.instId;
	
	АктуализироватьОрдер(ПараметрыАктуализироватьОрдер, Аккаунт);
	
	Для каждого Структура Из ПараметрыОперацииБиржи.attachAlgoOrds Цикл
		
		ПараметрыАктуализироватьАлгоОрдер = биг_ОКХ_КлиентСервер.СтруктураЗапроса_АктуализироватьАлгоОрдер();
		ПараметрыАктуализироватьАлгоОрдер.algoClOrdId = Структура.attachAlgoClOrdId;
		
		АктуализироватьАлгоОрдер(ПараметрыАктуализироватьАлгоОрдер, Аккаунт);
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьЗначенияСвечиПоТочкеСПодборомФрейма(ИнструментИД, ТаймСтамп, Бар) Экспорт
	
	ПараметрыЗапроса 	= биг_ОбщегоНазначения.ПолучитьСтруктуруПараметровЗапросаДанныхПоСвечам();
	ПараметрыЗапроса.Биржа          = биг_ОбщегоНазначенияКлиентСервер.ПолучитьЗначениеПоИмени("OKX");
	ПараметрыЗапроса.ИнструментИД   = ИнструментИД;
	ПараметрыЗапроса.Бар 			= Бар;
	
	ПараметрыЗапроса.ТочкаВремениТС_ЗавершениеПериода 	= ТаймСтамп;
	ПараметрыЗапроса.СортировкаПоУбыванию				= Истина;
	ПараметрыЗапроса.КоличествоСвечей					= 1;
	ПараметрыЗапроса.ОграничениеПериода                 = ТаймСтамп;
	
	ЦенаЗакрытия = ПолучитьЦенуЗакрытияРекурсивно(ПараметрыЗапроса);
	
	Возврат ЦенаЗакрытия;
	
КонецФункции

Функция ПолучитьЦенуЗакрытияРекурсивно(ПараметрыЗапроса)
	
	ДанныеСвечей = биг_ОбщегоНазначения.ПолучитьДанныеСвечейПоТочке(ПараметрыЗапроса);
	
	Если ДанныеСвечей.Количество() = 0 Тогда
		
		СтаршийБар = биг_ОбщегоНазначения.НайтиСтаршийФрейм(ПараметрыЗапроса.Бар);
		Если СтаршийБар = Неопределено Тогда
			Возврат Неопределено;
		Иначе
			ПараметрыЗапроса.Бар = СтаршийБар;
			Возврат ПолучитьЦенуЗакрытияРекурсивно(ПараметрыЗапроса)
		КонецЕсли;
		
	Иначе
		Возврат ДанныеСвечей[0].ЦенаЗакрытия;	
	КонецЕсли;	
	
КонецФункции

Процедура ЗаписатьДанныеАлгоордераВИсторию(ПараметрыОперацииБиржи)
	
	Если ПараметрыОперацииБиржи.Свойство("algoClOrdId") Тогда
		УидБезРазделителей = ПараметрыОперацииБиржи.algoClOrdId;
	Иначе
		УидБезРазделителей = ПараметрыОперацииБиржи.КлиентАлгоОрдерИД;	
	КонецЕсли;
	
	УИДСтрока	= биг_ОбщегоНазначенияКлиентСервер.ДополнитьUUIDразделителями(УидБезРазделителей);
	УИД 		= Новый УникальныйИдентификатор(УИДСтрока);
	Ссылка 		= Документы.big_AlgoOrders_OKX.ПолучитьСсылку(УИД);
	
	РеквизитыДокумента = "tpTriggerPx, tpOrdPx, sz, slTriggerPx, slOrdPx, uTime, cTime";
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, РеквизитыДокумента);
	
	Запись 				= РегистрыСведений.биг_ОКХ_ИсторияАлгоОрдеров.СоздатьМенеджерЗаписи();
	
	Если ЗначениеЗаполнено(ЗначенияРеквизитов.uTime) Тогда		
		Строка13		= Формат(ЗначенияРеквизитов.uTime, "ЧГ=0");		
	Иначе		
		Строка13		= Формат(ЗначенияРеквизитов.cTime, "ЧГ=0");	
	КонецЕсли;

	Если ЗначениеЗаполнено(Строка13) Тогда
		Запись.Период 	= биг_ОбщегоНазначенияКлиентСервер.TimestampВДату(Лев(Строка13, 10));
	Иначе
		Запись.Период 	= ТекущаяДатаСеанса();	
	КонецЕсли;
	
	Запись.Документ		= Ссылка;
	Запись.tpTriggerPx	= ЗначенияРеквизитов.tpTriggerPx;
	Запись.tpOrdPx		= ЗначенияРеквизитов.tpOrdPx;
	Запись.sz			= ЗначенияРеквизитов.sz;
	Запись.slTriggerPx	= ЗначенияРеквизитов.slTriggerPx;
	Запись.slOrdPx		= ЗначенияРеквизитов.slOrdPx;
	
	Запись.Записать(Истина);
	
КонецПроцедуры

Функция ПересчитатьВКонтракты(РазмерОрдера, Инструмент) Экспорт

	РазмерКонтракта 	= биг_ОбщегоНазначенияКлиентСервер.ЗначениеРеквизитаОбъекта(Инструмент, "ctVal");
	МножительКонтракта 	= биг_ОбщегоНазначенияКлиентСервер.ЗначениеРеквизитаОбъекта(Инструмент, "ctMult");
	
	Если ЗначениеЗаполнено(РазмерКонтракта) И РазмерКонтракта > 0 Тогда
		РазмерОрдера = РазмерОрдера / РазмерКонтракта / МножительКонтракта;
	КонецЕсли;
	
	Возврат РазмерОрдера;
КонецФункции

#КонецОбласти //Служебные


#Область Данные

Функция ПолучитьКлючевыеДанныеОперации(ДокументОперации) Экспорт
	
	СтруктураОтвета 	= биг_МаркетАпиКлиентСервер.СтруктураОсновныхДанныхОперации();
	
	СтрокаРеквизитов 	= "Аккаунт, instId, sz, fillSz, px, fillPx, fee, pnl";
	ЗначенияОперации 	= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОперации, СтрокаРеквизитов);
	
	СтруктураОтвета.Биржа			= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗначенияОперации.Аккаунт, "Владелец");
	СтруктураОтвета.Аккаунт			= ЗначенияОперации.Аккаунт;
	СтруктураОтвета.ИнструментИД	= ЗначенияОперации.instId;
	СтруктураОтвета.Размер			= ЗначенияОперации.sz;
	СтруктураОтвета.РазмерЗаполнено	= ЗначенияОперации.fillSz;
	СтруктураОтвета.Цена			= ЗначенияОперации.px;
	СтруктураОтвета.ЦенаЗаполнено	= ЗначенияОперации.fillPx;
	СтруктураОтвета.Сумма			= ?(СтруктураОтвета.РазмерЗаполнено > 0, СтруктураОтвета.РазмерЗаполнено, СтруктураОтвета.Размер) * ?(СтруктураОтвета.ЦенаЗаполнено > 0, СтруктураОтвета.ЦенаЗаполнено, СтруктураОтвета.Цена);
	СтруктураОтвета.Комиссия		= ЗначенияОперации.fee;
	СтруктураОтвета.ПрофитУбыток	= ЗначенияОперации.pnl;
	
	Возврат СтруктураОтвета;
	
КонецФункции

Функция Биржа() Экспорт
	
	Возврат РегистрыСведений.биг_ПредопределенныеЭлементы.ПолучитьЗначениеПоИмени("OKX");
		
КонецФункции


#КонецОбласти //Данные


#Область Бектест

Процедура СоздатьДокумент_Ордер_Бектест(ПараметрыОперации, Ордер, ТаймСтамп)
	
	Если ЗначениеЗаполнено(ТаймСтамп) Тогда
		Ордер.Дата 	= биг_ОбщегоНазначенияКлиентСервер.TimestampВДату(ТаймСтамп);
		Ордер.cTime	= ТаймСтамп;
	КонецЕсли;
	
	// т.к. ордер реально на биржу отправляться не будет, то делаем вид, будто он успешно выполнен
	Ордер.state 	= "filled";
	Ордер.fillTime	= ТаймСтамп * 1000;
	
	Ордер.fillSz 	= ПараметрыОперации.РазмерОрдера;
	
	Если ПараметрыОперации.ОрдерТип = Перечисления.big_OKX_OrderTypes.market Тогда
		
		// цена маркет-ордера должна определяться биржей в момент обработки, поэтому в рамках бектеста берем
		// цену закрытия предыдущей свечи (ну или можно грузить регулярные                           
		Бар				= Справочники.big_BarTypes.H1;
		Ордер.fillPx 	= ПолучитьЗначенияСвечиПоТочкеСПодборомФрейма(ПараметрыОперации.ИнструментИД, ТаймСтамп, Бар);
		//Ордер.fillPx	= Окр(Ордер.fillPx * 0.9999, 2);
	Иначе
		Ордер.fillPx	= ПараметрыОперации.ЦенаОрдера;	
	КонецЕсли;

	Ордер.px = Ордер.fillPx;
	Ордер.sz = Ордер.fillSz;
	
	Если ПараметрыОперации.ИнструментТип = Перечисления.big_OKX_InstrumentType.MARGIN Тогда
		
		Ордер_Бектест_Маржинальный(Ордер, ПараметрыОперации);
		
	ИначеЕсли ПараметрыОперации.ИнструментТип = Перечисления.big_OKX_InstrumentType.SWAP Тогда	
		
		Ордер_Бектест_Своп(Ордер, ПараметрыОперации); // в интерактиве почему то это Фьючерс
		
	ИначеЕсли ПараметрыОперации.ИнструментТип = Перечисления.big_OKX_InstrumentType.SPOT Тогда	
		
		Ордер_Бектест_Спот(Ордер, ПараметрыОперации);
	КонецЕсли;
	    	
КонецПроцедуры  

Процедура СоздатьДокумент_АлгоОрдер_Бектест(ПараметрыОперации, АлгоОрдер, ТаймСтамп)

	АлгоОрдер.Дата 	= биг_ОбщегоНазначенияКлиентСервер.TimestampВДату(ТаймСтамп);
	АлгоОрдер.cTime	= ТаймСтамп;
		
КонецПроцедуры


Процедура Ордер_Бектест_Маржинальный(Ордер, ПараметрыОперации)
	
	Сообщить("Обработчик для бектеста спот-ордеров не реализован");
	
	//Ордер.state 	= "filled";
	//Ордер.fillSz 	= ПараметрыОперации.sz;
	//Ордер.fillPx	= ПараметрыОперации.px;
	//
	//Ордер.fillPx 	= ПолучитьЗначенияСвечиПоТочке(ПараметрыОперации.ИнструментИД, ТаймСтамп);
	//
	//Если ПараметрыОперации.side = "buy" Тогда			
	//	
	//	Ордер.fillSz 	= ПараметрыОперации.sz / Ордер.fillPx; 
	//	Ордер.fee		= Ордер.fillSz / 100 * 0.1 * -1;
	//	
	//Иначе // ПараметрыОперации.side = "sell"
	//	
	//	Ордер.fillSz 	= ПараметрыОперации.sz * Ордер.fillPx;
	//	Ордер.fee		= Ордер.fillSz / 100 * 0.1 * -1;
	//КонецЕсли;
	
КонецПроцедуры

Процедура Ордер_Бектест_Своп(Ордер, ПараметрыОперации)
	
	ПроцентКомиссии	= 0.05; //DI_HARD (куда то в справочник биржи нужно настройко разместить)
	Ордер.fillSz 	= ПараметрыОперации.РазмерОрдера;
	
	Инструмент		= Справочники.big_Instruments.НайтиПоРеквизиту("instId", Ордер.instId);
	Ордер.fee		= ПараметрыОперации.РазмерОрдера * Инструмент.ctVal * Ордер.fillPx / 100 * ПроцентКомиссии * -1;  
	
	Ордер.feeCcy	= Справочники.big_Currencys.НайтиПоНаименованию("USDT", Истина);
	//Ордер.ccy		= Справочники.big_Currencys.НайтиПоНаименованию("BTC", 	Истина);
	
КонецПроцедуры

Процедура Ордер_Бектест_Спот(Ордер, ПараметрыОперации)

	Сообщить("Обработчик для бектеста спот-ордеров не реализован");
	
КонецПроцедуры

Процедура Ордер_Бектест_ВычислитьPnL(ДокументОперации) Экспорт
	
	// получить:
	// - среднюю цену покупки сигнала (себес)
	// - размер комиссий закупки
	// - размер комиссий продажи
	// ПрофитУбыток = Сумма продажи - Цена закупа - Комисси
	
	Инструмент			= Справочники.big_Instruments.НайтиПоРеквизиту("instId", ДокументОперации.instId);       	
	ОбъектДокумента 	= ДокументОперации.ПолучитьОбъект();
	
	ОбъемПродажи 		= ОбъектДокумента.fillSz * Инструмент.ctVal;
	ЦенаПродажи 		= ОбъектДокумента.fillPx;
	Комиссия			= ОбъектДокумента.fee;
	ТекущийПрофитУбыток = ВычислитьПрофитУбытокСигналаПоОрдеруСигнала(ДокументОперации, Истина); 
		
	Если ОбъектДокумента.Событие = Перечисления.биг_ДаблИмпактEvents.ВыполнениеСтопЛосс 
		И ОбъектДокумента.side = Перечисления.big_OKX_OrderSides.sell Тогда
		
		ПрофитУбыток 		= (ОбъемПродажи * ЦенаПродажи) + Комиссия + ТекущийПрофитУбыток;
	ИначеЕсли ОбъектДокумента.Событие = Перечисления.биг_ДаблИмпактEvents.ВыполнениеСтопЛосс 
		И ОбъектДокумента.side = Перечисления.big_OKX_OrderSides.buy Тогда
		
		ПрофитУбыток 		= (ОбъемПродажи * ЦенаПродажи * -1) + Комиссия + ТекущийПрофитУбыток;
	КонецЕсли;
		
	ОбъектДокумента.pnl = ПрофитУбыток;
	ОбъектДокумента.Записать(РежимЗаписиДокумента.Проведение);
		
КонецПроцедуры 

Функция ВычислитьПрофитУбытокСигналаПоордеруСигнала(Операция, ИсключаяСтопЛосс = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	биг_ДаблИмпактОперации.Операция.fillPx КАК px,
	|	биг_ДаблИмпактОперации.Операция.fillSz КАК sz,
	|	ВЫБОР
	|		КОГДА биг_ДаблИмпактОперации.Операция.side = ЗНАЧЕНИЕ(Перечисление.big_OKX_OrderSides.sell)
	|			ТОГДА биг_ДаблИмпактОперации.Операция.fillSz * биг_ДаблИмпактОперации.Операция.fillPx * big_Instruments.ctVal
	|		ИНАЧЕ биг_ДаблИмпактОперации.Операция.fillSz * биг_ДаблИмпактОперации.Операция.fillPx * big_Instruments.ctVal * -1
	|	КОНЕЦ КАК sum,
	|	биг_ДаблИмпактОперации.Операция.fee КАК fee
	|ПОМЕСТИТЬ ВТ_ОперацииСигнала
	|ИЗ
	|	РегистрСведений.биг_ДаблИмпактОперации КАК биг_ДаблИмпактОперации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.big_Instruments КАК big_Instruments
	|		ПО биг_ДаблИмпактОперации.ИнструментИД = big_Instruments.instId
	|ГДЕ
	|	биг_ДаблИмпактОперации.Биржа = &Биржа
	|	И биг_ДаблИмпактОперации.ИнструментИД = &ИнструментИД
	|	И биг_ДаблИмпактОперации.ТочкаНачалаПадения = &ТочкаНачалаПадения
	|	И биг_ДаблИмпактОперации.Аккаунт = &Аккаунт
	|	И биг_ДаблИмпактОперации.Событие В(&СобытияПокупки)
	|	И (ВЫРАЗИТЬ(биг_ДаблИмпактОперации.Операция КАК Документ.big_Order_OKX)) <> ЗНАЧЕНИЕ(Документ.big_Order_OKX.ПустаяСсылка)
	|	И биг_ДаблИмпактОперации.НастройкаСтратегии = &НастройкаСтратегии
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	биг_ДаблИмпактОперации.Операция.fillPx,
	|	биг_ДаблИмпактОперации.Операция.fillSz,
	|	ВЫБОР
	|		КОГДА биг_ДаблИмпактОперации.Операция.side = ЗНАЧЕНИЕ(Перечисление.big_OKX_OrderSides.sell)
	|			ТОГДА биг_ДаблИмпактОперации.Операция.fillSz * биг_ДаблИмпактОперации.Операция.fillPx * big_Instruments.ctVal * -1
	|		ИНАЧЕ биг_ДаблИмпактОперации.Операция.fillSz * биг_ДаблИмпактОперации.Операция.fillPx * big_Instruments.ctVal
	|	КОНЕЦ,
	|	биг_ДаблИмпактОперации.Операция.fee
	|ИЗ
	|	РегистрСведений.биг_ДаблИмпактОперации КАК биг_ДаблИмпактОперации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.big_Instruments КАК big_Instruments
	|		ПО биг_ДаблИмпактОперации.НастройкаСтратегии = big_Instruments.instId
	|ГДЕ
	|	биг_ДаблИмпактОперации.Биржа = &Биржа
	|	И биг_ДаблИмпактОперации.ИнструментИД = &ИнструментИД
	|	И биг_ДаблИмпактОперации.ТочкаНачалаПадения = &ТочкаНачалаПадения
	|	И биг_ДаблИмпактОперации.Аккаунт = &Аккаунт
	|	И биг_ДаблИмпактОперации.Событие = &СобытиеПродажи
	|	И (ВЫРАЗИТЬ(биг_ДаблИмпактОперации.Операция КАК Документ.big_Order_OKX)) <> ЗНАЧЕНИЕ(Документ.big_Order_OKX.ПустаяСсылка)
	|	И НЕ &ИсключаяСтопЛосс
	|	И биг_ДаблИмпактОперации.НастройкаСтратегии = &НастройкаСтратегии
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ВТ_ОперацииСигнала.sum) КАК sum,
	|	СУММА(ВТ_ОперацииСигнала.fee) КАК fee
	|ПОМЕСТИТЬ ВТ_Групп
	|ИЗ
	|	ВТ_ОперацииСигнала КАК ВТ_ОперацииСигнала
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Групп.sum КАК sum,
	|	ВТ_Групп.fee КАК fee,
	|	ВТ_Групп.sum + ВТ_Групп.fee КАК pnl
	|ИЗ
	|	ВТ_Групп КАК ВТ_Групп";

	СписокРеквизитов = "Аккаунт, instId, ТочкаНачалаПадения, НастройкаСтратегии";
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Операция, СписокРеквизитов);
	
	Запрос.УстановитьПараметр("Биржа", 				ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗначенияРеквизитов.Аккаунт, "Владелец"));
	Запрос.УстановитьПараметр("ИнструментИД", 		ЗначенияРеквизитов.instId);
	Запрос.УстановитьПараметр("ТочкаНачалаПадения", ЗначенияРеквизитов.ТочкаНачалаПадения);
	Запрос.УстановитьПараметр("Аккаунт", 			ЗначенияРеквизитов.Аккаунт);
	Запрос.УстановитьПараметр("НастройкаСтратегии", ЗначенияРеквизитов.НастройкаСтратегии);
	Запрос.УстановитьПараметр("СобытиеПродажи", 	Перечисления.биг_ДаблИмпактEvents.ВыполнениеСтопЛосс);
	Запрос.УстановитьПараметр("ИсключаяСтопЛосс", 	ИсключаяСтопЛосс);
	
	СобытияПокупки = Новый Массив();
	СобытияПокупки.Добавить(Перечисления.биг_ДаблИмпактEvents.ПоискТочкиВходаОдин);
	СобытияПокупки.Добавить(Перечисления.биг_ДаблИмпактEvents.ПоискТочкиВходаДва);
	СобытияПокупки.Добавить(Перечисления.биг_ДаблИмпактEvents.АИ_ОжиданиеРазворотаТренда);
	СобытияПокупки.Добавить(Перечисления.биг_ДаблИмпактEvents.АИ_ОжиданиеУвеличенияПозиции);
	Запрос.УстановитьПараметр("СобытияПокупки", СобытияПокупки);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Возврат Выборка.pnl;
	
КонецФункции

#КонецОбласти //Бектест