

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Настройка") Тогда
		
		Настройка 		= Параметры.Настройка;
		Код				= Настройка.Код;
		ИмяНастройки 	= Настройка.Наименование;
		Стратегия 		= Настройка.Владелец;
		Бар 			= Настройка.Бар;
		
		ЗаполнитьТаблицуНастроек();
			
	КонецЕсли;
	
	Если Параметры.Свойство("Стратегия") Тогда
		Стратегия = Параметры.Стратегия;
		СтратегияБарПриИзмененииНаСервере();
	КонецЕсли;
	
	Если Параметры.Свойство("Бар") Тогда
		Бар = Параметры.Бар;
		СтратегияБарПриИзмененииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Модифицированность Тогда
		СохранитьТаблицуНастроек();	
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура БарПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СтратегияПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
Процедура СтратегияБарПриИзмененииНаСервере()
	
	ПодобратьНастройку();
	ЗаполнитьТаблицуНастроек();	
	
КонецПроцедуры

&НаСервере
Процедура ИмяНастройкиПриИзмененииНаСервере()
	
	Если ЗначениеЗаполнено(Настройка) Тогда
		
		ОбъектНастройки = Настройка.ПолучитьОбъект();
		ОбъектНастройки.Наименование	= ИмяНастройки;
		ОбъектНастройки.Записать();
		
	Иначе
		Сообщить("Настройка не определена, некуда установить название. Непредвиденная ошибка");
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяНастройкиПриИзменении(Элемент)
	ИмяНастройкиПриИзмененииНаСервере();
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

&НаКлиенте
Процедура ТаблицаНастроекЗначениеПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаСервере
Процедура СохранитьНаСервере()
	СохранитьТаблицуНастроек();
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	СохранитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура НоваяНастройкаНаСервере()
	
	Шаблон 			= "%1 - %2: Новая настройка";
	ИмяНастройки	= СтрШаблон(Шаблон, Стратегия, Бар);
		
	СоздатьНастройкуПоШаблону();	
	ЗагрузитьПустыеПараметры();
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура НоваяНастройка(Команда)
	НоваяНастройкаНаСервере();
КонецПроцедуры

&НаСервере
Процедура КопироватьНаСервере()
	
	ИмяНастройки = ИмяНастройки + " (копия)";
	СоздатьНастройкуПоШаблону();
	СохранитьТаблицуНастроек();
	
КонецПроцедуры

&НаКлиенте
Процедура Копировать(Команда)
	КопироватьНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТаблицуНастроек()
	
	ТаблицаНастроек.Очистить();
	
	Если ЗначениеЗаполнено(Настройка) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	биг_ЗначенияКонтрольныхУровней.КонтрольныйУровень КАК Параметр,
		|	биг_ЗначенияКонтрольныхУровней.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.биг_ЗначенияКонтрольныхУровней КАК биг_ЗначенияКонтрольныхУровней
		|ГДЕ
		|	биг_ЗначенияКонтрольныхУровней.НастройкаСтратегии = &НастройкаСтратегии
		|
		|УПОРЯДОЧИТЬ ПО
		|	биг_ЗначенияКонтрольныхУровней.КонтрольныйУровень.Наименование";
		Запрос.УстановитьПараметр("НастройкаСтратегии", Настройка);
		Выборка = Запрос.Выполнить().Выбрать();
				
		Пока Выборка.Следующий() Цикл
			
			НС = ТаблицаНастроек.Добавить();
			ЗаполнитьЗначенияСвойств(НС, Выборка);
		КонецЦикла; 		
	КонецЕсли;                               
	
КонецПроцедуры

&НаСервере
Процедура СохранитьТаблицуНастроек()
	
	Если ЕстьОшибкиЗаполненияЗначений() Тогда
		Возврат;	
	КонецЕсли;
	
	Набор = РегистрыСведений.биг_ЗначенияКонтрольныхУровней.СоздатьНаборЗаписей();
	Набор.Отбор.НастройкаСтратегии.Установить(Настройка);
	Набор.Очистить();
	
	Для каждого Строка Из ТаблицаНастроек Цикл
		
		НС = Набор.Добавить();
		НС.НастройкаСтратегии 	= Настройка;
		НС.КонтрольныйУровень	= Строка.Параметр;
		НС.Значение				= Строка.Значение;
	КонецЦикла;
	
	Набор.Записать(Истина);
	Модифицированность = Ложь;
	
КонецПроцедуры
	
&НаСервере
Процедура ПодобратьНастройку()
	
	Если ЗначениеЗаполнено(Стратегия) И ЗначениеЗаполнено(Бар) Тогда

		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	биг_КлючиНастроекСтратегии.Ссылка КАК Ссылка,
		|	биг_КлючиНастроекСтратегии.Наименование КАК Наименование
		|ИЗ
		|	Справочник.биг_КлючиНастроекСтратегии КАК биг_КлючиНастроекСтратегии
		|ГДЕ
		|	биг_КлючиНастроекСтратегии.Владелец = &Владелец
		|	И биг_КлючиНастроекСтратегии.Бар = &Бар";
		Запрос.УстановитьПараметр("Бар", Бар);
		Запрос.УстановитьПараметр("Владелец", Стратегия);
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			Настройка 		= Неопределено;
			ИмяНастройки 	= "";
		Иначе
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			
			Настройка 		= Выборка.Ссылка;
			ИмяНастройки	= Выборка.Наименование;
		КонецЕсли;
		
	Иначе
		
		Настройка 		= Неопределено;
		ИмяНастройки 	= "";
	КонецЕсли;                   
	
КонецПроцедуры	

&НаСервере
Процедура ЗагрузитьПустыеПараметры()

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	big_КонтрольныеУровни.Ссылка КАК Параметр
	|ИЗ
	|	Справочник.big_КонтрольныеУровни КАК big_КонтрольныеУровни
	|ГДЕ
	|	big_КонтрольныеУровни.Владелец = &Стратегия
	|	И НЕ big_КонтрольныеУровни.ПометкаУдаления";
	Запрос.УстановитьПараметр("Стратегия", Стратегия);
	
	ТаблицаНастроек.Очистить();
	ТаблицаНастроек.Загрузить(ЗАпрос.Выполнить().Выгрузить());	
	
КонецПроцедуры 

&НаСервере
Процедура СоздатьНастройкуПоШаблону()

	НоваяНастройка = Справочники.биг_КлючиНастроекСтратегии.СоздатьЭлемент();
	НоваяНастройка.Владелец		= Стратегия;
	НоваяНастройка.Бар			= Бар;			
	НоваяНастройка.Наименование = ИмяНастройки;
		
	НоваяНастройка.Записать();
	
	Настройка 		= НоваяНастройка.Ссылка;
	
КонецПроцедуры

&НаСервере
Функция ЕстьОшибкиЗаполненияЗначений()
	
	Ошибка = Ложь;
	
	Для каждого Строка Из ТаблицаНастроек Цикл
		
		Если НЕ ЗначениеЗаполнено(Строка.Значение) Тогда
			
			Ошибка = Истина;
			Сообщить("Не указано значение параметра: " + Строка.Параметр);
		КонецЕсли;
	КонецЦикла; 
	
	Возврат Ошибка;
	
КонецФункции

&НаСервере
Процедура ЗагрузитьИзНаСервере(Результат)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	биг_ЗначенияКонтрольныхУровней.КонтрольныйУровень КАК Параметр,
	|	биг_ЗначенияКонтрольныхУровней.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.биг_ЗначенияКонтрольныхУровней КАК биг_ЗначенияКонтрольныхУровней
	|ГДЕ
	|	биг_ЗначенияКонтрольныхУровней.НастройкаСтратегии = &НастройкаСтратегии
	|
	|УПОРЯДОЧИТЬ ПО
	|	биг_ЗначенияКонтрольныхУровней.КонтрольныйУровень.Наименование";
	Запрос.УстановитьПараметр("НастройкаСтратегии", Результат);
	
	ТаблицаНастроек.Очистить();
	ТаблицаНастроек.Загрузить(Запрос.Выполнить().Выгрузить());	
	
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИз(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ЗавершениеВыбораЗагрузитьИз", ЭтаФорма);
	Ключ = Неопределено;
	ПоказатьВводЗначения(Оповещение, Ключ,, Новый ОписаниеТипов("СправочникСсылка.биг_КлючиНастроекСтратегии")); 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеВыбораЗагрузитьИз(Результат, Доппараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		ЗагрузитьИзНаСервере(Результат);	
	КонецЕсли;	
	
КонецПроцедуры


#КонецОбласти


