
////////////////////////////////////////////////////////////////////////////////
// <Заголовок модуля: краткое описание и условия применения модуля.>
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Процедура СформироватьПланОпераций() Экспорт

	Если НЕ ЗначениеЗаполнено(АккаунтОбразец) Тогда
		Сообщить("Не указан Аккаунт-образец");
		Возврат;		
	КонецЕсли;	
	Если НЕ ЗначениеЗаполнено(ТекущийАккаунт) Тогда
		Сообщить("Не указан Текущий аккаунт");
		Возврат;		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.Account КАК Аккаунт,
	|	биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.ccy КАК Монета,
	|	биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.availBal КАК ДоступноШтук,
	|	биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.frozenBal КАК ЗамороженоШтук,
	|	биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.eqUsd / (биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.availBal + биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.frozenBal) КАК ЦенаМонеты,
	|	биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.eqUsd КАК ОбщаяСтоимостьДанныхМонет,
	|	биг_ОКХ_БаллансАккаунтовСрезПоследних.totalEq КАК ОбщаяСтоимостьАккаунта,
	|	big_Instruments.Ссылка КАК Инструмент,
	|	биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.eqUsd / биг_ОКХ_БаллансАккаунтовСрезПоследних.totalEq * 100 КАК ДоляВПортфеле
	|ПОМЕСТИТЬ ВТ_Образец
	|ИЗ
	|	РегистрСведений.биг_ОКХ_БаллансАккаунтовДетали.СрезПоследних(, Account = &АккаунтОбразец) КАК биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.биг_ОКХ_БаллансАккаунтов.СрезПоследних КАК биг_ОКХ_БаллансАккаунтовСрезПоследних
	|		ПО биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.Account = биг_ОКХ_БаллансАккаунтовСрезПоследних.Account
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.big_Instruments КАК big_Instruments
	|		ПО (big_Instruments.baseCcy = биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.ccy)
	|			И (big_Instruments.quoteCcy = &МонетаУчетаПортфеля)
	|ГДЕ
	|	big_Instruments.instType = &ТипИнструмента
	|	И биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.eqUsd > 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.Account КАК Аккаунт,
	|	биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.ccy КАК Монета,
	|	биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.availBal КАК ДоступноШтук,
	|	биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.frozenBal КАК ЗамороженоШтук,
	|	биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.eqUsd / (биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.availBal + биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.frozenBal) КАК ЦенаМонеты,
	|	биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.eqUsd КАК ОбщаяСтоимостьДанныхМонет,
	|	биг_ОКХ_БаллансАккаунтовСрезПоследних.totalEq КАК ОбщаяСтоимостьАккаунта,
	|	big_Instruments.Ссылка КАК Инструмент,
	|	биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.eqUsd / биг_ОКХ_БаллансАккаунтовСрезПоследних.totalEq * 100 КАК ДоляВПортфеле
	|ПОМЕСТИТЬ ВТ_Текущий
	|ИЗ
	|	РегистрСведений.биг_ОКХ_БаллансАккаунтовДетали.СрезПоследних(, Account = &ТекущийАккаунт) КАК биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.биг_ОКХ_БаллансАккаунтов.СрезПоследних КАК биг_ОКХ_БаллансАккаунтовСрезПоследних
	|		ПО биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.Account = биг_ОКХ_БаллансАккаунтовСрезПоследних.Account
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.big_Instruments КАК big_Instruments
	|		ПО (big_Instruments.baseCcy = биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.ccy)
	|			И (big_Instruments.quoteCcy = &МонетаУчетаПортфеля)
	|ГДЕ
	|	big_Instruments.instType = &ТипИнструмента
	|	И биг_ОКХ_БаллансАккаунтовДеталиСрезПоследних.eqUsd > 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Образец.Монета КАК Монета,
	|	ВТ_Образец.Инструмент КАК Инструмент,
	|	ВТ_Текущий.ОбщаяСтоимостьАккаунта КАК ОбщаяСтоимостьАккаунта
	|ПОМЕСТИТЬ ВТ_Уник
	|ИЗ
	|	ВТ_Образец КАК ВТ_Образец
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Текущий КАК ВТ_Текущий
	|		ПО (ИСТИНА)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТ_Текущий.Монета,
	|	ВТ_Текущий.Инструмент,
	|	ВТ_Текущий.ОбщаяСтоимостьАккаунта
	|ИЗ
	|	ВТ_Текущий КАК ВТ_Текущий
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Уник.Монета КАК Монета,
	|	ВТ_Уник.Инструмент КАК Инструмент,
	|	ВТ_Текущий.ДоступноШтук КАК ТекущееКоличество,
	|	ВТ_Текущий.ЗамороженоШтук КАК Заморожено,
	|	ЕСТЬNULL(ВТ_Текущий.ДоляВПортфеле, 0) КАК ТекущаяДоля,
	|	ЕСТЬNULL(ВТ_Образец.ДоляВПортфеле, 0) КАК ЦелеваяДоля,
	|	ВТ_Текущий.ОбщаяСтоимостьДанныхМонет КАК ОбщаяСтоимостьДанныхМонет,
	|	ВТ_Уник.ОбщаяСтоимостьАккаунта КАК ОбщаяСтоимостьАккаунта,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_Текущий.ДоляВПортфеле, 0) < ЕСТЬNULL(ВТ_Образец.ДоляВПортфеле, 0)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.big_OKX_OrderSides.Buy)
	|		КОГДА ЕСТЬNULL(ВТ_Текущий.ДоляВПортфеле, 0) > ЕСТЬNULL(ВТ_Образец.ДоляВПортфеле, 0)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.big_OKX_OrderSides.Sell)
	|	КОНЕЦ КАК ВидОперации,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ВТ_Текущий.ДоляВПортфеле, 0) < ЕСТЬNULL(ВТ_Образец.ДоляВПортфеле, 0)
	|			ТОГДА ВТ_Уник.ОбщаяСтоимостьАккаунта / 100 * (ЕСТЬNULL(ВТ_Образец.ДоляВПортфеле, 0) - ЕСТЬNULL(ВТ_Текущий.ДоляВПортфеле, 0))
	|		КОГДА ЕСТЬNULL(ВТ_Текущий.ДоляВПортфеле, 0) > ЕСТЬNULL(ВТ_Образец.ДоляВПортфеле, 0)
	|			ТОГДА ВТ_Уник.ОбщаяСтоимостьАккаунта / 100 * (ЕСТЬNULL(ВТ_Текущий.ДоляВПортфеле, 0) - ЕСТЬNULL(ВТ_Образец.ДоляВПортфеле, 0))
	|	КОНЕЦ КАК СуммаОперации
	|ПОМЕСТИТЬ ВременнаяТаблица
	|ИЗ
	|	ВТ_Уник КАК ВТ_Уник
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Образец КАК ВТ_Образец
	|		ПО ВТ_Уник.Монета = ВТ_Образец.Монета
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Текущий КАК ВТ_Текущий
	|		ПО ВТ_Уник.Монета = ВТ_Текущий.Монета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблица.Монета КАК Монета,
	|	ВременнаяТаблица.Инструмент КАК Инструмент,
	|	ВременнаяТаблица.ТекущееКоличество КАК ТекущееКоличество,
	|	ВременнаяТаблица.Заморожено КАК Заморожено,
	|	ВременнаяТаблица.ТекущаяДоля КАК ТекущаяДоля,
	|	ВременнаяТаблица.ЦелеваяДоля КАК ЦелеваяДоля,
	|	ВременнаяТаблица.ОбщаяСтоимостьДанныхМонет КАК ОбщаяСтоимостьДанныхМонет,
	|	ВременнаяТаблица.ОбщаяСтоимостьАккаунта КАК ОбщаяСтоимостьАккаунта,
	|	ВременнаяТаблица.ВидОперации КАК ВидОперации,
	|	ВременнаяТаблица.СуммаОперации КАК СуммаОперации
	|ИЗ
	|	ВременнаяТаблица КАК ВременнаяТаблица
	|ГДЕ
	|	(ВременнаяТаблица.ЦелеваяДоля = 0
	|				И ВременнаяТаблица.ТекущаяДоля <> 0
	|			ИЛИ ВЫБОР
	|				КОГДА ВременнаяТаблица.ТекущаяДоля < ВременнаяТаблица.ЦелеваяДоля
	|					ТОГДА ВременнаяТаблица.ОбщаяСтоимостьАккаунта / 100 * (ВременнаяТаблица.ЦелеваяДоля - ВременнаяТаблица.ТекущаяДоля)
	|				КОГДА ВременнаяТаблица.ТекущаяДоля > ВременнаяТаблица.ЦелеваяДоля
	|					ТОГДА ВременнаяТаблица.ОбщаяСтоимостьАккаунта / 100 * (ВременнаяТаблица.ТекущаяДоля - ВременнаяТаблица.ЦелеваяДоля)
	|			КОНЕЦ / ВременнаяТаблица.ОбщаяСтоимостьАккаунта * 100 > 1)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидОперации УБЫВ";
	
	Запрос.УстановитьПараметр("МонетаУчетаПортфеля", 	МонетаУчетаПортфеля);
	Запрос.УстановитьПараметр("ТипИнструмента", 		ТипИнструмента);
	Запрос.УстановитьПараметр("ТекущийАккаунт", 		ТекущийАккаунт);
	Запрос.УстановитьПараметр("АккаунтОбразец", 		АккаунтОбразец);
	
	Выборка = Запрос.Выполнить().Выбрать();
	ПланОпераций.Очистить();
	
	Пока Выборка.Следующий() Цикл
		НС = ПланОпераций.Добавить();
		ЗаполнитьЗначенияСвойств(НС, Выборка);		
	КонецЦикла;	
	
КонецПроцедуры

Процедура ВыровнятьСостав() Экспорт
	
	Если ПланОпераций.Количество() > 0 Тогда
		Если ПроверкаЗамороженныхСредств() Тогда		
			Для каждого Строка Из ПланОпераций Цикл		
				
				СтруктураОперации = биг_МаркетАпиКлиентСервер.СтруктураОперации_СоздатьОрдер();
				СтруктураОперации.Биржа			= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущийАккаунт, "Владелец");
				СтруктураОперации.Аккаунт		= ТекущийАккаунт;
				СтруктураОперации.ОрдерСторона	= Строка.ВидОперации;
				СтруктураОперации.ОрдерТип		= Перечисления.big_OKX_OrderTypes.market;
				СтруктураОперации.ИнструментТип	= ТипИнструмента;
				СтруктураОперации.ИнструментИД 	= биг_ОбщегоНазначенияКлиентСервер.ЗначениеРеквизитаОбъекта(Строка.Инструмент, "instId");
				СтруктураОперации.РежимТорговли	= Перечисления.big_OKX_tdModes.cash;
				
				Кратность 						= биг_ОбщегоНазначенияКлиентСервер.ЗначениеРеквизитаОбъекта(Строка.Инструмент, "lotSz");
				
				Если Строка.ВидОперации = Перечисления.big_OKX_OrderSides.sell Тогда
					
					Если Строка.ЦелеваяДоля = 0 Тогда
						РазмерОрдера 			= Строка.ТекущееКоличество;					
					Иначе					
						Цена 					= ПолучитьТекущуюЦену(СтруктураОперации.ИнструментИД, ТекущийАккаунт);
						РазмерОрдера			= Строка.СуммаОперации;
						РазмерОрдера			= Строка.СуммаОперации / Цена;
						РазмерОрдера			= биг_ОКХ_Сервер.ПересчитатьВКонтракты(РазмерОрдера, Строка.Инструмент);		
						РазмерОрдера 			= биг_ОбщегоНазначенияКлиентСервер.ОкруглитьКратно(РазмерОрдера, Кратность);
					КонецЕсли;
					
				КонецЕсли;
				
				Если Строка.ВидОперации = Перечисления.big_OKX_OrderSides.buy Тогда 
					
					//Цена 						= ПолучитьТекущуюЦену(СтруктураОперации.ИнструментИД, ТекущийАккаунт);
					РазмерОрдера				= Строка.СуммаОперации;
					//РазмерОрдера				= Строка.СуммаОперации / Цена;
					//РазмерОрдера				= биг_ОКХ_Сервер.ПересчитатьВКонтракты(РазмерОрдера, Строка.Инструмент);		
					//РазмерОрдера 				= биг_ОбщегоНазначенияКлиентСервер.ОкруглитьКратно(РазмерОрдера, Кратность);
				КонецЕсли;			
				
				СтруктураОперации.РазмерОрдера	= РазмерОрдера;			
				Строка.Успешно					= биг_МаркетАпи.СоздатьОрдер(, СтруктураОперации);
			КонецЦикла;
			
			СтруктураОперации = биг_МаркетАпиКлиентСервер.СтруктураОперации_ОбновитьБаллансСчета();
			СтруктураОперации.Биржа 			= СтруктураОперации.Биржа;
			СтруктураОперации.Аккаунт 			= ТекущийАккаунт;
			
			биг_МаркетАпи.ОбновитьБаллансСчета(ТекущийАккаунт, СтруктураОперации);
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

Функция ПроверкаЗамороженныхСредств()
	
	// TODO: нужно находить по этим монетам все ордера/позиции и закрывать/отменять их
	// не забыть предуредить управляющего и спросить "Мы закрываем все ордера?" Если нет, то отбой
	
	НетЗамороженных = Истина;
	Для каждого Строка Из ПланОпераций Цикл
		Если Строка.Заморожено > 0 Тогда
			НетЗамороженных = Ложь;
			Сообщить("На аккаунте есть замороженные средства, требуется сперва отменить все ордера и позиции");
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат НетЗамороженных;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиПроведения

#КонецОбласти

#Область ОбработчикиСобытий

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьТекущуюЦену(ИнструментИД, Аккаунт)
	
	СтруктураОперации = биг_МаркетАпиКлиентСервер.СтруктураОперации_ПолучитьЦену();
	СтруктураОперации.Биржа			= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Аккаунт, "Владелец");
	СтруктураОперации.ИнструментТип	= ТипИнструмента;
	СтруктураОперации.ИнструментИД	= ИнструментИД;
	
	Цена = биг_МаркетАпи.ПолучитьЦенуТикета(СтруктураОперации);
	Возврат Цена;
		
КонецФункции

#КонецОбласти


