
#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьПоНастройке(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ЗаполнитьПоНастройкеЗавершение", ЭтаФорма);
	Настройка = Неопределено;
	ПоказатьВводЗначения(Оповещение, Настройка, "Выберите настройку", Тип("СправочникСсылка.биг_КлючиНастроекСтратегии"));
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоНастройкеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		ВладелецНастройки = ВладелецНастройкиНаСервере(Результат);
		Если ВладелецНастройки = Объект.Стратегия Тогда
			ЗаполнитьКонтрольныеУровниПоНастройке(Результат);
		Иначе
			Сообщить("Необходимо выбрать настройку от стратегии: " + Объект.Стратегия);
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьНастройки(Команда)
	
	СформироатьНастройкиНаСервере();
	Сообщить("Выполнено");	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ВладелецНастройкиНаСервере(Результат)
	
	Возврат Результат.Владелец;
	
КонецФункции


&НаСервере
Процедура ЗаполнитьКонтрольныеУровниПоНастройке(Результат)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	биг_ЗначенияКонтрольныхУровней.КонтрольныйУровень КАК КонтрольныйУровень,
	|	биг_ЗначенияКонтрольныхУровней.Значение КАК ТекущееЗначение,
	|	биг_ЗначенияКонтрольныхУровней.КонтрольныйУровень.КраткоеПредставление КАК КраткоеПредставление
	|ИЗ
	|	РегистрСведений.биг_ЗначенияКонтрольныхУровней КАК биг_ЗначенияКонтрольныхУровней
	|ГДЕ
	|	биг_ЗначенияКонтрольныхУровней.НастройкаСтратегии = &НастройкаСтратегии
	|
	|УПОРЯДОЧИТЬ ПО
	|	биг_ЗначенияКонтрольныхУровней.КонтрольныйУровень.Наименование";
	Запрос.УстановитьПараметр("НастройкаСтратегии", Результат);
	Таблица = Запрос.Выполнить().Выгрузить();
	
	Объект.ЗначенияКонтрольныхУровней.Очистить();
	Объект.ЗначенияКонтрольныхУровней.Загрузить(Таблица);		
	
КонецПроцедуры

&НаСервере
Процедура СформироатьНастройкиНаСервере()
	
	ПеремОбъект = РеквизитФормыВЗначение("Объект");
	ПеремОбъект.СформироватьКомбинации();
	
КонецПроцедуры


&НаКлиенте
Процедура ЗначенияКонтрольныхУровнейЗначениеМинимумПриИзменении(Элемент)
	ПересчитатьКоличествоВариантовВСтроке();
КонецПроцедуры

&НаКлиенте
Процедура ЗначенияКонтрольныхУровнейЗначениеМаксимумПриИзменении(Элемент)
	ПересчитатьКоличествоВариантовВСтроке();
КонецПроцедуры

&НаКлиенте
Процедура ЗначенияКонтрольныхУровнейЗначениеШагНастройкиПриИзменении(Элемент)
	ПересчитатьКоличествоВариантовВСтроке();
КонецПроцедуры 

&НаКлиенте
Процедура ПересчитатьКоличествоВариантовВСтроке()

	ТекДанные 	= Элементы.ЗначенияКонтрольныхУровней.ТекущиеДанные;
	
	Если НЕ ЗначениеЗаполнено(ТекДанные.ШагНастройки) Тогда
		Возврат;	
	КонецЕсли;
	
	Разница 	= ТекДанные.ЗначениеМаксимум - ТекДанные.ЗначениеМинимум;
	
	Если Разница = 0 Тогда
		ТекДанные.КоличествоВариантов = 1;
	Иначе
		
		ТекДанные.КоличествоВариантов = Цел(Разница / ТекДанные.ШагНастройки) + 1;	
	КонецЕсли;
	
	ПересчитатьОбщееКоличествоВариантов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьОбщееКоличествоВариантов()
	
	ПредыдущеейЗначение = 1;
	
	Для каждого Строка Из Объект.ЗначенияКонтрольныхУровней Цикл
		
		Если ЗначениеЗаполнено(Строка.КоличествоВариантов) Тогда
			
			ВсегоЗначений = ПредыдущеейЗначение * Строка.КоличествоВариантов;
			ПредыдущеейЗначение = ВсегоЗначений;				
		КонецЕсли;
	КонецЦикла;
	
	ВсегоВариантов = ПредыдущеейЗначение;
	
КонецПроцедуры



#КонецОбласти 
 

