#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда		
		
		Возврат;
		
	КонецЕсли;
	
	ЗначениеКонстанты = Константы.ИспользоватьЭлектроннуюПодписьВМоделиСервиса.Получить();
	ДополнительныеСвойства.Вставить("ТекущееЗначение", ЗначениеКонстанты);
			
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда		
		
		Возврат;
		
	КонецЕсли;
	
	Если ДополнительныеСвойства.ТекущееЗначение <> Значение Тогда
		
		ОбновитьПовторноИспользуемыеЗначения();
		
		Если Значение Тогда			
			ЭлектроннаяПодписьВМоделиСервисаПереопределяемый.ПриВключенииСервисаКриптографии();			
		КонецЕсли;
		
	КонецЕсли;
			
КонецПроцедуры

#КонецОбласти

#КонецЕсли