   
Процедура СформироватьКомбинации() Экспорт
	
	ДозаполнитьИСортировать();
	
	КоллекцияКомбинаций = Новый Массив;

    Для Каждого Строка Из ЗначенияКонтрольныхУровней Цикл
        ТекущиеЗначения = Новый Массив;
		
		Сч = 0;
        Если Строка.ШагНастройки > 0 Тогда
            Значение = Строка.ЗначениеМинимум;
            Пока Значение <= Строка.ЗначениеМаксимум Цикл
                ТекущиеЗначения.Добавить(Новый Структура("КонтрольныйУровень, Значение, Номер", Строка.КонтрольныйУровень, Значение));
                Значение = Значение + Строка.ШагНастройки;
				
				Сч = Сч+1;
            КонецЦикла;
        Иначе
            // Если шаг настройки не указан, добавляем текущее значение
            ТекущиеЗначения.Добавить(Новый Структура("КонтрольныйУровень, Значение, Номер", Строка.КонтрольныйУровень, Строка.ТекущееЗначение));
        КонецЕсли;

        КоллекцияКомбинаций.Добавить(ТекущиеЗначения);
    КонецЦикла;

    ИтоговыеКомбинации = Новый Массив;
    СформироватьВсеКомбинации(КоллекцияКомбинаций, ИтоговыеКомбинации, Новый Массив, 0);

    // Выводим или используем ИтоговыеКомбинации по необходимости
	
	ПроверитьСовпадение(ИтоговыеКомбинации);
	
КонецПроцедуры

Процедура СформироватьВсеКомбинации(КоллекцияКомбинаций, ИтоговыеКомбинации, ТекущаяКомбинация, Уровень)
	
	Если Уровень = КоллекцияКомбинаций.Количество() Тогда
        НоваяКомбинация = Новый Массив;
        Для Каждого Элемент Из ТекущаяКомбинация Цикл
            НоваяКомбинация.Добавить(Элемент);
        КонецЦикла;
        ИтоговыеКомбинации.Добавить(НоваяКомбинация);
        Возврат;
    КонецЕсли;

    Для Каждого Пара Из КоллекцияКомбинаций[Уровень] Цикл
        ТекущаяКомбинация.Добавить(Пара);
        СформироватьВсеКомбинации(КоллекцияКомбинаций, ИтоговыеКомбинации, ТекущаяКомбинация, Уровень + 1);
        ТекущаяКомбинация.Удалить(ТекущаяКомбинация.Количество() - 1);
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьСовпадение(ИтоговыеКомбинации)
	
    Для Каждого Комбинация Из ИтоговыеКомбинации Цикл
        Если НЕ ПроверитьКомбинациюВРегистре(Комбинация) Тогда
			
			СоздатьНастройку(Комбинация);			
        КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ПроверитьКомбинациюВРегистре(Комбинация)
	
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |   Регистр.НастройкаСтратегии
    |ИЗ
    |   РегистрСведений.биг_ЗначенияКонтрольныхУровней КАК Регистр
    |ГДЕ
    |   ЛОЖЬ";

    Для Каждого Пара Из Комбинация Цикл
        Запрос.Текст = Запрос.Текст + 
        " ИЛИ (Регистр.КонтрольныйУровень = &КонтрольныйУровень" + Пара.КонтрольныйУровень.Код + 
        " И Регистр.Значение = &Значение" + Пара.КонтрольныйУровень.Код + ")";
        Запрос.УстановитьПараметр("КонтрольныйУровень" + Пара.КонтрольныйУровень.Код, Пара.КонтрольныйУровень);
        Запрос.УстановитьПараметр("Значение" + Пара.КонтрольныйУровень.Код, Пара.Значение);
    КонецЦикла;

    Запрос.Текст = Запрос.Текст + 
    "СГРУППИРОВАТЬ ПО
    |   Регистр.НастройкаСтратегии
    |ИМЕЮЩИЕ
    |   КОЛИЧЕСТВО(Регистр.КонтрольныйУровень) = &КоличествоПар";

    Запрос.УстановитьПараметр("КоличествоПар", Комбинация.Количество());

    Результат = Запрос.Выполнить();
    Возврат Не Результат.Пустой();
	
КонецФункции

Процедура СоздатьНастройку(Комбинация)
		
	НастройкаОбъект = Справочники.биг_КлючиНастроекСтратегии.СоздатьЭлемент();
	НастройкаОбъект.Владелец = Стратегия;
	ЗаполнитьИмяНастройки(НастройкаОбъект, Комбинация);
	НастройкаОбъект.Записать();
	
	Набор = РегистрыСведений.биг_ЗначенияКонтрольныхУровней.СоздатьНаборЗаписей();
	Набор.Отбор.НастройкаСтратегии.Установить(НастройкаОбъект.Ссылка);
	
	Для каждого Пара Из Комбинация Цикл
		НС = НАбор.Добавить();
		НС.НастройкаСтратегии 	= НастройкаОбъект.Ссылка;
		НС.КонтрольныйУровень 	= Пара.КонтрольныйУровень;
		НС.Значение				= Пара.Значение;
	КонецЦикла;
	
	Набор.Записать(Истина);
	
КонецПроцедуры

Процедура ДозаполнитьИСортировать()
	
	Для каждого Строка Из ЗначенияКонтрольныхУровней Цикл
	 	Строка.ПорядокВНазвании = Строка.КонтрольныйУровень.ПорядокВНазвании;
		
		Если Не ЗначениеЗаполнено(Строка.ТекущееЗначение) Тогда
			Строка.ТекущееЗначение = Строка.КонтрольныйУровень.ЗначениеПоУмолчанию;	
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Строка.ЗначениеМинимум) Тогда
			Строка.ЗначениеМинимум = Строка.ТекущееЗначение;
		КонецЕсли;                                          
		
		Если НЕ ЗначениеЗаполнено(Строка.ЗначениеМаксимум) Тогда
			Строка.ЗначениеМаксимум = Строка.ТекущееЗначение;	
		КонецЕсли;
	КонецЦикла;                                                              
	
	ЗначенияКонтрольныхУровней.Сортировать("ПорядокВНазвании");
		
КонецПроцедуры


Функция ЗаполнитьИмяНастройки(Настройка, Комбинация)
	
	НазваниеСтратегии 	= "" + Стратегия + ": ";
	СтрокаОсновных 		= "";
	СтрокаВторичных 	= " (";
	НужнаВторичная 		= Ложь;
	
	Для каждого Элемент Из Комбинация Цикл
		
		КУ = Элемент.КонтрольныйУровень;
		
		Если ЗначениеЗаполнено(КУ.КраткоеПредставление) Тогда
			СтрокаОсновных = СтрокаОсновных + КУ.КраткоеПредставление + "=" + Элемент.Значение + "; ";				
		Иначе				
			
			Если КУ.ЗначениеПоУмолчанию <> Элемент.Значение Тогда
				СтрокаВторичных = СтрокаВторичных + КУ.Код + "=" + Элемент.Значение + ";";
				НужнаВторичная 	= Истина;
			КонецЕсли;								
		КонецЕсли;	
	КонецЦикла;
		
	СтрокаВторичных 				= СтрокаВторичных + ")";
	
	Настройка.Наименование 			= НазваниеСтратегии + СтрокаОсновных + ?(НужнаВторичная, СтрокаВторичных, "");
	Настройка.НаименованиеПолное 	= НазваниеСтратегии + СтрокаОсновных + ?(НужнаВторичная, СтрокаВторичных, ""); 
		
КонецФункции

