
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НС = Объект.ИсходныеДанные.Добавить();
	НС.ИнструментИД = "BTC-USDT-SWAP";
	НС.Выбор		= Истина;
	НС.Настройка 	= Справочники.биг_КлючиНастроекСтратегии.НайтиПоКоду("000010731", Истина); 
	
	НС = Объект.ИсходныеДанные.Добавить();
	НС.ИнструментИД = "ETH-USDT-SWAP";
	НС.Выбор		= Истина;
	НС.Настройка 	= Справочники.биг_КлючиНастроекСтратегии.НайтиПоКоду("000010706", Истина);
	
	НС = Объект.ИсходныеДанные.Добавить();
	НС.ИнструментИД = "TRX-USDT-SWAP";
	НС.Выбор		= Истина;
	НС.Настройка 	= Справочники.биг_КлючиНастроекСтратегии.НайтиПоКоду("000009113", Истина);
	
	НС = Объект.ИсходныеДанные.Добавить();
	НС.ИнструментИД = "APT-USDT-SWAP";
	НС.Выбор		= Истина;
	НС.Настройка 	= Справочники.биг_КлючиНастроекСтратегии.НайтиПоКоду("000004628", Истина);
	
	// партия 2
	НС = Объект.ИсходныеДанные.Добавить();
	НС.ИнструментИД = "UNI-USDT-SWAP";
	НС.Выбор		= Истина;
	НС.Настройка 	= Справочники.биг_КлючиНастроекСтратегии.НайтиПоКоду("000001232", Истина);
	
	НС = Объект.ИсходныеДанные.Добавить();
	НС.ИнструментИД = "DOT-USDT-SWAP";
	НС.Выбор		= Истина;
	НС.Настройка 	= Справочники.биг_КлючиНастроекСтратегии.НайтиПоКоду("000010882", Истина);

	НС = Объект.ИсходныеДанные.Добавить();
	НС.ИнструментИД = "HBAR-USDT-SWAP";
	НС.Выбор		= Истина;
	НС.Настройка 	= Справочники.биг_КлючиНастроекСтратегии.НайтиПоКоду("000003176", Истина);
	
	НС = Объект.ИсходныеДанные.Добавить();
	НС.ИнструментИД = "BNB-USDT-SWAP";
	НС.Выбор		= Истина;
	НС.Настройка 	= Справочники.биг_КлючиНастроекСтратегии.НайтиПоКоду("000010801", Истина);
	
	
	НС = Объект.ИсходныеДанные.Добавить();
	НС.ИнструментИД = "ZRX-USDT-SWAP";
	НС.Выбор		= Ложь;
	НС.Настройка 	= Справочники.биг_КлючиНастроекСтратегии.НайтиПоКоду("000010741", Истина);
	
	НС = Объект.ИсходныеДанные.Добавить();
	НС.ИнструментИД = "SOL-USDT-SWAP";
	НС.Выбор		= Ложь;
	НС.Настройка 	= Справочники.биг_КлючиНастроекСтратегии.НайтиПоКоду("000003173", Истина);
	  
	НС = Объект.ИсходныеДанные.Добавить();
	НС.ИнструментИД = "NEAR-USDT-SWAP";
	НС.Выбор		= Ложь;
	НС.Настройка 	= Справочники.биг_КлючиНастроекСтратегии.НайтиПоКоду("000001232", Истина);
	
	НС = Объект.ИсходныеДанные.Добавить();
	НС.ИнструментИД = "SUI-USDT-SWAP";
	НС.Выбор		= Ложь;
	НС.Настройка 	= Справочники.биг_КлючиНастроекСтратегии.НайтиПоКоду("000003662", Истина);
	
	НС = Объект.ИсходныеДанные.Добавить();
	НС.ИнструментИД = "TON-USDT-SWAP";
	НС.Выбор		= Ложь;
	НС.Настройка 	= Справочники.биг_КлючиНастроекСтратегии.НайтиПоКоду("000009823", Истина);
	
		
	НС = Объект.ИсходныеДанные.Добавить();
	НС.ИнструментИД = "BCH-USDT-SWAP";
	НС.Выбор		= Ложь;
	НС.Настройка 	= Справочники.биг_КлючиНастроекСтратегии.НайтиПоКоду("000004635", Истина);
	
	НС = Объект.ИсходныеДанные.Добавить();
	НС.ИнструментИД = "DOGE-USDT-SWAP";
	НС.Выбор		= Ложь;
	НС.Настройка 	= Справочники.биг_КлючиНастроекСтратегии.НайтиПоКоду("000001718", Истина);
	
	НС = Объект.ИсходныеДанные.Добавить();
	НС.ИнструментИД = "XLM-USDT-SWAP";
	НС.Выбор		= Ложь;
	НС.Настройка 	= Справочники.биг_КлючиНастроекСтратегии.НайтиПоКоду("000001233", Истина);
	
	НС = Объект.ИсходныеДанные.Добавить();
	НС.ИнструментИД = "ETC-USDT-SWAP";
	НС.Выбор		= Ложь;
	НС.Настройка 	= Справочники.биг_КлючиНастроекСтратегии.НайтиПоКоду("000001232", Истина);
	
	НС = Объект.ИсходныеДанные.Добавить();
	НС.ИнструментИД = "LTC-USDT-SWAP";
	НС.Выбор		= Ложь;
	НС.Настройка 	= Справочники.биг_КлючиНастроекСтратегии.НайтиПоКоду("000010966", Истина);

	НС = Объект.ИсходныеДанные.Добавить();
	НС.ИнструментИД = "LINC-USDT-SWAP";
	НС.Выбор		= Ложь;
	НС.Настройка 	= Справочники.биг_КлючиНастроекСтратегии.НайтиПоКоду("000004149", Истина);	
	
	
	Объект.Стратегия = биг_ДаблИмпакт.СтратегияДаблИмпакт();
	ВыводитьИтого	= Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВыводитьИтогоПриИзменении(Элемент)
	Пересчитать(Неопределено);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Пересчитать(Команда)
	
	ПересчитатьДанныеНаСервере();
	ЗаполнитьДиаграмму();
	ЗаполнитьДиаграммуПоВсем();
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПересчитатьДанныеНаСервере()
	
	ЗаполнитьИнформациюПоБектесту();	
	ЗаполнитьДанныеБезПересечений();
	
	СформироватьТаблицуИнтерваловОтчета();
	ЗаполнитьДанныеДляДиаграммы();
	ЗаполнитьДанныеДляДиаграммыОбщая();
	
	Если ВыводитьИтого Тогда
		ЗаполнитьНакопленныйРезультат();	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДиаграмму()

	ДиаграммаСобытий.Обновление 	= Ложь;
    ДиаграммаСобытий.Очистить();

	СоответствиеСерий 		= Новый Соответствие;
	                  
	// получить минимум из таблицы		
	Для каждого Строка Из Объект.ДанныеДляДиаграммы Цикл
		
		Серия = СоответствиеСерий.Получить(Строка.ИнструментИД);
		Если Серия = Неопределено Тогда
			Серия = ДиаграммаСобытий.Серии.Добавить(Строка.ИнструментИД);
			СоответствиеСерий.Вставить(Строка.ИнструментИД, Серия);
		КонецЕсли;
		
		Точка = ДиаграммаСобытий.УстановитьТочку(Строка.Дата);
		ДиаграммаСобытий.УстановитьЗначение(Точка, Серия, Строка.ПрофитУбыток);			
 
	КонецЦикла;
	
	ДиаграммаСобытий.Обновление 	= Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДиаграммуПоВсем()

	ДиаграммаПоВсем.Обновление 	= Ложь;
    ДиаграммаПоВсем.Очистить();
	
	СоответствиеСерий 		= Новый Соответствие;
	                  		
	Для каждого Строка Из Объект.ДанныеДляДиаграммыОбщая Цикл
		
		Серия = СоответствиеСерий.Получить(Строка.ИнструментИД);
		Если Серия = Неопределено Тогда
			Серия = ДиаграммаПоВсем.Серии.Добавить(Строка.ИнструментИД);
			СоответствиеСерий.Вставить(Строка.ИнструментИД, Серия);
		КонецЕсли;
		
		Точка = ДиаграммаПоВсем.УстановитьТочку(Строка.Дата);
		ДиаграммаПоВсем.УстановитьЗначение(Точка, Серия, Строка.ПрофитУбыток); 
	КонецЦикла;
	
	ДиаграммаПоВсем.Обновление 	= Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНакопленныйРезультат()
	
	НакопленныйРезультат = 0;
	УчтенныеОперации	= Новый Массив();
	
	Для каждого СтрокаПериода Из Объект.ТаблицаПериодов Цикл
		
		Отбор 				= Новый Структура("Дата", СтрокаПериода.НачИнтервала);
		РезультатыВПериоде 	= Объект.ДанныеДляДиаграммы.НайтиСтроки(Отбор);
		
		Для каждого СтрокаРезультата Из РезультатыВПериоде Цикл
			
			Если УчтенныеОперации.Найти(СтрокаРезультата.Операция) = Неопределено Тогда
				НакопленныйРезультат = НакопленныйРезультат + СтрокаРезультата.ПрофитУбыток;
				УчтенныеОперации.Добавить(СтрокаРезультата.Операция);
			КонецЕсли;
		КонецЦикла;
		
		НС = Объект.ДанныеДляДиаграммы.Добавить();
		НС.ИнструментИД = "ИТОГО";
		НС.Дата 		= СтрокаПериода.НачИнтервала;
		НС.ПрофитУбыток = НакопленныйРезультат;
	КонецЦикла;	
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьИнформациюПоБектесту()

	Объект.ОперацииБектеста.Очистить();
	
	ТаблицаФильтр = Новый ТаблицаЗначений;
	ТаблицаФильтр.Колонки.Добавить("ИнструментИД", ОбщегоНазначения.ОписаниеТипаСтрока(100));
	ТаблицаФильтр.Колонки.Добавить("Настройка", Новый ОписаниеТипов("СправочникСсылка.биг_КлючиНастроекСтратегии"));
	
	Для каждого Строка Из Объект.ИсходныеДанные Цикл
		Если Строка.Выбор Тогда
			НС = ТаблицаФильтр.Добавить();
			ЗаполнитьЗначенияСвойств(НС, Строка);
		КонецЕсли;	
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Фильтр.ИнструментИД КАК ИнструментИД,
	|	Фильтр.Настройка КАК Настройка
	|ПОМЕСТИТЬ ВТ_Фильтр
	|ИЗ
	|	&Фильтр КАК Фильтр
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	биг_ДаблИмпактОперации.ИнструментИД КАК ИнструментИД,
	|	биг_ДаблИмпактОперации.Операция.НастройкаСтратегии КАК Настройка,
	|	биг_ДаблИмпактОперации.Операция КАК Операция,
	|	биг_ДаблИмпактОперации.Операция.pnl КАК ПрофитУбыток,
	|	биг_ДаблИмпактОперации.Операция.ТочкаНачалаПадения КАК НачалоСобытияТС,
	|	биг_ДаблИмпактОперации.Операция.cTime КАК ЗавершениеСобытияТС,
	|	биг_ДаблИмпактОперации.Операция.cTimeDateTime КАК ЗАвершениеСобытияДата
	|ИЗ
	|	РегистрСведений.биг_ДаблИмпактОперации КАК биг_ДаблИмпактОперации
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Фильтр КАК ВТ_Фильтр
	|		ПО биг_ДаблИмпактОперации.ИнструментИД = ВТ_Фильтр.ИнструментИД
	|			И биг_ДаблИмпактОперации.Операция.НастройкаСтратегии = ВТ_Фильтр.Настройка
	|ГДЕ
	//|	биг_ДаблИмпактОперации.Операция.Стратегия = &Стратегия
	|	 биг_ДаблИмпактОперации.Операция.Событие = &Событие
	|	И (биг_ДаблИмпактОперации.Операция.Дата МЕЖДУ &НачалоПериода И &ЗавершениеПериода
	|			ИЛИ &БезОтбораПоПериоду)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НачалоСобытияТС";
	
	Запрос.УстановитьПараметр("Фильтр", 	ТаблицаФильтр);
	Запрос.УстановитьПараметр("Стратегия", 	Объект.Стратегия);
	Запрос.УстановитьПараметр("Событие", 	Перечисления.биг_ДаблИмпактEvents.ВыполнениеСтопЛосс);
	
	Запрос.УстановитьПараметр("НачалоПериода", Период.ДатаНачала);
	Запрос.УстановитьПараметр("ЗавершениеПериода", Период.ДатаОкончания);
	Запрос.УстановитьПараметр("БезОтбораПоПериоду", НЕ ЗначениеЗаполнено(Период.ДатаНачала));
	
	Объект.ОперацииБектеста.Загрузить(Запрос.Выполнить().Выгрузить());
	
	// Сконвертируем классические даты, если их где то нет
	Для каждого Строка Из Объект.ОперацииБектеста Цикл
		
		Если Строка.НачалоСобытияДата < Дата(1970, 1, 1) Тогда
			Строка.НачалоСобытияДата 		= биг_ОбщегоНазначенияКлиентСервер.TimestampВДату(Строка.НачалоСобытияТС);	
		КонецЕсли;	
		
		Если Строка.ЗавершениеСобытияДата < Дата(1970, 1, 1) Тогда
			Строка.ЗавершениеСобытияДата 	= биг_ОбщегоНазначенияКлиентСервер.TimestampВДату(Строка.ЗавершениеСобытияТС);	
		КонецЕсли;		
	КонецЦикла;		
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеБезПересечений()

	// заполнение без пересечений
	Объект.ОперацииБектестаБезПересечений.Очистить();
		
	 // Переменная для хранения последнего добавленного события
    ПоследнееСобытие = Неопределено;

    // Перебираем все события
    Для Каждого Событие Из Объект.ОперацииБектеста Цикл
		
		Если ПоследнееСобытие = Неопределено Тогда
            // Если это первое событие, просто добавляем его
            НоваяСтрока 		= Объект.ОперацииБектестаБезПересечений.Добавить();
            ЗаполнитьЗначенияСвойств(НоваяСтрока, Событие);
            ПоследнееСобытие 	= НоваяСтрока;
        Иначе
            // Проверяем пересечение с последним добавленным событием
            Если Событие.НачалоСобытияТС > ПоследнееСобытие.ЗавершениеСобытияТС Тогда
				
				// Если пересечения нет, добавляем событие в результирующую таблицу
                НоваяСтрока = Объект.ОперацииБектестаБезПересечений.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Событие);							
				
                ПоследнееСобытие = НоваяСтрока;
            КонецЕсли;
		КонецЕсли;		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеДляДиаграммы()

	Объект.ДанныеДляДиаграммы.Очистить();
	
	Запрос 				= Новый Запрос;	
	Запрос.Текст 		= ПолучитьТекстЗапросаПоПериодам();	
	Запрос.УстановитьПараметр("Периоды", Объект.ТаблицаПериодов.Выгрузить());
	Запрос.УстановитьПараметр("Операции", Объект.ОперацииБектестаБезПересечений.Выгрузить());
	
	Объект.ДанныеДляДиаграммы.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеДляДиаграммыОбщая()

	Объект.ДанныеДляДиаграммыОбщая.Очистить();
	
	Запрос 				= Новый Запрос;	
	Запрос.Текст 		= ПолучитьТекстЗапросаПоПериодам();	
	Запрос.УстановитьПараметр("Периоды", Объект.ТаблицаПериодов.Выгрузить());
	Запрос.УстановитьПараметр("Операции", Объект.ОперацииБектеста.Выгрузить());
	
	Объект.ДанныеДляДиаграммыОбщая.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТекстЗапросаПоПериодам()
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	Периоды.НачИнтервала КАК НачалоПериода
	|ПОМЕСТИТЬ ВТ_Периоды
	|ИЗ
	|	&Периоды КАК Периоды
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Операции.ИнструментИД КАК ИнструментИД,
	|	Операции.ПрофитУбыток КАК ПрофитУбыток,
	|	Операции.НачалоСобытияДата КАК НачалоСобытияДата,
	|	Операции.ЗавершениеСобытияДата КАК ЗавершениеСобытияДата,
	|	Операции.Операция КАК Операция
	|ПОМЕСТИТЬ ВТ_Операции
	|ИЗ
	|	&Операции КАК Операции
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Операции.ИнструментИД КАК ИнструментИД
	|ПОМЕСТИТЬ ВТ_УникИнструменты
	|ИЗ
	|	ВТ_Операции КАК ВТ_Операции
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Периоды.НачалоПериода КАК НачалоПериода,
	|	ВТ_УникИнструменты.ИнструментИД КАК ИнструментИД
	|ПОМЕСТИТЬ ВТ_ПериодыИнструментов
	|ИЗ
	|	ВТ_Периоды КАК ВТ_Периоды
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_УникИнструменты КАК ВТ_УникИнструменты
	|		ПО (ИСТИНА)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПериодыИнструментов.НачалоПериода КАК Дата,
	|	ВТ_ПериодыИнструментов.ИнструментИД КАК ИнструментИД,
	|	ВТ_Операции.Операция КАК Операция,
	|	ЕСТЬNULL(ВТ_Операции.ПрофитУбыток, 0) КАК ПрофитУбыток
	|ИЗ
	|	ВТ_ПериодыИнструментов КАК ВТ_ПериодыИнструментов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Операции КАК ВТ_Операции
	|		ПО ВТ_ПериодыИнструментов.ИнструментИД = ВТ_Операции.ИнструментИД
	|			И ВТ_ПериодыИнструментов.НачалоПериода <= ВТ_Операции.ЗавершениеСобытияДата
	|			И ВТ_ПериодыИнструментов.НачалоПериода >= ВТ_Операции.НачалоСобытияДата
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИнструментИД,
	|	Дата";
	
	Возврат ТекстЗапроса;
	
КонецФункции

&НаСервере
Процедура СформироватьТаблицуИнтерваловОтчета()

	НачалоПериода 	= Дата(3000, 1, 1);
	КонецПериода	= Дата(1, 1, 1);
	Для каждого Строка Из Объект.ОперацииБектестаБезПересечений Цикл
		НачалоПериода = Мин(НачалоПериода, Строка.НачалоСобытияДата);
		КонецПериода	= Макс(КонецПериода, Строка.ЗавершениеСобытияДата);
	КонецЦикла;
	
	ТаблицаИнтервалов 	= биг_ОбщегоНазначения.ПолучитьТаблицуДатЗаПериод(НачалоПериода, КонецПериода, "ДЕНЬ");
	Объект.ТаблицаПериодов.Загрузить(ТаблицаИнтервалов);
	
КонецПроцедуры
  
#КонецОбласти




&НаКлиенте
Процедура ПодобратьОптимальнуюКомбинацию(Команда)
	
	ВремяНачала = ТекущаяДата();
	
	МассивКомбинаций = ПодобратьОптимальнуюКомбинациюНаСервере();
	
	КоличествоКомбинаций = МассивКомбинаций.Количество();
	Счетчик = 0;
	
	// пересчитываем каждый набор комбинаций
	Для Каждого СтруктураКомбинации Из МассивКомбинаций Цикл
		
		Прогресс = Окр(Счетчик / КоличествоКомбинаций * 100, 0);
		Состояние("Пересчет результатов комбинаций", Прогресс); 
		
		Объект.ИсходныеДанные.Очистить();
		
		Для каждого Строка Из СтруктураКомбинации.МассивСтрок Цикл
			НС = Объект.ИсходныеДанные.Добавить();
			ЗаполнитьЗначенияСвойств(НС, Строка);
		КонецЦикла;                              
		
		// пересчитываем сигналы с учетом пересечений
		ПересчитатьДанныеНаСервере();
		
		// собираем результат
		Для каждого Строка Из Объект.ОперацииБектестаБезПересечений Цикл
			СтруктураКомбинации.Результат = СтруктураКомбинации.Результат + Строка.ПрофитУбыток;	
		КонецЦикла;	
		
		Счетчик = Счетчик + 1;
	КонецЦикла;
	
	МаксВариант 	= Неопределено;
	МаксРезультат 	= 0;
	
	Для каждого СтруктураКомбинации Из МассивКомбинаций Цикл
		Если СтруктураКомбинации.Результат > МаксРезультат Тогда
			МаксРезультат = СтруктураКомбинации.Результат;
			МаксВариант	= СтруктураКомбинации.МассивСтрок;
		КонецЕсли;		
	КонецЦикла; 
	
	// перезаполняем форму итоговый раз
	Объект.ИсходныеДанные.Очистить();
	
	Для каждого Строка Из МаксВариант Цикл
		НС = Объект.ИсходныеДанные.Добавить();
		ЗаполнитьЗначенияСвойств(НС, Строка);	
	КонецЦикла;
	
	Пересчитать(Неопределено);

	ВремяЗавершения = ТекущаяДата();
	Длительность = ВремяЗавершения - ВремяНачала;
	Сообщить("Операция заняла " + Окр(Длительность / 60) + " мин");
	
КонецПроцедуры

&НаСервере
Функция ПодобратьОптимальнуюКомбинациюНаСервере()
	
	// Получаем исходные данные из табличной части
    ИсходныеДанные = Объект.ИсходныеДанные.Выгрузить();

    // Создаем массив для хранения уникальных ИнструментИД
    МассивИнструментов = Новый Массив;
    Для Каждого СтрокаИсходныхДанных Из Объект.ИсходныеДанные Цикл
        СтруктураИнструмента = Новый Структура("ИнструментИД, Настройка", СтрокаИсходныхДанных.ИнструментИД, СтрокаИсходныхДанных.Настройка);
        МассивИнструментов.Добавить(СтруктураИнструмента);
    КонецЦикла;

    // Создаем массив для хранения всех комбинаций
    МассивКомбинаций = Новый Массив;

    // Генерируем все комбинации
    СгенерироватьКомбинацииРекурсивно(МассивИнструментов, 0, Новый Массив, МассивКомбинаций);
	
	Возврат МассивКомбинаций;
	   	
КонецФункции

&НаСервере
Процедура СгенерироватьКомбинацииРекурсивно(МассивИнструментов, Индекс, ТекущийМассивСтрок, МассивКомбинаций)
	
	Если Индекс >= МассивИнструментов.Количество() Тогда
        // Создаем копию текущего массива строк
        НовыйМассивСтрок = Новый Массив;
        Для Каждого СтруктураСтроки Из ТекущийМассивСтрок Цикл
            НовыйМассивСтрок.Добавить(Новый Структура("ИнструментИД, Выбор, Настройка", СтруктураСтроки.ИнструментИД, СтруктураСтроки.Выбор, СтруктураСтроки.Настройка));
        КонецЦикла;

        // Создаем структуру для хранения массива строк и результата
        СтруктураВарианта = Новый Структура("МассивСтрок, Результат", НовыйМассивСтрок, 0);
        // Добавляем структуру в массив комбинаций
        МассивКомбинаций.Добавить(СтруктураВарианта);
        Возврат;
    КонецЕсли;

    // Получаем текущий инструмент и его настройку
    СтруктураИнструмента = МассивИнструментов[Индекс];
    Инструмент = СтруктураИнструмента.ИнструментИД;
    Настройка = СтруктураИнструмента.Настройка;

    // Создаем копию текущего массива строк для варианта "Истина"
    МассивИстина = Новый Массив;
    Для Каждого СтруктураСтроки Из ТекущийМассивСтрок Цикл
        МассивИстина.Добавить(Новый Структура("ИнструментИД, Выбор, Настройка", СтруктураСтроки.ИнструментИД, СтруктураСтроки.Выбор, СтруктураСтроки.Настройка));
    КонецЦикла;
    МассивИстина.Добавить(Новый Структура("ИнструментИД, Выбор, Настройка", Инструмент, Истина, Настройка));
    СгенерироватьКомбинацииРекурсивно(МассивИнструментов, Индекс + 1, МассивИстина, МассивКомбинаций);

    // Создаем копию текущего массива строк для варианта "Ложь"
    МассивЛожь = Новый Массив;
    Для Каждого СтруктураСтроки Из ТекущийМассивСтрок Цикл
        МассивЛожь.Добавить(Новый Структура("ИнструментИД, Выбор, Настройка", СтруктураСтроки.ИнструментИД, СтруктураСтроки.Выбор, СтруктураСтроки.Настройка));
    КонецЦикла;
    МассивЛожь.Добавить(Новый Структура("ИнструментИД, Выбор, Настройка", Инструмент, Ложь, Настройка));
    СгенерироватьКомбинацииРекурсивно(МассивИнструментов, Индекс + 1, МассивЛожь, МассивКомбинаций);
	
КонецПроцедуры


