#Область СлужебныйПрограммныйИнтерфейс

// См. ВыгрузкаЗагрузкаДанныхПереопределяемый.ПослеЗагрузкиДанных.
// @skip-warning ПустойМетод - особенность реализации.
//
Процедура ПослеЗагрузкиДанных(Контейнер) Экспорт
КонецПроцедуры

// См. ОбновлениеИнформационнойБазыБСП.ПриДобавленииОбработчиковОбновления.
// @skip-warning ПустойМетод - особенность реализации.
// 
// Параметры:
//	Обработчики - см. ОбновлениеИнформационнойБазы.НоваяТаблицаОбработчиковОбновления
//
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
КонецПроцедуры

// Создает в текущей области данных задания по шаблонам.
// @skip-warning ПустойМетод - особенность реализации.
//
Процедура СоздатьЗаданияОчередиПоШаблонамВТекущейОбласти() Экспорт
КонецПроцедуры

// См. РаботаВМоделиСервисаПереопределяемый.ПриВключенииРазделенияПоОбластямДанных.
// @skip-warning ПустойМетод - особенность реализации.
//
Процедура ПриВключенииРазделенияПоОбластямДанных() Экспорт
КонецПроцедуры

// См. ВыгрузкаЗагрузкаДанныхПереопределяемый.ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки.
// 
// Параметры:
//	Типы - см. ВыгрузкаЗагрузкаДанныхПереопределяемый.ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки.Типы
//
Процедура ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки(Типы) Экспорт
	
	ВыгрузкаЗагрузкаДанных.ДополнитьТипомИсключаемымИзВыгрузкиЗагрузки(
		Типы,
		Метаданные.Справочники.ОчередьЗаданий,
		ВыгрузкаЗагрузкаДанных.ДействиеСоСсылкамиНеИзменять());

	Типы.Добавить(Метаданные.РегистрыСведений.ИсторияЗапускаЗаданийОчереди);
	Типы.Добавить(Метаданные.Константы.ЛогироватьЗапускиЗаданийОчереди);
	Типы.Добавить(Метаданные.Константы.ПериодХраненияИсторииЗапусковЗаданийОчереди);
	
	ВыгрузкаЗагрузкаДанных.ДополнитьТипомИсключаемымИзВыгрузкиЗагрузки(
		Типы,
		Метаданные.Справочники.УдалитьОчередьЗаданий,
		ВыгрузкаЗагрузкаДанных.ДействиеСоСсылкамиНеИзменять());
	
КонецПроцедуры

#КонецОбласти
