

#Область ПрограммныйИнтерфейс

#КонецОбласти


#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	                	
	Если ЗначениеЗаполнено(attachAlgoClOrdId) И НЕ ЗначениеЗаполнено(algoClOrdId) Тогда
		algoClOrdId = attachAlgoClOrdId;	
	КонецЕсли;
	
	Если state = "live" ИЛИ state = "pause" ИЛИ state = "partially_effective" Тогда
		Статус = Перечисления.big_СтатусыТорговыхОбъектов.Активный;
	ИначеЕсли state = "effective" ИЛИ state = "partially_failed" Тогда
		Статус = Перечисления.big_СтатусыТорговыхОбъектов.Исполнен;
	ИначеЕсли state = "canceled" ИЛИ state = "order_failed" Тогда
		Статус = Перечисления.big_СтатусыТорговыхОбъектов.Отменен;
	Иначе
		Статус = Перечисления.big_СтатусыТорговыхОбъектов.Новый;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
		
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		    			
		Дата 					= ТекущаяДатаСеанса();
		Аккаунт 				= ДанныеЗаполнения.Аккаунт;
		Статус					= Перечисления.big_СтатусыТорговыхОбъектов.Новый;
		Стратегия				= ДанныеЗаполнения.Стратегия;
		НастройкаСтратегии		= ДанныеЗаполнения.КлючНастроек;
		ТочкаНачалаПадения		= ДанныеЗаполнения.Сигнал;	
		instId					= ДанныеЗаполнения.ИнструментИД;	
		Событие					= ДанныеЗаполнения.Событие;	
		Ордер					= ДанныеЗаполнения.Ордер;
		Операция				= ДанныеЗаполнения.Операция;
		Если ДанныеЗаполнения.Свойство("ОперацияИзменить") Тогда
			ОперацияИзменить	= ДанныеЗаполнения.ОперацияИзменить;	
		КонецЕсли;
		
		Сделка					= ДанныеЗаполнения.Сделка;
		posSide	                = ДанныеЗаполнения.СторонаПозиции;
		
		sz						= ДанныеЗаполнения.Объем;
		
		Если ЗначениеЗаполнено(Ордер) Тогда // это связанный Алго
			attachAlgoClOrdId	= ДанныеЗаполнения.КлиентАлгоОрдерИД;	
		КонецЕсли;
		algoClOrdId				= ДанныеЗаполнения.КлиентАлгоОрдерИД;	
		
		// СТОП-ЛОСС
		Если ЗначениеЗаполнено(ДанныеЗаполнения.ТриггерСтопЛос) Тогда
			slTriggerPx 		= ДанныеЗаполнения.ТриггерСтопЛос;
			slOrdPx				= ДанныеЗаполнения.ЦенаСтопЛос;
			slTriggerPxType		= Перечисления.big_OKX_TriggerPxTypes.last;
			side				= Перечисления.big_OKX_OrderSides.sell;
		КонецЕсли;
             	
		// ТЕЙК-ПРОФИТ 
		Если ЗначениеЗаполнено(ДанныеЗаполнения.ТриггерТейкПрофит) Тогда
			tpTriggerPx     	= ДанныеЗаполнения.ТриггерТейкПрофит;
			tpOrdPx        		= ДанныеЗаполнения.ЦенаТейкПрофит;
			
			tpOrdKind			= Перечисления.big_OKX_TPOrderKinds.condition;
			tpTriggerPxType		= Перечисления.big_OKX_TriggerPxTypes.last;
			side				= Перечисления.big_OKX_OrderSides.sell;
		КонецЕсли;		
	КонецЕсли;
	
КонецПроцедуры
       
#КонецОбласти


#Область ОбработчикиПроведения

Процедура ОтразитьДвижения_СтатусОперацииПортфеля(Отказ, РежимПроведения)
	
	Если ЗначениеЗаполнено(Операция) И ЗначениеЗаполнено(Сделка) И ЗначениеЗаполнено(Аккаунт) Тогда	
		
		Портфель 	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Операция, "Портфель");
		Если ЗначениеЗаполнено(Портфель) Тогда			
			
			СтатусыСработал = Новый Массив;       
			СтатусыСработал.Добавить("FILLED");
			// копипаста из биг_ДаблИмпакт.ПроверитьАктуальностьСигнала()
			СтатусыСработал.Добавить("EFFECTIVE");
			СтатусыСработал.Добавить("PARTIALLY_EFFECTIVE");
			СтатусыСработал.Добавить("LIVE");
			
			Если ЗначениеЗаполнено(algoId) И СтатусыСработал.Найти(Врег(state)) <> Неопределено Тогда
				
				Блокировка = Новый БлокировкаДанных;
				ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.биг_ОперацииПортфеля");
				ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
				ЭлементБлокировки.УстановитьЗначение("Портфель",	Портфель);
				ЭлементБлокировки.УстановитьЗначение("Сделка", 		Сделка);
				ЭлементБлокировки.УстановитьЗначение("Операция", 	Операция);
				ЭлементБлокировки.УстановитьЗначение("Аккаунт", 	Аккаунт);
				Блокировка.Заблокировать(); 
				
				Набор = РегистрыСведений.биг_ОперацииПортфеля.СоздатьНаборЗаписей();
				Набор.Отбор.Портфель.Установить(Портфель);
				Набор.Отбор.Сделка.Установить(Сделка);
				Набор.Отбор.Операция.Установить(Операция);
				Набор.Отбор.Аккаунт.Установить(Аккаунт);
				Набор.Прочитать();
				
				Для каждого Запись Из Набор Цикл
					Запись.ИнтеграционныйДокумент = Ссылка;					
					Запись.Статус = Перечисления.big_СтатусыТорговыхОбъектов.Исполнен;	
				КонецЦикла;
				
				Набор.Записать(Истина);
			КонецЕсли;			
		КонецЕсли;
	КонецЕсли;
	
	// TODO: почти полная копипаста кода выше. отличается только источник операции
	Если ЗначениеЗаполнено(ОперацияИзменить) Тогда
		Портфель 	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Операция, "Портфель");
		Если ЗначениеЗаполнено(Портфель) Тогда			
			
			СтатусыСработал = Новый Массив;       
			СтатусыСработал.Добавить("FILLED");
			// копипаста из биг_ДаблИмпакт.ПроверитьАктуальностьСигнала()
			СтатусыСработал.Добавить("EFFECTIVE");
			СтатусыСработал.Добавить("PARTIALLY_EFFECTIVE");
			СтатусыСработал.Добавить("LIVE");
			
			Если ЗначениеЗаполнено(algoId) И СтатусыСработал.Найти(Врег(state)) <> Неопределено Тогда
				
				Блокировка = Новый БлокировкаДанных;
				ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.биг_ОперацииПортфеля");
				ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
				ЭлементБлокировки.УстановитьЗначение("Портфель",	Портфель);
				ЭлементБлокировки.УстановитьЗначение("Сделка", 		Сделка);
				ЭлементБлокировки.УстановитьЗначение("Операция", 	ОперацияИзменить);
				ЭлементБлокировки.УстановитьЗначение("Аккаунт", 	Аккаунт);
				Блокировка.Заблокировать(); 
				
				Набор = РегистрыСведений.биг_ОперацииПортфеля.СоздатьНаборЗаписей();
				Набор.Отбор.Портфель.Установить(Портфель);
				Набор.Отбор.Сделка.Установить(Сделка);
				Набор.Отбор.Операция.Установить(ОперацияИзменить);
				Набор.Отбор.Аккаунт.Установить(Аккаунт);
				Набор.Прочитать();
				
				Для каждого Запись Из Набор Цикл
					Запись.ИнтеграционныйДокумент = Ссылка;					
					Запись.Статус = Перечисления.big_СтатусыТорговыхОбъектов.Исполнен;	
				КонецЦикла;
				
				Набор.Записать(Истина);
			КонецЕсли;			
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Функция ДанныеЗаполненияКорректны(ДанныеЗаполнения)
	
	ДанныеКорректны 	= Истина;

	Аккаунт             = Неопределено;
	УровеньСтопЛосс     = Неопределено;
	УровеньТейкПрофит	= Неопределено;
	
	Если НЕ ДанныеЗаполнения.Свойство("Аккаунт", Аккаунт) Тогда
		Сообщить("Структура не содержит обязательного ключа 'Аккаунт'");
		ДанныеКорректны = Ложь;
	КонецЕсли;
	
	Если НЕ ДанныеЗаполнения.Свойство("УровеньСтопЛосс", УровеньСтопЛосс) Тогда
		Сообщить("Структура не содержит обязательного ключа 'УровеньСтопЛосс'");
		ДанныеКорректны = Ложь;
	КонецЕсли;
	
	Если НЕ ДанныеЗаполнения.Свойство("УровеньТейкПрофит", УровеньТейкПрофит) Тогда
		Сообщить("Структура не содержит обязательного ключа 'УровеньТейкПрофит'");
		ДанныеКорректны = Ложь;
	КонецЕсли;
	
	Если НЕ ДанныеКорректны Тогда
		Возврат ДанныеКорректны;
	КонецЕсли;
	
	// Структура содержит необходимые ключи. проверим их заполнение
	
	Если НЕ ЗначениеЗаполнено(Аккаунт) Тогда
		Сообщить("Значение обязательного ключа 'Аккаунт' не установлено");
		ДанныеКорректны = Ложь;	
	КонецЕсли;
	
	Если НЕ (ЗначениеЗаполнено(УровеньСтопЛосс) ИЛИ ЗначениеЗаполнено(УровеньТейкПрофит)) Тогда
		Сообщить("Один из ключей: 'УровеньСтопЛосс' или 'УровеньТейкПрофит' должен быть обязательно заполнен");
		ДанныеКорректны = Ложь;	
	КонецЕсли;
	
	Возврат ДанныеКорректны;
		
КонецФункции

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ОтразитьДвижения_СтатусОперацииПортфеля(Отказ, РежимПроведения);
	
КонецПроцедуры

#КонецОбласти


