

&НаКлиентеНаСервереБезКонтекста
Функция ТестОбщийТестНаРазвал() Экспорт
	
	ИменаКоллекций = СтрРазделить("Массив,СписокЗначений,Структура,Соответствие", ",");
	ГСЧ = Новый ГенераторСлучайныхЧисел;
	МассивСлучайныхЧисел = Новый Массив;
	Для Сч = 1 По 10 Цикл
		МассивСлучайныхЧисел.Добавить(ГСЧ.СлучайноеЧисло(1,10));
	КонецЦикла; 
	Сообщить("Данные для тестирования " + СтрСоединить(МассивСлучайныхЧисел, ","));
	ВремяНач = ТекущаяУниверсальнаяДатаВМиллисекундах();	
	Для Каждого ИмяКоллекции Из ИменаКоллекций Цикл
		Если ИмяКоллекции = "ТаблицаЗначений" Тогда
			Продолжить;
		КонецЕсли;
		Сообщить("Тестирование " + ИмяКоллекции);
		ТестОбъект = КоллекцииКлиентСервер_бук.ЭкземплярКлассаУниверсальнаяКоллекция(ИмяКоллекции);
		Сообщить("Инициализация по имени коллекции выполнено");
		
		Для Ключ = 0 По 9 Цикл
			Значение = МассивСлучайныхЧисел[Ключ];
			Если ИмяКоллекции = "Структура" Или ИмяКоллекции = "Соответствие" Тогда
				КлючСтруктуры = "Ключ" + Формат(Ключ, "ЧГ=0"); 
				ТестОбъект.Добавить(Значение, КлючСтруктуры);
			Иначе
				ТестОбъект.Добавить(Значение);
			КонецЕсли;
		КонецЦикла; 
		
		Сообщить("Добавление случайных чисел выполнено");
		
		Сообщить("Начало обхода элементов");
		Пока ТестОбъект.Следующий() Цикл
			Сообщить("Ключ:" + ТестОбъект.Ключ() + " Значение:" + ТестОбъект.Значение());
		КонецЦикла;
		Сообщить("Обход элементов выполнен");
		
		Ключ = 4;
		Если ИмяКоллекции = "Структура" Или ИмяКоллекции = "Соответствие" Тогда
			КлючСтруктуры = "Ключ" + Формат(Ключ, "ЧГ=0"); 
			Значение = ТестОбъект.ПолучитьЗначение(КлючСтруктуры);
		Иначе
			Значение = ТестОбъект.ПолучитьЗначение(Ключ);
		КонецЕсли;
		Сообщить("Получение значения по ключу. Ключ:" + Ключ + " Значение:" + Значение);
		
		Значение = МассивСлучайныхЧисел[4];
		Сообщить("Поиск по значению. Ключ:" + ТестОбъект.НайтиПоЗначению(Значение) + " Значение:" + Значение);
		Сообщить("Поиск всех элементов по значению. Ключи:" + СтрСоединить(ТестОбъект.НайтиВсеПоЗначению(Значение), ",") + " Значение:" + Значение);
		ТестОбъект.Индексировать();
		Сообщить("Индексирование выполнено");
		Сообщить("Поиск по значению с индексом. Ключ:" + ТестОбъект.НайтиПоЗначению(Значение) + " Значение:" + Значение); 
		Сообщить("Поиск всех элементов по значению с индексом. Ключи:" + СтрСоединить(ТестОбъект.НайтиВсеПоЗначению(Значение), ",") + " Значение:" + Значение); 
		ТестОбъект.УдалитьИндекс();
		Ключ = КлючКоллекции(ИмяКоллекции, ГСЧ.СлучайноеЧисло(1,9));
		ТестОбъект.Удалить(Ключ);
		Сообщить("Удаление по ключу выполнено");
		
	КонецЦикла;
	
	ВремяКон = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Сообщить("Тест на развал пройден за " + (ВремяКон - ВремяНач) + " мс.");
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТестСравнениеСкоростиПоиска() Экспорт
	
	ИменаКоллекций = СтрРазделить("Массив,СписокЗначений,Структура,Соответствие", ",");

	ГСЧ = Новый ГенераторСлучайныхЧисел;
	МассивСлучайныхЧисел = Новый Массив;
	МаксЗначение = 10;
	ЧислоЭлементовМассива = 10000;
	Для Сч = 1 По ЧислоЭлементовМассива Цикл
		МассивСлучайныхЧисел.Добавить(ГСЧ.СлучайноеЧисло(1, МаксЗначение));
	КонецЦикла;
	
	ЗначенияПоиска = Новый Массив;
	ЧислоПозицийПоиска = 100;
	Для Сч = 1 По ЧислоПозицийПоиска Цикл
		ПозицияПоиска = ГСЧ.СлучайноеЧисло(1,ЧислоЭлементовМассива);
		ЗначенияПоиска.Добавить(МассивСлучайныхЧисел[ПозицияПоиска]);
		ЗначенияПоиска.Добавить(МаксЗначение + ГСЧ.СлучайноеЧисло(1, 100)); //заведомо отсутствующее значение для неуспешного поиска
	КонецЦикла;
	ЧислоЗначенийПоиска = ЗначенияПоиска.Количество(); 
	
	Сообщить("Данные для тестирования. Массив размером " + ЧислоЭлементовМассива);
	ВремяНач = ТекущаяУниверсальнаяДатаВМиллисекундах();	
	Для Каждого Значение Из ЗначенияПоиска Цикл
		Результат = МассивСлучайныхЧисел.Найти(Значение);
	КонецЦикла;
	ВремяКон = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Сообщить("Типовой поиск " + ЧислоЗначенийПоиска + " значений: " + (ВремяКон - ВремяНач) + " мс.");
	
	Для Каждого ИмяКоллекции Из ИменаКоллекций Цикл
		Если ИмяКоллекции = "ТаблицаЗначений" Или ИмяКоллекции = "ФиксированныйМассив" 
			Или ИмяКоллекции = "ФиксированнаяСтруктура" Или ИмяКоллекции = "ФиксированноеСоответствие" Тогда
			Продолжить;
		КонецЕсли;
		
		Сообщить("Тестирование " + ИмяКоллекции);
		ВремяНач = ТекущаяУниверсальнаяДатаВМиллисекундах();	
		ТестОбъект = КоллекцииКлиентСервер_бук.ЭкземплярКлассаУниверсальнаяКоллекция(ИмяКоллекции);
		
		// Заполнение коллекции
		Для Ключ = 0 По ЧислоЭлементовМассива - 1 Цикл
			Значение = МассивСлучайныхЧисел[Ключ];
			Если ИмяКоллекции = "Структура" Или ИмяКоллекции = "Соответствие" Тогда
				КлючСтруктуры = "Ключ" + Формат(Ключ, "ЧГ=0"); 
				ТестОбъект.Добавить(Значение, КлючСтруктуры);
			Иначе
				ТестОбъект.Добавить(Значение);
			КонецЕсли;
		КонецЦикла;
		ВремяКон = ТекущаяУниверсальнаяДатаВМиллисекундах();
		Сообщить(ИмяКоллекции + ".Класс. Инициализация и заполнение коллекции. " + ЧислоЭлементовМассива + " элементов: " + (ВремяКон - ВремяНач) + " мс.");
		
		ВремяНач = ТекущаяУниверсальнаяДатаВМиллисекундах();	
		Для Каждого Значение Из ЗначенияПоиска Цикл
			Результат = ТестОбъект.НайтиПоЗначению(Значение);
		КонецЦикла;
		ВремяКон = ТекущаяУниверсальнаяДатаВМиллисекундах();
		Сообщить(ИмяКоллекции + ".Класс. Поиск по значению (аналог типового). " + ЧислоЗначенийПоиска + " элементов: " + (ВремяКон - ВремяНач) + " мс.");
		
		ВремяНач = ТекущаяУниверсальнаяДатаВМиллисекундах();	
		Для Каждого Значение Из ЗначенияПоиска Цикл
			Результат = ТестОбъект.НайтиВсеПоЗначению(Значение);
		КонецЦикла;
		ВремяКон = ТекущаяУниверсальнаяДатаВМиллисекундах();
		Сообщить(ИмяКоллекции + ".Класс. Поиск всех элементов по значению. " + ЧислоЗначенийПоиска + " значений: " + (ВремяКон - ВремяНач) + " мс.");
		
		ВремяНач = ТекущаяУниверсальнаяДатаВМиллисекундах();	
		ТестОбъект.Индексировать();
		ВремяКон = ТекущаяУниверсальнаяДатаВМиллисекундах();
		Сообщить(ИмяКоллекции + ".Класс. Индексирование. " + ЧислоЭлементовМассива + " элементов: " + (ВремяКон - ВремяНач) + " мс.");
		
		ВремяНач = ТекущаяУниверсальнаяДатаВМиллисекундах();	
		Для Каждого Значение Из ЗначенияПоиска Цикл
			Результат = ТестОбъект.НайтиПоЗначению(Значение);
		КонецЦикла;
		ВремяКон = ТекущаяУниверсальнаяДатаВМиллисекундах();
		Сообщить(ИмяКоллекции + ".Класс. Поиск по значению с индексом. " + ЧислоЗначенийПоиска + " значений: " + (ВремяКон - ВремяНач) + " мс.");
		
		ВремяНач = ТекущаяУниверсальнаяДатаВМиллисекундах();	
		Для Каждого Значение Из ЗначенияПоиска Цикл
			Результат = ТестОбъект.НайтиВсеПоЗначению(Значение);
		КонецЦикла;
		ВремяКон = ТекущаяУниверсальнаяДатаВМиллисекундах();
		Сообщить(ИмяКоллекции + ".Класс. Поиск всех элементов по значению с индексом. " + ЧислоЗначенийПоиска + " значений: " + (ВремяКон - ВремяНач) + " мс.");
		
	КонецЦикла;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТестЗафиксироватьКоллекцию() Экспорт
	
	ИменаКоллекций = СтрРазделить("Массив,СписокЗначений,Структура,Соответствие", ",");
	
	ГСЧ = Новый ГенераторСлучайныхЧисел;
	МассивСлучайныхЧисел = Новый Массив;
	МаксЗначение = 10;
	ЧислоЭлементовМассива = 10;
	Для Сч = 1 По ЧислоЭлементовМассива Цикл
		МассивСлучайныхЧисел.Добавить(ГСЧ.СлучайноеЧисло(1, МаксЗначение));
	КонецЦикла;
	Сообщить("Данные для тестирования " + СтрСоединить(МассивСлучайныхЧисел, ","));
	
	Для Каждого ИмяКоллекции Из ИменаКоллекций Цикл
		ТестОбъект = КоллекцииКлиентСервер_бук.ЭкземплярКлассаУниверсальнаяКоллекция(ИмяКоллекции);
		ЗаполнитьКоллекцию(ТестОбъект, ИмяКоллекции, МассивСлучайныхЧисел);
		
		//Добавим вложенные коллекции
		КлючЧисло = ЧислоЭлементовМассива;
		Для Каждого ВложИмяКоллекции Из ИменаКоллекций Цикл
			ВложОбъект = КоллекцииКлиентСервер_бук.ЭкземплярКлассаУниверсальнаяКоллекция(ВложИмяКоллекции);
			ЗаполнитьКоллекцию(ВложОбъект, ВложИмяКоллекции, МассивСлучайныхЧисел);
			ВложКлюч = КлючКоллекции(ИмяКоллекции, КлючЧисло);	
			ТестОбъект.Добавить(ВложОбъект.Указатель(), ВложКлюч);
			КлючЧисло = КлючЧисло + 1;
		КонецЦикла;
		
		// фикс
		Если ИмяКоллекции <> "СписокЗначений" Тогда
			ФиксРезультат = ТестОбъект.СкопироватьКакЗафиксированныеДанные(Ложь);
			ФиксРезультат = ТестОбъект.СкопироватьКакЗафиксированныеДанные();
		КонецЕсли;
		
		// копия
		Копия = ТестОбъект.Скопировать();
		Копия = ТестОбъект.Скопировать(Ложь);
		
		// унфикс и копия фикса
		Если ИмяКоллекции <> "СписокЗначений" Тогда
			ФиксОбъект = КоллекцииКлиентСервер_бук.ЭкземплярКлассаУниверсальнаяКоллекция(ФиксРезультат);
			Копия = ФиксОбъект.Скопировать();
			Копия = ФиксОбъект.Скопировать(Ложь);
			НеФиксРезультат = ФиксОбъект.СкопироватьКакДанныеБезФиксации();
			НеФиксРезультат = ФиксОбъект.СкопироватьКакДанныеБезФиксации(Ложь);
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТестИтератор() Экспорт
	
	ГСЧ = Новый ГенераторСлучайныхЧисел;
	МассивСлучайныхЧисел = Новый Массив;
	МаксЗначение = 10;
	ЧислоЭлементовМассива = 10;
	Для Сч = 1 По ЧислоЭлементовМассива Цикл
		МассивСлучайныхЧисел.Добавить(ГСЧ.СлучайноеЧисло(1, МаксЗначение));
	КонецЦикла;
	Сообщить("Данные для тестирования " + СтрСоединить(МассивСлучайныхЧисел, ","));
	
	ВариантыШагаИтератора = Новый Массив;
	ВариантыШагаИтератора.Добавить(1);
	ВариантыШагаИтератора.Добавить(2);
	ВариантыШагаИтератора.Добавить(-1);
	
	ТестОбъект = КоллекцииКлиентСервер_бук.ЭкземплярКлассаУниверсальнаяКоллекция(МассивСлучайныхЧисел);
	Для Каждого ШагИтератора Из ВариантыШагаИтератора Цикл
		ТестОбъект.Сбросить();
		Результат = Новый Массив;
		Пока ТестОбъект.Следующий(ШагИтератора) Цикл
			Результат.Добавить(ТестОбъект.Значение());
		КонецЦикла;
			Сообщить("Обход шагом " + ШагИтератора + ">>>" + СтрСоединить(Результат, ","));
	КонецЦикла;
		
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьКоллекцию(пОбъект, ИмяКоллекции, пМассивДанных)
	
	// Заполнение коллекции
	Для Ключ = 0 По пМассивДанных.ВГраница() Цикл
		Значение = пМассивДанных[Ключ];
		пОбъект.Добавить(Значение, КлючКоллекции(ИмяКоллекции, Ключ));
	КонецЦикла;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция КлючКоллекции(пИмяКоллекции, пКлючЧислом)
	
	Если пИмяКоллекции = "Структура" Или пИмяКоллекции = "Соответствие" Тогда
		Результат = "Ключ" + Формат(пКлючЧислом, "ЧГ=0"); 
	Иначе
		Результат = пКлючЧислом;
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции


&НаСервереБезКонтекста
Процедура ТестНаРазвалНаСервере()
	
	ТестОбщийТестНаРазвал();
	
КонецПроцедуры

&НаКлиенте
Процедура ТестНаРазвал(Команда)
	
	Если Сервер Тогда
		Сообщить("Тест на развал на сервере");
		ТестНаРазвалНаСервере();
	КонецЕсли;
	Если ТонкийКлиент Тогда
		Сообщить("Тест на развал на тонком клиенте");
		ТестОбщийТестНаРазвал();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СкоростьПоискаНаСервере()
	ТестСравнениеСкоростиПоиска();
КонецПроцедуры

&НаКлиенте
Процедура СкоростьПоиска(Команда)
	
	Если Сервер Тогда
		Сообщить("Тест поиска на сервере");
		СкоростьПоискаНаСервере();
	КонецЕсли;
	Если ТонкийКлиент Тогда
		Сообщить("Тест поиска на тонком клиенте");
		ТестСравнениеСкоростиПоиска();
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ФиксацияКоллекцииНаСервере()
	ТестЗафиксироватьКоллекцию();
КонецПроцедуры

&НаКлиенте
Процедура ФиксацияИКопирование(Команда)
	
	Если Сервер Тогда
		Сообщить("Тест фиксации/расфиксации/копирования на сервере");
		ФиксацияКоллекцииНаСервере();
	КонецЕсли;
	Если ТонкийКлиент Тогда
		Сообщить("Тест фиксации/расфиксации/копирования на тонком клиенте");
		ТестЗафиксироватьКоллекцию();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ИтераторКоллекцииНаСервере()
	ТестИтератор();
КонецПроцедуры

&НаКлиенте
Процедура ИтераторКоллекции(Команда)
	
	Если Сервер Тогда
		Сообщить("Тест итератора на сервере");
		ИтераторКоллекцииНаСервере();
	КонецЕсли;
	Если ТонкийКлиент Тогда
		Сообщить("Тест итератора на тонком клиенте");
		ТестИтератор(); 
	КонецЕсли;
	
КонецПроцедуры


