


////////////////////////////////////////////////////////////////////////////////
// <Заголовок модуля: краткое описание и условия применения модуля.>
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область ОбработчикиПроведения

Процедура ОтразитьДвиженияПоОперациямПортфеля(Отказ, РежимПроведения)
	
	Если ЗакрытПринудительно И ЗначениеЗаполнено(Аккаунт) И ЗначениеЗаполнено(ДокументОперации) Тогда	
		
		РеквизитыОперации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОперации, "Портфель, Сделка");				
			
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.биг_ОперацииПортфеля");
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		ЭлементБлокировки.УстановитьЗначение("Портфель",	РеквизитыОперации.Портфель);
		ЭлементБлокировки.УстановитьЗначение("Сделка", 		РеквизитыОперации.Сделка);
		ЭлементБлокировки.УстановитьЗначение("Операция", 	ДокументОперации);
		ЭлементБлокировки.УстановитьЗначение("Аккаунт", 	Аккаунт);
		Блокировка.Заблокировать(); 
		 
		Набор = РегистрыСведений.биг_ОперацииПортфеля.СоздатьНаборЗаписей();
		Набор.Отбор.Портфель.Установить(РеквизитыОперации.Портфель);
		Набор.Отбор.Сделка.Установить(РеквизитыОперации.Сделка);
		Набор.Отбор.Операция.Установить(ДокументОперации);
		Набор.Отбор.Аккаунт.Установить(Аккаунт);
		Набор.Прочитать();
		
		Если Набор.Количество() = 1 Тогда
			Запись = Набор[0];
			Запись.ИнтеграционныйДокумент = Ссылка;
			
			Запись.Статус = Статус;
			
			Набор.Записать(Истина);
		Иначе
			//ВызватьИсключение("Запись движений в РС Операции портфеля. Получено непредвиденное Количество записей");
		КонецЕсли;
		
	КонецЕсли;		
		
КонецПроцедуры

Процедура ОтразитьДвиженияПоПрибылямИУбыткам(Отказ, РежимПроведения)

	ПрибылиУбытки = Движения.биг_ПрибылиИУбытки;
	ПрибылиУбытки.Очистить();
	ПрибылиУбытки.Записывать = Истина;
	
	Портфель 	= биг_ПортфельноеУправление.ОпределитьПортфельАккаунта(Аккаунт);
	Сделка		= биг_ПортфельноеУправление.ОпределитьСделкуПоПозиции(Ссылка, Аккаунт);
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.биг_ПрибылиИУбытки");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("Портфель", 	Портфель);
	ЭлементБлокировки.УстановитьЗначение("Аккаунт", 	Аккаунт);
	ЭлементБлокировки.УстановитьЗначение("Сделка", 		Сделка);
	Блокировка.Заблокировать();
	
	Если ЗначениеЗаполнено(ccy) Тогда
		Монета = Справочники.big_Currencys.НайтиПоНаименованию(ccy, Истина);
	Иначе
		РеквизитыИнструмента 	= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Instrument, "baseCcy, ctValCcy, quoteCcy, settleCcy");
		Монета 					= ?(ЗначениеЗаполнено(РеквизитыИнструмента.quoteCcy), РеквизитыИнструмента.quoteCcy, РеквизитыИнструмента.settleCcy);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(fee) Тогда
		Запись = ПрибылиУбытки.Добавить();
		Запись.Период		= Дата;
		Запись.Портфель		= Портфель;
		Запись.Аккаунт		= Аккаунт;
		Запись.Сделка		= Сделка;
		Запись.Валюта		= Монета;
		Запись.Убыток		= fee;
		Запись.Комментарий	= "fee";
	КонецЕсли;

	Если ЗначениеЗаполнено(fundingFee) Тогда
		Запись = ПрибылиУбытки.Добавить();
		Запись.Период		= Дата;
		Запись.Портфель		= Портфель;
		Запись.Аккаунт		= Аккаунт;
		Запись.Сделка		= Сделка;
		Запись.Валюта		= Монета;
		Запись.Убыток		= fundingFee;
		Запись.Комментарий	= "fundingFee";
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(liqPenalty) Тогда
		Запись = ПрибылиУбытки.Добавить();
		Запись.Период		= Дата;
		Запись.Портфель		= Портфель;
		Запись.Аккаунт		= Аккаунт;
		Запись.Сделка		= Сделка;
		Запись.Валюта		= Монета;
		Запись.Убыток		= liqPenalty;
		Запись.Комментарий	= "liqPenalty";
	КонецЕсли;

	Если ЗначениеЗаполнено(Pnl) Тогда
		Запись = ПрибылиУбытки.Добавить();
		Запись.Период		= Дата;
		Запись.Портфель		= Портфель;
		Запись.Аккаунт		= Аккаунт;
		Запись.Сделка		= Сделка;	
		Запись.Валюта		= Монета;
		Запись.Прибыль		= Pnl;
		Запись.Комментарий	= "Pnl";
	КонецЕсли;
        
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения) 
	
	ОтразитьДвиженияПоОперациямПортфеля(Отказ, РежимПроведения);
	ОтразитьДвиженияПоПрибылямИУбыткам(Отказ, РежимПроведения);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЗначениеЗаполнено(posId) И НЕ ЗначениеЗаполнено(биг_ПредставлениеДляОтчета) Тогда
		
		биг_ПредставлениеДляОтчета = Формат(Дата, "ДФ=yyyy.MM.dd") + " " + ВРег(Строка(posSide)) + " POS ID: " + posId;		
	КонецЕсли;
	
	Если Статус = Перечисления.big_СтатусыТорговыхОбъектов.Исполнен И НЕ биг_ОпевещениеВыполнено Тогда
		
		Ордер = ПолучитьПервыйОрдерПозиции();
		
		// Если это не алгоритмичесая позиция, то не сообщаем про неё
		Если ЗначениеЗаполнено(Ордер.КлючНастроек) Тогда
			
			СтруктураОповещения = Новый Структура();
			СтруктураОповещения.Вставить("posId", posId);
			СтруктураОповещения.Вставить("ТочкаНачалаПадения", 	Ордер.ТочкаНачалаПадения);
			СтруктураОповещения.Вставить("ИнструментИД", 		Ордер.ИнструментИД);
			СтруктураОповещения.Вставить("КлючНастроек", 		Ордер.КлючНастроек);
			
			ПроцентПНЛ = Окр(realizedPnl / (openMaxPos * openAvgPx / 100), 2);
			биг_ПодсистемаОповещений.ПубличноеОповещениеОСрабатыванииСтопЛосса(СтруктураОповещения, ПроцентПНЛ);			
		КонецЕсли;
		
		биг_ОпевещениеВыполнено = Истина;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьПервыйОрдерПозиции()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	big_Order_OKX.Ссылка КАК Ссылка,
	|	big_Order_OKX.ТочкаНачалаПадения КАК ТочкаНачалаПадения,
	|	big_Order_OKX.НастройкаСтратегии КАК КлючНастроек,
	|	big_Order_OKX.instId КАК ИнструментИД
	|ИЗ
	|	Документ.big_Order_OKX КАК big_Order_OKX
	|ГДЕ
	|	big_Order_OKX.tradeId = &tradeId
	|
	|УПОРЯДОЧИТЬ ПО
	|	big_Order_OKX.cTime";
	Запрос.УстановитьПараметр("tradeId", tradeId);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка;	
		
КонецФункции


#КонецОбласти


