
#Область ПрограммныйИнтерфейс

// @skip-warning ПустойМетод - особенность реализации.
// Возвращаемое значение:
//	ПланОбменаСсылка.ОбменСообщениями - ссылка на узел.
Функция ЭтотУзел() Экспорт
КонецФункции

// См. ОбменДаннымиПереопределяемый.ПриВыгрузкеДанных
// @skip-warning ПустойМетод - особенность реализации.
// 
Процедура ПриВыгрузкеДанных(СтандартнаяОбработка, Получатель, ИмяФайлаСообщения,
		ДанныеСообщения, КоличествоЭлементовВТранзакции,
		ИмяСобытияЖурналаРегистрации, КоличествоОтправленныхОбъектов) Экспорт
КонецПроцедуры

// См. ОбменДаннымиПереопределяемый.ПриЗагрузкеДанных
// @skip-warning ПустойМетод - особенность реализации.
// 
Процедура ПриЗагрузкеДанных(СтандартнаяОбработка, Отправитель,
		ИмяФайлаСообщения, ДанныеСообщения, КоличествоЭлементовВТранзакции,
		ИмяСобытияЖурналаРегистрации, КоличествоПолученныхОбъектов) Экспорт
КонецПроцедуры

// См. ОбновлениеИнформационнойБазыБСП.ПриДобавленииОбработчиковОбновления
// @skip-warning ПустойМетод - особенность реализации.
// 
// Параметры:
//	Обработчики - см. ОбновлениеИнформационнойБазы.НоваяТаблицаОбработчиковОбновления
//
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
КонецПроцедуры

// См. ГрупповоеИзменениеОбъектовПереопределяемый.ПриОпределенииОбъектовСРедактируемымиРеквизитами
// @skip-warning ПустойМетод - особенность реализации.
// 
// Параметры:
//	Объекты - см. ГрупповоеИзменениеОбъектовПереопределяемый.ПриОпределенииОбъектовСРедактируемымиРеквизитами.Объекты
//
Процедура ПриОпределенииОбъектовСРедактируемымиРеквизитами(Объекты) Экспорт
КонецПроцедуры

// См. ВыгрузкаЗагрузкаДанныхПереопределяемый.ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки
// 
// Параметры:
//	Типы - см. ВыгрузкаЗагрузкаДанныхПереопределяемый.ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки.Типы
//
Процедура ПриЗаполненииТиповИсключаемыхИзВыгрузкиЗагрузки(Типы) Экспорт
	
	Если РаботаВМоделиСервисаПовтИсп.ЭтоРазделеннаяКонфигурация() Тогда
		ВыгрузкаЗагрузкаДанных.ДополнитьТипомИсключаемымИзВыгрузкиЗагрузки(
			Типы,
			Метаданные.Справочники.СообщенияОбластейДанных,
			ВыгрузкаЗагрузкаДанных.ДействиеСоСсылкамиНеИзменять());	
	КонецЕсли;
	
	ВыгрузкаЗагрузкаДанных.ДополнитьТипомИсключаемымИзВыгрузкиЗагрузки(
		Типы,
		Метаданные.Справочники.СообщенияСистемы,
		ВыгрузкаЗагрузкаДанных.ДействиеСоСсылкамиНеИзменять());	
	
	ВыгрузкаЗагрузкаДанных.ДополнитьТипомИсключаемымИзВыгрузкиЗагрузки(
		Типы,
		Метаданные.ПланыОбмена.ОбменСообщениями,
		ВыгрузкаЗагрузкаДанных.ДействиеСоСсылкамиНеИзменять());	
	
КонецПроцедуры

// См. ОбщегоНазначенияПереопределяемый.ПриОпределенииПоддерживаемыхВерсийПрограммныхИнтерфейсов.ПоддерживаемыеВерсии
// @skip-warning ПустойМетод - особенность реализации.
// 
// Параметры:
//	СтруктураПоддерживаемыхВерсий - см. ОбщегоНазначенияПереопределяемый.ПриОпределенииПоддерживаемыхВерсийПрограммныхИнтерфейсов.ПоддерживаемыеВерсии 
//
Процедура ПриОпределенииПоддерживаемыхВерсийПрограммныхИнтерфейсов(Знач СтруктураПоддерживаемыхВерсий) Экспорт
КонецПроцедуры

// Устанавливает код этой конечной точки, если не установлен.
// @skip-warning ПустойМетод - особенность реализации.
// 
Процедура УстановитьКодЭтойКонечнойТочки() Экспорт
КонецПроцедуры

// Переносит настройки транспорта обмена сообщениями в новый регистр.
// @skip-warning ПустойМетод - особенность реализации.
//
Процедура ПеренестиНастройкиТранспортаОбменаСообщениями() Экспорт
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Обработчик регламентного задания для отправки и получения сообщений системы.
// @skip-warning ПустойМетод - особенность реализации.
//
Процедура ОтправитьИПолучитьСообщенияПоРегламентномуЗаданию() Экспорт
КонецПроцедуры

#КонецОбласти

