// @strict-types

#Область ПрограммныйИнтерфейс

// Возвращает версии интерфейса сообщений, поддерживаемые ИБ-корреспондентом.
// @skip-warning ПустойМетод - особенность реализации.
//
// Параметры:
//  ИнтерфейсСообщения - Строка - Имя программного интерфейса сообщений.
//  ПараметрыПодключения - Структура - Параметры подключения к ИБ-корреспонденту.
//  ПредставлениеПолучателя - Строка - Представление ИБ-корреспондента.
//  ИнтерфейсТекущейИБ - Строка - Имя программного интерфейса текущей ИБ (используется
//    для обеспечения обратной совместимости с предыдущими версиями БСП).
//
// Возвращаемое значение:
//  Строка - максимальная версия интерфейса, поддерживаемая как ИБ-корреспондентом, так и текущей ИБ.
//
Функция ВерсияИнтерфейсаКорреспондента(Знач ИнтерфейсСообщения, Знач ПараметрыПодключения, 
	Знач ПредставлениеПолучателя, Знач ИнтерфейсТекущейИБ = "") Экспорт	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// См. ОбщегоНазначенияПереопределяемый.ПриОпределенииПоддерживаемыхВерсийПрограммныхИнтерфейсов
// @skip-warning ПустойМетод - особенность реализации.
// 
// Параметры:
//	СтруктураПоддерживаемыхВерсий 
//	 - см. ОбщегоНазначенияПереопределяемый.ПриОпределенииПоддерживаемыхВерсийПрограммныхИнтерфейсов.ПоддерживаемыеВерсии
//
Процедура ПриОпределенииПоддерживаемыхВерсийПрограммныхИнтерфейсов(Знач СтруктураПоддерживаемыхВерсий) Экспорт
КонецПроцедуры

// См. ОбменСообщениямиПереопределяемый.ПолучитьОбработчикиКаналовСообщений
// @skip-warning ПустойМетод - особенность реализации.
//
// Параметры:
//	Обработчики - см. ОбменСообщениямиПереопределяемый.ПолучитьОбработчикиКаналовСообщений.Обработчики
//
Процедура ПриОпределенииОбработчиковКаналовСообщений(Обработчики) Экспорт
КонецПроцедуры

// Возвращает фиксированный массив, заполненный общими модулями, 
// являющимися обработчиками интерфейсов принимаемых сообщений.
// @skip-warning ПустойМетод - особенность реализации.
//
// Возвращаемое значение:
//  ФиксированныйМассив из ОбщийМодуль
//
Функция ПолучитьОбработчикиИнтерфейсовПринимаемыхСообщений() Экспорт
КонецФункции

// Возвращает имена каналов сообщений из заданного пакета.
// @skip-warning ПустойМетод - особенность реализации.
//
// Параметры:
//  URIПакета - Строка - URI пакета XDTO, типы сообщений из которого требуется получить.
//  БазовыйТип - ОбъектXDTO - базовый тип.
//
// Возвращаемое значение:
//  ФиксированныйМассив Из Строка - имена каналов найденные в пакете.
//
Функция ПолучитьКаналыПакета(Знач URIПакета, Знач БазовыйТип) Экспорт	
КонецФункции

#КонецОбласти

